{
    "reviews": [
        "If you are a 10 year old you'll think this is the most time pass paisa vasool film in the world. Truth to be told sitting through 3 hours of this film is a torture!!",
        "Very good movie I didn't expect much from this movie but I really enjoyed the acting of tabu is superb she is the main star of the film but ending scene was copied from movie alone which was bad but over all awesome movie recommend everyone to watch this.",
        "The story and screenplay of the movie is not so good. Except for a few scenes in the movie, all the other scenes are very simple. The movie can't be called a comedy movie and there are no special horror scenes in the movie. However, since there is no story in the movie, this movie is worth watching only once. It will be boring to see the second time. The music in the film is very good. Overall flop movie. It will be a waste of time, money and energy.",
        "Worst acting by both. Overacting by kartik and kiara..Seriously...did not like the movie at all.\n\nHow can you make the remake of any legend. Akshay comedy timing is unbeatable. Kiara..Do something new. In every movie, your overacting irritates a lot. Kartik, you should apologise to akshya sir. You can not stand anywhere. Akshay and govina sir are comedy kind. Nobody can beat them. Sorry akshay sir. You deserve this movie but unfortunately, they both have spoiled the movie because of their overacting. Ek bar bi hassi nhi aayi na darr laga. Puri movie boring hai.",
        "This movie not let u get bore in whole movie Each and evey scene is made up of funny and creative dialogue Omg loved this movie.\n\nI can't wait to see it again with my family.",
        "Bored after watching it. Bad music, ruined the original song. Background score is good but rest is below average. No logic, cringy dialogues. I guess now a days without getting a script from south Bollywood can't make a good movie.\n\nPls don't waste your time by watching this.\n\nApart from aayushmaan khurana now a days nobody is making sense able movies.",
        "Extremely childish, but it's thoroughly entertaining. Bhootni is standing with all the family members and having good discussion in a family Drama. Ignore your brain and enjoy.\n\nNot a single dull moment and it's Hilarious. One sequence in 2nd half with Rajpal Yadav, Sanjay Mishra and Bhootni is so hilarious that I can easily say I never laughed so hard since Andaz Apna Apna.\n\nAlso the climax is similar to the climax of US.\n\nKartik Aryan is awesome and so is Tabu.\n\nGuilty pleasure a perfect Family entertainer.",
        "Pathetic movie, the first installment of Bhool Bhulaiya was well made psychological thriller, while this movie is a complete waste of time and resources. Useless comedy, worthless horror and deviation from the first installment of Bhool Bhulaiya which advocated that there are no ghosts only psychological issues.",
        "Please do not compare with part 1.this is uniq story you won't find any connection at all.seems like few songs shouldn't be there that will distract you.story is good, jokes are good it could have few more.\n\nBrilliant performance by Kartik again. Kiara was superb. Thanks to Rajpal Sir and Sanjya Mishra sir they made tampo high in entire movie. Tabu Mam was MVP of the movie. It was tough to fit in Akshay sir shoes but Kartik you KILLED IT!",
        "We all know that kartik aryan is the finest of this generation.he is an outsider like srk and akshay kumar.yes right now he couldn't match the acting level of akshay kumar..but he has done really well.tabu is show stealer.she is the pillar of this film.director aneez bazmee has made good film this time..rajpal yadav is also very good like he always does..story,screenplay everything is superb.songs are not so good this time.overall it's good experienced film..5 out of 5 star.",
        "Anees Bazmee is Successfully Ruining Some of His & Other's Good Work by Annoying Prequels 😤 Just Slapstick Comedy, Overacting, Load Noise for No reason. Priyadarshan's Work was the sole reason Audience moved to Theatre to watch Part 2 but Complete Disgrace\n\n#Welcome #Bhool_Bhulaiyaa.",
        "I have watched the movie...... The comedy is awesome 👍......Horror itni nhi h But comedy was nice...... Supporting role of Rajpal Yadav & others was good....... One Time watch Movie toh hai !!!",
        "This movie wasn't made to replace Akshay Kumar so stop comparing. Bhool bhulaiya 1 was fab but this is amazing too. Hats off to Kartik for all the hardwork you put in. Complete Entertainer. Vibe is the same as 1. Cheers!",
        "I think climax could be better but movie is entertaiming and enjoyable. Rajpal yadav and sanjay mishra won't dissapoint you as always. Bhool bhulaiya 6/10.",
        "All time blockbuster film. Hatts off to Anees Bazmee. Anees this is your most entertaining film I've ever seen. Tabu the real heroine of the film who carries the show. Kartik hatts off man how do you do it. Kiara Advanis best film ever seen after Kabir Singh.",
        "Outstanding performance by kartik aryan and tabu mam they both are looking perfect in their roles and you can't forget about the two og's of this film RAJPAL YADAV and SANJAY MISHRA all time best comedians BUT WE WILL MISS U AKKI SIR.",
        "Thank You Anees Bazmee For not killing the Bhool Bhulaiyaa Vibe. Kartik Aaryan did a great job in entertaining us and No doubt Rajpal Yadav Sir's Legendary Comedy followed by Sanjay Mishra Sir.\n\nActually, The Female lead was not enough good to take over Vidya Balan in Such A Role, but you will not be disappointed watching this. Kartik Aaryan's Climax Performance was just killing, He Just Nailed It.",
        "Expected it to ruin the classic but this movie proved me wrong completely. Everything in this movie is good, acting, direction, story and cinematography. Music is averag, except this aspect the movie completely entertaining. Go watch it with your family.",
        "Tabbu mam was awesome .. Karthik was very good as well .. nice movie .. entertaining and engaging till the very end .. the horror scenes were really well presented with scary moments that were well executed .. the comedy was also good .. overall, watched a good comedy movie after a long time and watched a good horror film after a very long time.",
        "I expected mediocre comedy but to my surprise it was way above its notch. Different from first movie but theatre was a laugh riot and it was scary at the same time. A great movie by bazme. Must watch.",
        "What a performance by Tabu. Kiara looked gorgeous. Karthik could have been a little better. The 2 other songs other than the legacy songs were below average.",
        "This film is soo soo good for recent times! A family entertainer. Kartik Aaryan stole the show. His acting, expressions and performance is upto the mark! Quite impressive. A perfect joy ride with many horror twists and twirls. The script is very appreciable. The suspense of the film is properly maintained till the end. The second half is full of Goosebumps. People must look forward it! Tabu added the grace in the film. Her performance is commendable! Kiara, played a cute character. Loved the chemistry between the lead characters. The songs are chartbusters. Bhool bhulaiyaa 2 is a peppy one. De taali has its own vibrancy. Hum Nashe Mein Toh Nahin is perfect for a cool breeze love. Arijit Singh's Ami Je Tomar top all! The way Kartik performed to it, and maintained the grace is quite surreal to believe but he did it!",
        "-------------------------- Fantastic story Line... Tabu, Kartik and Kiara done a fabulous job..... full entertaining....great direction My Rating is 10/10 Must watch in Theaters... --------------------------",
        "The soul of the movie is Tabu...What a performance she has delivered, hat's off... Whatever kartik was offered ,he did justice to the role. Some comedy scene were good rest were cringe , Dialogues could have been way better if they would have taken someone else instead of Farhad Shamjee... Horror scenes were really good and well directed ... Overall a one time watch enjoyable movie.",
        "Boycott Bollywood justice for sushaant Singh Rajput, movie bhool bhu.... worst movie no story Bollywood lose the good family movie concept, drug drink mafia vulgarity pointless cinema anti hindu cinema which run by d company and khan lobby .boycott Bollywood jihadist forever.",
        "There is a lack of entertainment and story in this film. It's a lot more boring than part 1. Watching this is a waste of money. Watching the entire movie is no less than a torture.",
        "First thing's a completely fresh story. It is completely different from its previous part.\n\n*Rating According to me* 2.5/5 - Story 3.5/5 - BGM 2/5 - Comedy senseless 1.5/5 - Acting of Kartik Aryan 2/5- Acting of Kaira Advani 4/5- Acting of Tabu Mam 3.5/5 - Acting of all Co-actors\n\nOverall Rating (2.5/5)\n\n\"Well ,if you want to watch this movie for entertainment purpose then you should go. Otherwise it will completely disappoint you. Don't expect too much.\"",
        "Best movie.... Kartik is 100 times better than what Akshay kumar did in last movie. And also happy to see one more actor from the same league as Late Irfan khan, our beloved babu bhaiya. KK menion, pankaj tripathi... he will give a great fight to south superstars. Rest all the so called bollywood biggies are no where what he has given to this movie.",
        "Amazing movie, must watch. Great work by Kartik Aryan and Team. Also Tabu did an amazing Job. Great Horror Sequence with a good humour. That was not expected but yes, film is amazing!\n\nMust Watch!",
        "Paisa vasool. Wasn't expecting much from the film but it totally paid off. Loved it, the story, the twists and also i believe BB3 will come too because the twist at the end was too amazing that increases the chance for the next movie 😍",
        "COPIED FROM ALONE 2015 Bollywood film.\n\nVery Very weak Story. Story is disappointing.\n\nStory and Screenplay of Part 1 was way better.\n\nMain Actors are 1) Kartik Aryan 2) Tabu 3) Rajpal Yadav 4) Rajesh Sharma.\n\nThe movie is 2 hours 30 minutes long.\n\nOnly interesting part is the last 5 minutes.\n\nRest was garbage.",
        "Expected the Worst but it did surprise me to be honest. Loved the movie good fun watch. Tabu was class as always. Karthik and Kiara performed well. Other actors did justice to their roles too. Good fun watch.",
        "Enjoy every minute of the movie... Well directed movie... Kartik Aryan shine .... 🔥💯 Superb acting from all the actors who are in this movie .... Don't compare this movie with it's 1 part because it is completely different and you will enjoy this movie....",
        "Predictive climax there is nothing like horror and I accept that there is little good comedy, maker think we can sell tickets with the name bhool bhulaiya but this trick doesn't work any more .\n\nThere is no sense in the starting 40-50 min \" kuch bhi chal raha h \" .\n\nKiara advani ko rakha he kyu h starting se end tak toh chupi he rehte h .",
        "The movie is so poorly made that you aren't sure whether to laugh or cry.\n\nIt has repetitive jokes, no true plot and not scary.\n\nIf you are hoping this moving is a tiny bit as good as the first, you are mistaken.",
        "Excellent Movie Superb Acting Kartik Aaryan 👌 Comedy movie though Kiara Ka Role nhi hai itna khaas but Kartik is Superb 👌🤣 Kartik Ek dam Sonu ke titu ki sweety ki yaad dilata hai 👌🤣 Tabu's Role is Superb Villain 👌",
        "I didn't expected such an acting , i assumed that this iconic movie would be spoiled . But the way Kartik Aryan has performed, just tremendous. Hats off for justifying the iconic movie ..",
        "After seeing the trailer i had very low expectation as the first part was really good with priyadarshan direction i was not expecting bhool bhulaiyaa 2 to be good but in general the overall movie wasn't bad and it wasn't that good in my opinion its mediocre the climax in my opinion is good rather than having akshay kumar as special entry the climax was good. Definitely one time watch.",
        "Best movie ever guys .Just loved the performance of kartik and tabu ...really enjoyed a lot and it was higher than my expectations...really guys I thought it will be normal one but it was a blockbuster movie in this Era....loved it❤❤❤",
        "Its kinda ok ok movie... Horror elements are much better than humor.\n\nU can watch it for amazing performance of Kartik aryan and tabu...they both nailed it.\n\nU will sure get a nostalgic feeling when ami je tomar is being played.\n\nBut in the end , expect less and enjoy the movie.",
        "Awesome movie but story is too simple.kartik Aryan did a great job in the movie. Rajpal is also the key character in movie. Overall movie experience is 8/10.",
        "Its a good movie to watch. Go off with friends or family it will be a nice one, fun with horror, a must watch movie. Its a good movie to watch. Go off with friends or family it will be a nice one, fun with horror, a must watch movie.",
        "This movie didnot disappoint. Infact Kartik Aryan did better than Akshay Kumar. Kartik, Tabbu,Rajpal Yadav,Sanjay Mishra, Rajesh Sharma and specially child actor Samarth Chauhan did mind blowing job they were a team and did not fail to entertain the audience. There were whistles and clapping on dialogue. In short you will have 2 hours of entertainment.\n\nDo not compare the movie with part 1 its a complete different story and you cannot predict the plot till the end."
    ]
}