{"reviews": ["With one or two exceptions, animated shows from Disney really suck. Buzz Lightyear of Star Command IS one of those exceptions. The series is entertaining and funny. It has some of the charm of Toy Story. Best of all, this show doesn't try to install some sappy moral like Disney's Doug or Pepper Ann. I highly recommend Buzz Lightyear of Star Command.", "Buzz Lightyear of Star Command was the logical evolution for the series which started off as a computer-generated motion picture. This series follows the adventures of the real Buzz Lightyear (the tv series cartoon hero from the tv series within the movie that the Buzz toy from the movie was based on in the movie.) It sounds complicated but it's not. \"Buzz Lightyear of Star Command\" follows Buzz and his team of space rangers as they right the evil emperor Zurg and other baddies in their universe. The series is delightful and very funny. I find it rare to laugh-out-loud at an animated show, especially when there's no one to help fuel the laughter, but this show strikes a funny nerve.\n\nTo conclude, this is a worthwhile so you should definitely check it out. I highly recommend it.", "I watched this with my little brother when I was in high school. The show came on Saturday mornings and entertained us. I still sing the theme music. As a huge Disney/Pixar fan, I love Toy Story. The concept behind this show was cool because you get to watch what Andy watched and learned to love Buzz Lightyear from. The characters are memorable (which is the most important part of any production to me). The plots are a little weird but still okay. The show succeeded enough to hold my brother's attention and mine as well. But like I said, the theme music with the announcer's voice at the beginning is second to none in an opener for a kid's show.", "As a fan of the Toy Story series, I can say this cartoon is truly cool! The characters are all well-developed and XR (the robot) is especially amusing. The plots spoof Star Trek and Star Wars constantly with great results. Sure, Tim Allen isn't Buzz Lightyear, but Patrick Warburton does an excellent job and you can barely tell the difference. With weird and sometimes-offensive cartoons being released like Cow and Chicken and South Park, it's good to see a nice and clean action-comedy cartoon like this one. Highly recommended!", "I have made no secret of loving Disney, not only their movies such as Beauty and the Beast, Sleeping Beauty and The Lion King, but also their shows like Darkwing Duck, DuckTales and Talespin. Buzz LightYear of Star Command is a worthy series and this is coming from a fan of the two Pixar films, not the best show from Disney but infinitely better than the rubbish on the Disney channel now. The animation is good quality especially the galactic backgrounds, and the music is pleasant. The story lines and dialogues are intriguing and amusing, and the characters particularly beautiful and feisty Mira and villainous yet fun Zurg are great. The voice acting is well done, Patrick Warburton started off a little shaky, and while Tim Allen captured the character better, Warburton does a decent enough job. Zurg is brilliantly voiced by Wayne Knight though, and Warp has his great moments as well. Overall, worth watching and a worthy series, not the best out there, but an improvement on any of the shows airing now. 8/10 Bethany Cox", "The best cartoon made by Disney. Cool characters good and bad. Shows great adventures of Buzz Lightyear and his space ranger friends. Along with a whole new cast of characters is a great show loyal to Buzz Lightyear. Its followed by the movie which is how the cartoon begins.", "After the release of the direct to home video release of \"Buzz Lightyear of Starcommand\". They made a TV series continuing the idea with more stories and plots.\n\nBuzz, Booster, Meria, and X9 are all a team for Star Command. And together they protect the galactic system from villainy and terror from masterminds, criminals, and other forms of evil.\n\nThroughout the series you'll see plenty of character development with the main characters. As well as some parodies from the Toy Story movies. A lot of the episodes are cool to watch. Overrall it's cool for a syndicated TV series. May of ran for only 2 seasons. But it's a must for all Buzz Lightyear fans. Also deserves a DVD box set.", "I'd have to say that this is the best animated Disney show ever. I was dissapointed when I found out that Tim Allen was not providing his voice for Buzz. I'm getting used to the new voice slowly. I love his team, though! XR is the funnest and I end up quoting him often. Booster is cool, too. He always manages to make you laugh. Mira Nova is awesome! She is, so far, the absolute best of the good guys! She can be serious one minute and silly the next. I've never seen her flirt with Buzz, though. I think they would be cute together! My favorite villian would have to be Warp Darkmatter! He's really cool and I love who does his voice! Diedrich Bader rules!", "I liked the movie so I decided to checkout the TV series it's pretty good in fact this show introduces new characters. There's Buzz and his co pilot Mira, Mira's father King Nova, and Buzz's friends XR and Booster. There's also Zurg he's got a partner named Warp Darkmatter and he's got his Grubs theyr'e sort of like the LGM's. There's also XR's father Commander Nebula, and his brother XL. One time Buzz quit his job and moved in with a boy and his mother. But he eventually went back to being a space ranger. If you like the movie you might like this TV series so check it out you won't be dissappointed", "With moments that amuse children, and others that can make even adults laugh out loud, Disney's Buzz Lightyear of Star Command is truly a gem among failed TV attempts. Highly underrated, Star Command took some of the best actors, from Patrick Warburton to Wayne Knight, and made a classy, hilarious adventure show that deserved far more than the two seasons it got. Join Booster, Mira, XR and of course Buzz Lightyear on the action-packed adventures that do not disappoint, on the quest to rid the galaxy of evil. XR is a personal favorite, with a quick, witty line always ready, while Booster has a childhood innocence about him that while annoying, is almost somewhat charming. But the show revolves around Buzz, a space ranger sworn to protect the galaxy from harm and the evil Emperor Zurg, played by Wayne Knight.\n\nBuzz Lightyear of Star Command gets five space stations out of five!", "I waited until i was 28 episodes in before I gave a review. I'm pleasantly surprised that after all that time I'm still having a good time watching this show. Not every episode is solid gold, but none of them are stinkers, and the core cast is great. A galactic A-Team vs Zurg and his many mercenary henchmen. Buzz is a delight as the do the right thing, self sacrificing, and very capable good cop leader. His co-pilot, Mira Nova, who is just barely out of rookie status provides his best counter-balance. She is a well rounded character. XR or Experimental Ranger is a comedic R2-D2 meets Robby the Robot from Forbidden Planet. And there is the large, but lovable Booster, the most inexperience member of the team.\n\nThe plots are standard fare but so well executed, with clever dialog, that'll you easily forget that. Besides, Buzz Lightyear is light-hearted. It is more comedy than anything, but that isn't a negative. It is truly a fun and enjoyable show.", "I don't know why, but Patrick Warburton can't make \"To Infinity and Beyond\" sound as cool as Tim Allen did.\n\nThis show is probably the best cartoon Disney's put out in years, a million years ahead of that stupid Tarzan series that's in front of it. XR is my favorite, with Zurg a close second (Oddly, he comes off more as comic relief than scary.). The only thing I dislike about this show is Mira Nova. Something about Mira rubs me the wrong way (It seemed like she was flirting with Buzz in some episodes, a big No-No-Leave-Him-For-Jessie in my book), although I'm slowly warming up to her.\n\nIn short, this series is mostly cool. If you love Toy Story, you'll probably love, or at least like, this.", "This show is better then the new Buzz Lightyear which is releasing in 2022. The new one shouldn't be seen by any children at all and should only be seen by adults.", "I loved that show since I was a kid on Disney's One Saturday Morning's on ABC. Star Command emphasizes the importance of teamwork and of following the rules. Buzz learns the value of having a partner. This is a great spin-off of Toy Story.", "A'la such Star Wars, but even Buzz Lightyear of Star Command has a more interesting course of events than in ordinary Star Wars.\n\nThere are very interesting villains such as Zurg, XL and NOS4A2, TORQUE, who can be funny in some cases.", "I bought this DVD for my young son who loves the ToyStory movies. I never expected it to be in the same league as the Toystory movies but what I got was just another lazy Disney cartoon, way below what I expected from Disney/Pixar. The story is unoriginal, the characters are dull and two dimensional, the animation is below par, even Buzz isn't that great. The movie could have been so much better. I especially hated the paint by numbers storyline. I know it's meant for kids, but even kids know when something stinks to this level lameness.\n\nAlthough I did enjoy some aspects of the movie, I really liked the opening section of the movie, with the slag mutant monster, it just went downhill from there.", "Man were do I start,everything about this Cartoon from the Episodes,to the Stories,Script, an Animation is to me the Stupidest,Dummest and Most Annoying Cartoon that Walt Disney Television Animation ever CREATED and MADE ,Im so glad that Both Toon Disney (2006) and Disney Channel to Stop Airing it in the U.S. as Of This May 2008.\n\nBelieve me it's A wise choice to skip this out cast and black cloud of A cartoon,if you watch it don't say I did not alert an warn you.\n\nYour in for A Boring and Down right Dull and Confusing Time,I wish and pray I never even saw 1 Episode of this Cartoon Buzz Lightyear Of Star Command. If I could I would have the Part of my Brain removed that Remembers watching it,yes it is and was that Bad."]}