{"reviews": ["It wasn't that bad of a movie, but undoubtedly it had a few flaws in terms of screenplay. The story itself was fine, and I'm personally a big fan of Captain America's origin story so this movie was a nice watch for me. Maybe not so much if you don't care at all about superheroes such as CA.", "At the time it came out, this was my favorite MCU film. I don't know how this one could've been done much better.\n\nThe casting is perfect!! Evans was obviously the choice to portray Steve Rogers. I will forever keep Hayley Atwell in that red dress as a fond memory. Weaving as Red Skull? No brainer. No one else could've done it as much justice. Stan, Jones, Tucci, and the rest of the cast of characters bring the story together.", "Beautiful and exciting movie about war and about a man with a big heart who gets to be a super soldier. Really nice and entertaining movie at a very high level, really well done.", "During World War II, Steve Rogers, a frail man, is transformed into the super-soldier Captain America and must stop the Red Skull from using the Tesseract as an energy source for world domination. There is a plenty of good performances and pulpy action sequences. The movie has a very good CGI and a beautiful origin story. Captain America The First Avenger is an entertaining ride that doesn't take any significant and creative risks.\n\nRating: 7,3.", "This movie excels in every way a superhero movie should be. Lots of action, some humor, a love scene or two, and lots of thrills and chills. Chris Evans plays with gusto performance as Captain America/Nick Rogers, a skinny man who with the power of something that's like steroids becomes a super soldier intent on defeating the Nazis and Red Skull, played by Hugo Weaving. The British actress who plays Cap's girlfriend is hot. I'd choose her over Mila Kunis night and day. The effects are good, and the attention given to the movie from the comic book is well done. Stay after the credits for the Avengers trailer. It's worth the $10. Stay away from the 3d version.", "People suck, that's the only reason this movie is rated to low! I love this movie!", "An excellent movie that I very much enjoyed watching, not the best Marvel movie, but it's one of the best. The villain of the movie was not up to the standards. He could have been better than the one that appeared from the movie. I'm surprised that the movie is considered one of the most hated Marvel movies.", "Captain my captain; you have come into your own as a movie. MAN I loved this film; it was a perfect example of what a superhero film should be. It made the best of humor and action and told us a story of how a scrawny kid from Brooklyn with a huge heart made a difference in World War II. This movie is one complete origin film that makes a huge springboard for next summer's The Avengers. The people at Marvel have an excellent crew of film makers who understand that humor, action, drama and excellent story telling are key points in film making. This movie gets a green light from me and is a great action ride that is a 'do again' just to let the movie wash over you. I am going to go see it again because it's a movie that looks good on the big screen.\n\nTo see more of this review go to fatsamuraireviews.blogspot.com", "Best Marvel film so far. Thank you Joe Johnston. Love story also beautiful and best!", "This is one of the Best Marvel Movies I have ever seen, you have to go back and watch this Movie.\n\nIt's the Best Origin Story of all of the Marvel Characters so far in my Opinion.", "What's to say about Marvel films, with their unlimited resources and best-in-the-industry cast and crew? This story is cool because it brings some real-life historical aspects to MCU, with American patriotism and WWII, and chronologically is the start of the \"enhanced individuals\" they'll call heroes. I love Peggy's character, she's very important to the story and one thing Marvel remembers to do is to make the women more than just your average \"love interest\": they're strong and pull their weight just fine. As far as blockbusters go, this is pretty nice and delivers a good backstory to the Avenger in question.", "I not sure what to right, in 2011, this was my second marvel movie and the both were fantastic (TOR + Captain America). I love it. Guys just go and watch. I am waiting on the Avengers now. Also, don't miss out the credits they will show the Avengers trailer in the very end. This movie starts from the making of the \"Captain America\" and beautifully ends up in the New York City current day where Steve Rogers and head of STARK foundation meet. Movie has a lot of details about Captain America. Only thing which I might question was gun used by Steve. I don't recall from comics that captain America has gun but maybe I am wrong. Also, what I like was Tony Stark's father Howard Stark in the movie.", "Brilliant movie from start to finish. Captain America is my favourite character in MCU and Chris Evans portrays everything that is good in captain America really well. Real good story and with CA and Buckie being a massive part all the way through this reall was done well.", "Captain America is a movie just to be watched. The storyline is not as strong as expected from Marvel series. The start is very promising but derails as the movie progresses. Climax could have been better. Overall an enjoyable movie.", "If there's one major element that truly sets this movie apart from any other standard \"solid\" comic book movie, it is the way through which the director communicates the experience. We feel for Steve Rogers and fully embrace the character as we go along with him on this amazing ride. This movie isn't about comic book pulp or American propaganda but about a deep and meaningful story. The elements are fantastical but perfectly balanced by the time period and \"greatest generation\" setting. This visual and emotional imagery is presented throughout the movie and provides the viewer with greater insight into the heroes AND villains. This one screams quality from the opening scene and screams fun all the way through.\n\nFor those going into this flick expecting a lot of fun, prepare to enjoy-- although fun's not the only piece of this pie. In fact, I think all movie fans will be stunned at how many levels this movie delivers upon. This is a smart and surprisingly deep film that really delivers everything I wanted to see.", "Sigh. Another superhero movie this summer? This will have been the fourth major superhero movie this summer and by this point most of us are tired of it. The only shot Captain America has this summer is doing something different than its other competition by giving us an experience we haven't seen this summer. Luckily Captain America does just that. The movie is a period film set in the 1940s that also tries to feel like the serials that were popular at the time. The movie has a very old school feel to it which separates it from its competition, but can its retro style really make it one of the better films of the summer?\n\nCheck out the rest at http://mastersfilmreview.wordpress.com", "HECK YES! My favorite Phase 1 movie besides The Avengers! Has the feel of a period film while still being modern. Has the best origin story of phase 1. Has a very likable, very relatable character. Grade: A+ 10/10 5/5 stars", "When I first heard that Captain America was being brought to the screen I cringed. How could they translate the complexity of character and his true coolness but stay away from any cheese? Dress a guy in the flag and remain true to the seriousness of the Depression and World War Two era? Well, they managed to pull it off almost perfectly! The director knew that you had to establish and truly care about the character before he was transformed. He spends valuable screen time establishing his characters and the universe but does so with style and with heart. Making it a period piece really helps give it a flavor unlike any other comic adaptation. The director worked on Raiders of the Lost Ark and it shows. If you could compare Captain America to any film, it would be that one. Everything established early pays dividends, allowing the action to flow but also allowing for better development of the plot. This also allows them to probe deeper into the character's personalities. This heightens the tension, so often missing from comic-book movies, and adds real weight to the action sequences which are thrilling and often mesmerizing. The result is a film that's just flat out exceptional.", "I've seen every MCU movie once when they came out, starting with the first Iron Man, but I am now rewatching all of them in the \"MCU chronological order\". And this movie is indeed the perfect way to start this epic saga. I was never a fan of Captain America as a character in the comics but they managed to make him a lot more interesting in the movies. I now have another 21 movies to watch again to reach Endgame and if they all turn out to be as fantastic a second watch as The First Avenger was I'm probably going to burn through this in no time!", "Awesome! You won't waste your 2 hours to watch this movie.", "What could have been a by-the-numbers origin story (and in some respects, it is) is instead a highly entertaining war adventure film with a big heart. It's probably the MCU's most underrated movie.\n\nThe cinematography and production design are a lot better than I remembered. The shot of the Hydra aircraft sinking in the ice is gorgeous, and I really don't know how I never noticed it before.\n\nFrom the moving scenes between Steve and Dr. Erskein, to its loving lampooning of the character's origin as a pulpy piece of propaganda (that song rules by the way), the movie's just a blast to watch and it makes me smile every time.\n\nIt's very wholesome for a film that has the goriest death in the whole franchise.", "I don't get how this movie ended up with a 6.9. It's a great movie! The actors fit their roles perfectly, the CGI holds up real nice (especially after 10 years), and the storytelling is top notch. As far as an origin story is concerned for a superhero none other than Captain America they got it well done here, and if you watch this first in chronological order it's sets the tone for the majority of the MCU (Iron Man is and always will be the kickstarter to the MCU, but that doesn't mean our boy in red, white and blue here doesn't deserve some praise)", "It is a fun and entertaining film. The story of the film is great but the screenplay gets a little slow in the middle. The direction by Joe Johnston is great. The actions scenes with the use of CGI and visual effects is amazing. The performances of the cast are amazing especially Chris Evans as Steve Rodgers. Definitely worth a watch for all superhero movie lovers.", "The most grounded and realistic captain america portrayal that honours its comic roots and has frikkin hugonweaving as the bad guy! Underrated!", "The beginning of Marvel's Cinematic Universe! A great movie!", "Easily fulfilled and then exceeded all expectations. Can't wait for Avengers! Who would've thought years ago that ALL Marvel based films would rule the summer?!? Without question, Thor, X-Men First Class and now Captain America were/are the best movies of the summer. Nothing else has come close. If this summer movie season where the Olympics, I'd say Cap took the gold. First Class grabbed the silver and Thor finished fractions out of first with the bronze. Pirates, Hangover 2, Super 8 and Transformers finished out of the money and Green Lantern came up lame and didn't even finish the race. It's been a great summer. Everyone might as well label it correctly\u0085 a MARVELous summer!\n\nI just loved Captain America. I thought it was smart and the impressive cast really delivered! This movie works on so many levels and makes you draw on just about all of your emotions. I don't remember when I enjoyed a movie this much!", "Really? First of all, the whole Nazi alternative history theme should be retired. Second, I love Marvel comics, read them as a boy, many of them. I liked them. So I understand the initial urge to accept yet another movie bringing up the Marvel super heroes. Ever since Stan Lee decided to retire and count his money, the franchise has declined into mere commercialism. Sometimes the same old tricks, and the tired chase scenes and the over-worked dangling from peril scenes can only be stretched so far...in this film it is to far. After watching the film I could not tell you what is was about, it is completely forgettable. I cannot recall a single interesting moment beyond my surprise to see that Tommy Lee Jones is in the film. I had no idea he was. Really, I am astonished at the overall high rating of this piece of trash. Is the attention span of the movie-going public so in decline? That such a poor film could be so well rated is mysterious to me and would make a more interesting subject for a movie than this film was.", "You knew comic book movies couldn't have peaked in 2003. They just needed until 2011 to show how to perfect the genre. (With a big boost from 2008) Does this movie deliver? Well, let's see what is has to offer. It delivers tremendous characters, impressive visuals, outstanding story, the right amount of humor, emotional resonance and prodigious acting. What else is there? If someone doesn't like this film, I can't understand why. Chris Evans really delivers and his Captain America will rank right up there with the best performances of any actor in this genre. All the cast comes through in big, bright ways.\n\nThis, so far, has been the best movie I have seen all year. All in all, this is one great film that I look forward to buying on DVD. The best superhero ever? Does it matter? I saw this last night and it was a true event movie. Seeing it in a packed house was like attending a very cool athletic event. Maybe that made the experience even better but I guarantee that this movie generates great word of mouth. Critic, fan and box office numbers already prove that fact.", "This remarkable film showed that they really cared enough to ground this film where possible. That's what Marvel does so well. It's what Nolan does well and that's why people call what Nolan did to Batman \"Marvelizing\" the character. The story and abilities are fantastic and grand but the character and depth add the weight you need to tell a believable yet intelligent tale. That's tough to do when the subject matter is this fantastic and the elements they deal with are so grandiose.\n\nThe complexity, depth, heart, emotion and action are some of the best put together in any film this year. I have to agree with most of the film critics who are praising it and I'm glad it's getting the love at a high percentage. It would've been a shame for it not to be praised by the professionals. It really is professional, throw-back fun with heart and emotion.", "The Story ark of Steve Rogers is great, and Chris Evans is the perfect choice to play this character. I also liked his relationship with Bucky and Peggy. The story itself is very interesting and has some very beautiful moments. What I don't like about this movie are the villains. Hydra and Red Skull are really boring in this movie. Also, the good fight scenes of WW2 were made into short montages.", "Great origin movie and then transition. I gave it a 10 because some idiots rated 3 and below. This is a perfect setup for Captain America in the Avengers.", "One of the year's best. It's a complete movie that flows so very well. Unlike similar films that are geared mostly to kids, this one has something for the grown ups. The way you're drawn to the main character as he grows from a a bullied kid with problems to an intense true hero is remarkable. As a viewer, you are constantly vacillating between intense sequences and fun moments. Needless to say, there's nothing to dislike about this movie. In every respect, it's a better film then any other effort of 2011, so far.\n\nThis film works on all of its own terms, there's no cinematic slumming involved in enjoying it. I thought it was smart and the cast really delivered as expected. With this exceptional cast involved, how could it not? It truly is the best movie produced this year to date and I'm glad to see that the majority of film fans agree with me. The movie works on so many levels and makes you draw on just about all of your emotions. Best of all, you leave the theater smiling.", "Captain America the First Avenger is a solid origin story and a good start to the Captain America trilogy. The cast is great and the villain, Red Skull, is decent. The movie is very good before he becomes Captain America and the final act is good. The film drags a bit in the middle with the montages and the Captain America stage performance stuff. Other than that a good movie.\n\n7.7/10", "I don't understand why this film has so low rate. Firstly, the story is interesting, it shows WWII with some additions. It's classic comics story. Secondly, the cast is great, Cris Evans is perfect Captain America. Thirdly, the action itself and visual effects are wonderful. So, it's good film from MCU, phase 1.", "The movie starts strong I really enjoyed the Steve Rogers to Captain America journey, Chris Evans brilliant performance he actually made me root for the poor Steve in the beginning, the atmosphere is pleasant, the chemistry between Steve & Peggy is cute BUT the downfall of the movie is the fact that as time goes by it gets worse and worse the direction of the movie gets lost along the way, you're stuck seeing action scenes over and over again to the point where you don't seem to care about Red Skull or his plans anymore, the only thing you care about is for the movie to just end.", "a solid intro to captain America\nChris Evans is perfect for the role\nwell paced action\ngreat dynamic between Bucky and cap", "Captain America: The First Avenger introduces Steve Rogers (Chris Evans) and explores the origin of how he became the titular hero.\n\nThe sets are amazing, the way they recreated the WWII era is dazzling. Evans gives a great performance as the Cap. He's supported by an excellent cast! Hugo Weaving portrays the villainous Red Skull and while I do wish he had more screen time, he's still the best villain in the MCU Phase 1.\n\nI don't understand how this one is rated lower then Thor and Iron Man 2. It's way better then either of them.\n\nTwo Thumbs up!", "The period designs were awesome! So was the story, villain & morals. Peggy is a badass and Steve is such a loyal person and will never give up on what's right!", "Overall this movie is quite enjoyable. The historical World War 2 setting gives it some depth and meaning. Chris Evans is likable and its quite amusing seeing his skinny version so all nerds out there can identify with his character. How did they do that? Hayley Atwell is a fiesty non English rose type (maybe because she is part American anyway). Stanley Tucci's German accent is a bit laughable might have been better casting a European instead. Doesn't rely on violence and overdone CGI for excitement so it's quite suitable for the family. The weapons seem a bit high performance for the time period but that's a small thing. Go see it on the big screen.", "This may be the best super-hero film ever because it was true to the comic book, had believable characters and exhibited true life emotions. It was 10 times better than Thor which was all special effects, 100 times better than all the Hulk movies, and better than all the X-men movies except maybe Wolverine Origins. I also give two thumbs up to Green Lantern for the same basic reasons. Being set in WWII allowed the movie to be classy because the women didn't have to dress like hookers and it was OK for the men to have honor and patriotism because the philosophy of greed and \"me first\" had not been introduced to America yet. The movie was both entertaining and inspiring. It brought tears to my eyes in many places because it was so good and because it reminded me of what America is really all about.", "I love superhero movies when they are done right, and Captain America is one of the better ones I've seen recently and a big improvement over the 1990 film. Is it perfect? No. Entertaining? Yes, I think so. It is a very well made and efficiently directed film, with wonderful costumes, effects and settings and the cinematography and editing also impress. The music is rousing, and I just love Star Spangled Man, one of Alan Menken's best songs in my opinion. The script is witty and smart. Cheesy also? Perhaps but in an endearing sort of way. The story has a strong start, but loses its way to sluggish pacing and clichés in the final act. The characters are clichéd too in a sense but like the actors are engaging. Chris Evans is perfect in the title role, and he is joined by sassy Hayley Atwell and a wonderfully gruff Tommy Lee Jones. Hugo Weaving wasn't quite there for me, he is a great actor and he is charismatic and menacing, but his accent is inconsistent and the character could have been delved into more. Overall though, a lot of fun. 8/10 Bethany Cox", "I obviously enjoy this film more than others and I just don't understand how or why people hate this movie, and how it has the same IMDb rating as Captain Marvel! I loved almost everything about it, although I will admit the first half was much better than the second. And that's not me saying the second half is bad, but the first half is nearly perfect, in my opinion. Overall, I love this movie and I think it was the perfect movie to precede the Avengers.\n\n8.6/10.", "Good origin story with some great action. once captain america grew on me with winter soldier and civil war, it completely changed my view of this movie. now the righteousness is fitting, and the corny jokes work. and after watching it again, wonder woman kind of copied this, a lot. i still like it better tho. (5 viewings, 4/18/2020)", "The trailer made this movie seem a bit above average, not amazing but above average. And that is what this movie was a above average superhero movie that is pretty good but not great. The build up to how Steve Rogers becoming Captain America is well crafted and the action sequences was entertaining to watch. I thought it would have been better if it added some aspects from the comics into the movie, but it's still a well paced story for the most part. Just about all the actors was great with there roles, I wasn't so sure about Chris Evans being Captain America but he pulled the role off really well. He was actually really believable in this movie and looking forward for him to appear in the upcoming Avengers movie. Hugo Weaving has always been great playing villains so it was a no brainer for him to play Johann Schmidt. To sum it up I got what I expected out of this movie, a good but not a freaking amazing superhero movie. I personally thought it was slightly better than \"Thor\".\n\n7.6/10", "Good Marvel movie.\n\nI used to hate Captain America, but i think i'm getting liking ;)", "Okay so I was probably the most surprised about how good this movie is. I didn't expect much of it in the beginning but oh my god this is nearly a masterpiece. I started to like Chris Evans as Captain America immediately. It's the only MCU Movie without any gimmicks so it's quite fun to watch the raw fight of Captain America and the U. S Army against Hydra. The end was pretty good as well and seems like a nice introduction to the Avengers.", "Just saw Chris Evans helm the role of the first Avenger, and I must say it was more than entertaining. I immediately got sucked into the movie, leaving no prisoners around. Seeing Steve Rogers as a little puny, yet gutsy guy was one of the best moments, somehow it gave more character to the legend. Even my initial fear of a gimmicky Red Skull was proved wrong, Hugo Weaving and the make-up artists did a great job. Although I did always imagined Johan Schmidt to have a thick German accent. Either way, the story, the pace, the supporting cast (Tommy Lee Jones was a brilliant pick), and the eye candy SFX made it all into one of Marvel Studios proudest moments. Can't wait to see Avengers.\n\n8/10", "Captain America The First Avenger is a pretty fun entry in the MCU. The character development is good, I like the action scenes. And I do think that red skull is a pretty underrated villain. However the pacing is kind of off. And the film can feel a bit rushed at times. Overall The First Avenger is a fun MCU flick.", "Baddie Weaving wants to defy Hitler and take over the world after finding the all powerful tesseract, ably supported by fellow nut Jones. Meanwhile weedy wannabe soldier Evans undertakes a experiment designed by scientist Tucci and turns into our hero.\n\nNice start to the Captain America element of the MCU taking Evans through his traditional comic book hero of WW2 battling evil Weaving whilst the romantic element which will be so important going forward is well managed.", "Sure, the overall story was very rushed but it does not justify such a low rating. This movie should be around 7.5 or 8.", "Considering all the recent superhero movies have varied from bad to very good but not great I wasn't sure about this one. The cast on paper was very good but I wasn't sure if a movie set in World War 2 would be relevant in the present day. Well, Capatain Amercia: The First Avenger works and is easily one of the best movies of the year. The cast is outstanding and the story should keep you riveted. The movie has just about everything for everyone action, romance, drama, etc., which is something I think the other recent superhero movies may have lacked. Hopefully, The Avengers and the following sequels, if there are any, are just as good or better.", "After creating several other Avengers movies, such as The Hulk, Iron Man and Thor, it was finally time for creating a film about the beloved action hero, Captain America. And this one does not disappoint. We see the story of Steve Rogers, who has been constantly rejected by the army, finally getting the chance he deserves. I have to say, Chris Evans's leading performance is rock-solid, and the performances by Hayley Atwell, Tommy Lee Jones and Hugo Weaving are no disappointment either. The entire film's production is top-notch, ranging from excellent sound design to eye- popping visuals, to a solid film score by Alan Silvestri. Some of the action sequences feel a bit too comic book-ish in my opinion though, and at some point you feel like you're watching a trailer rather than an actual movie. But, nonetheless, at other times they are brilliantly executed and I have nothing to complain about. The driving force of this movie is not delivered trough action or CGI though, but trough the emotional connection between the characters, especially the one between Steve and Bucky, his friend. Anyway, I won't be spoiling anything, overall it's a very solid, humorous and action-packed superhero movie, and it's one of the best Marvel movies to date. It was a pleasant surprise, and is definitely worth the ticket.", "This movie has taken me back to the time of WW2. The story is about a man with immense courage and pure heart who never gives up. This man is none other than Steve Rogers. The story line is perfect starting from the times of WW2 and laying the ground for the future Avengers movie. This films portray Steve Roger's love for his country and his dutifulness. It also has a romantic love story between Steve and Peggy. In short this film is perfect blend of action, drama and romance. One should definitely watch it before the other Avenger's movies.", "I didn't like this at all. At least Thor was pretty good and had an excellent beginning. There wasn't anything I liked about this movie. First Chris Evans is not a lead actor. If I saw him in a commercial, I wouldn't know who it was. Second Captain America doesn't have any cool weapons or abilities. All he does is throw a shield around like a boomerang and can jump really high and long. Most of the story was just boring as it showed Steve Rogers joining the army, getting transformed into a big guy, then he goes around the country raising money. Over half the movie is about this.\n\nThen the bad guys are the Nazis, with the leader being a guy with a red head and no nose. He doesn't have any cool abilities either, just some neat gadgets like a gun that makes people disappear.\n\nFINAL VERDICT: The whole was just terrible. Not worth your time.", "The humor, angst and drama are remarkable for a superhero flick. I can't think of a weak moment in the film, as it is strong from beginning to end. Anyone doubting Chris Evans in the role need worry no more. He's Oscar caliber good in this movie. His amazing performance is aided by what can only be called an amazing CG transformation. In this case, it's pre-transformation. Everyone is perfectly cast and perfect in their roles. Hugo gives one of the greatest villain portrayals in modern cinema history.\n\nThis easily fulfilled and the exceeded all of my expectations. I can't wait for a solo sequel even though it will be cool to see Cap in Avengers. I like how they handled the modern era and depression era stuff. This really is everything anyone would want in a movie. I know it's everything I had hoped to see.\n\nCaptain America is pure fun, a perfect mix of old school dazzle and good old-fashioned charisma. Marvel-ous!", "I don't understand all the hate for this movie. It's one of the best MCU movies. They put the whole CA story togeather perfectly, and the action scenes are amazing. Better then The Winter Solider.", "Look at my boy, look how they massacred him in The falcon and the winter soldier.", "This was an excellent movie, very well done. I especially liked the fact that this movie had Captain America as a very good character. This movie also is good because it shows the first half of the movie well. It explained in a very well done way how Steve Rogers became Captain America. The rest of the movie is fun and action packed. Everyone who watches this will enjoy it. Despite the Red Skull's scary looks and evil deeds. I also liked this movie because it didn't completely focus on the violence, like some other super hero movies. Chris Evans and Hugo Weaving were both good actors in this motion picture, and they are so good, they will probably keep you in your seat for the entire film. This movie also attracted many people once it came out. The only thing I didn't like about the movie is the ending. Since this is not a spoiler, I will not reveal the ending. Just watch the ending, and you'll see what I mean. Three cheers for Captain America!!!", "what do you call a superhero in a world of superheroes? Answer...normal. Green Lantern was totally ruined by making the first and the last movie in one go, same with Thor. Why can't we have a superhero who lives in the real world, dealing with real world problems. We didn't need Red Skull in this movie until at least movie two. A whole world war with both side racing to make atomic bombs was enough for movie one. These super hero movies are too much too quick. Slow down Hollywood. Anyway, Captain America is BY FAR the best of the recent superhero movies. Steve Rogers has much in common with Peter Parker. People you can genuinely like and care about. A great standard of film making throughout. No SFX overkill (Green Lantern) and the wonderful, irreplaceable Tommy Lee Jones. Definitely one for my collection!", "That's all this movie is: Propaganda.\n\nIf you drink your milk, pay your taxes, believe in imaginary creepy father figures in the sky, trust the government that steals from you every day, and still think you live in a democracy, then go watch this movie, you'll love it.\n\nOtherwise, stay at home and watch a B movie, it might be bad, but at least it won't try to brainwash you.\n\nThis actually reminds me of those anti-Nazis Disney cartoons. It's just as creepy, and as ideological.\n\nSure, Captain America was just cheap propaganda in the first place, using tactics picked right out of a Nazi handbook, but I thought McCarthyism had gotten subtler in the past 50 years.", "A comic book character should be treated as such. To do more is to redefine the character and create something new, rendering the character unrecognizable. This movie succeeds in maintaining the character's identity. However, the problem with the movie is the shallowness of the story, the utter lack of anything that even remotely resembles emotional depth and the simplistic treatment of subjects as complex as the corruption of science and of war itself. Just because a character is out of a comic book does not mean that character should be treated as a caricature. This movie is set during a time of great and momentous change. That does not mean the movie is poorly crafted, rather it means that their is paucity of content as the director opted to dazzle the audience with special effects to keep the audience's attention. Now of course the movie tells a story, but in doing so sends a message suggesting that the U. S. needed superheroes to the war, which is not true. The war as won by regular people who performed heroically, no matter their body type. Nevertheless, the movie is upbeat, the acting is good, the bad guy is sufficiently sinister and for those reasons the movie is worth watching. Just remember: it's fiction; not history.", "This film did a good job in capturing the heart of Captain America; Chris Evens did a perfect job of playing the role. The rest of the cast, Hayley Atwell, Tommy Lee Jones and Hugo Weaving also helped bring this movie father up to standards. The film had a well picked cast, great filming and a solid story. The tone of the movie is a little gloomy since it's set during world war 2 and Captain America doesn't have the most appealing powers/abilities like other heroes. But the movie is still very entertaining and a must see to fully understand other marvel movies.", "Well written and acted. Great character dynamics and character orgin.\n\nDeserves a higher rating. Or at least 7. Not 6. I'd give it an 8 but my respect for this film and love for the character in this movie compels me to give it a 10.", "Chris Evans born to play Captain America, he's the natural choice for this role and he did a fantastic job. Each and every cast members in this film played their part well.\n\nCaptain America: The First Avenger is a wonderful origin story that tells the many adventures of America's truest hero. As a fine addition to the MCU, The First Avenger is a spectacular superhero film as well as one of the most memorable World War II films ever made.", "I saw Captain America: The First of The Avengers on the day it came out in the UK and it was Great!!!! There was a continuous storyline that actually made sense unlike most other superhero movies that show the formation of the superhero. The film itself was always capitulating there was even a couple of funny bits. The fact is that this is probably the best superhero movie made so far. The action is almost nonstop from about a third of the way through but that first third isn't boring it's a very good build up and it doesn't loose the audience. The use of CGI isn't even evident even though you know it's there it's really well hidden. The thing that makes this only a 9 out of 10 is that we don't really see any the change of Captain America from being scrawny to being Captain America. Everything else in the film is pretty much great. Would definitely recommend to anyone who likes superhero movies.", "I've seen Captain America: The First Avenger as the last in a string of movies based on comic books. And it was the one that prompted me to make a break from such movies.\n\nCaptain America: The First Avenger offers nothing beside CGI and action. Chris Evans' character qualifies for the ultimate dude with the body of a demigod and little brains, which seems to be the norm in such movies.\n\nI'm not even sure what the authors' goal was apart from return on investment. I'm obviously not the right audience, but even when i watch movies for fun i expect my intelligence to be at least remotely tackled, which obviously didn't happen here.", "Just saw Captain America a second time today. Loved it just as much the second time around. This is not a film I would have chosen to go see - not my favorite genre - but my kids were dying to see it. After having had to deny them the opportunity to see several other superhero films due to the film ratings for language, sex, and violence, I was wary of this film. I knew nothing about Captain America whatsoever. So I did my typical research, determined the film passed my test as far as I could tell (never know with ratings these days), and I went to the theater hoping I would not be disappointed. I wasn't. My kids thought the the movie was fantastic, and I loved it as well, especially since it was free of the cheap raunchiness that afflicts so many movies these days. A great storyline, wonderful recreation of the 1940s, honorable characters, fun humor, nice cast of talented actors. Overall, a truly enjoyable film that was both exciting and uplifting, with - finally! - some great moral lessons and some patriotism (that was refreshing in this day and age.) Thanks to Marvel and the actors for giving my family and I a great family film we could enjoy together. We might even go see it a third time.", "Im just watching this movie and Im so bored I chose to write this review to help raise awareness about how bad this movie is and boring and boring and BORING!!...........pf.........Its impossible to understand for me how they can spend 140.000.000.dollars and eventually waste it all and then give hope for us and cause disappointment not that I was expecting much after all that bad reviews and watching it on sky (its on every day now)little bits and pieces so I had glimpses before and had the feeling its gonna be boring and no surprises on that one ....IT IS SO BBBBBBBBBooOOOOOOORRrrrrRRinggggggggggg..............that I cant finish this movie..this review is boring???????watch the movie then you'll understand.........", "I liked the movie! My husband had seen it before and he told me it would be boring, but I thought it was full of action and very interesting. I also really liked the aspect of the underdog becoming the hero! However, taking into account that this is technically the first movie of the Avenger series, I think it could have pulled you in a little more to make you want to continue! But overall, I give it an 8/10!", "I am a fan of James Bond and have watched all the films. After completing the series, I ventured into the Avengers universe with this film.\n\nI found this film to be a decent one. It has good and engaging action scenes. The film never bored me. However, I found the use of such modern technologies in the 1940s environment to be a bit odd.", "Great story and timeline with action and some comedy. Really great to learn about Captain America's origin", "A beautiful, enthusiastic, and very emotional movie .. excited for the rest of the series", "Stop reading this review and go watch it!\n\nBrilliant", "Entertaining origins film that sets a strong standard for the films that follow. Great 1940's feel. Evans good in the lead role and strong supporting performances from Hayley Atwell as Agent Carter and from Stanley Tucci.", "I haven't read the comic books, but I do enjoy some big-screen versions of them. This was the best action-adventure comic hero adaptation that I've seen in a long time. Evil villain, nerd becomes hero, beautiful woman, and of course, Stark Enterprises. :) Of course, it is formulaic. They handled it beautifully with just the right touches to make it real enough and funny.\n\nNow, the shield as boomerang surprised me, not having read the comics, and I loved it eventually. Almost too exciting for my little self. It was great! Two other action/adventure movies I've seen lately are Thor (GAG GAG GAG) and Green Lantern (lots of fun). Captain American, however, shoots them both out of the water.", "I started watching this movie thinking it would be terrible, while I've never liked captain America as a hero, this movie changed that fact. This movie was way better than I expected and definitely fits the part", "I liked this movie an I recomend it. A very good movie of fantasy and adventure.", "Positives:\nDirecting\nRetro style\nMusical score\nChris Evans\nThe adventurous tone\n\n\nNegatives:\nRed Skull was underwhelming\nThe effects have not aged well", "This is one of the better movies of the year, considering what we got in 2011 was cars 2 and happy feet two, but we also got Kung Fu panda 2 (wow there were a lot of sequels made that year) every single thing about this movie outside of a few things was amazing, this is better than all three iron man films, while there is fun, there is also a ton of heart, this movie is great, go watch it now.", "The movie itself had good acting, a nicely crafted modernization of a ridiculous concept (even for when it was created) and good special effects. Unfortunately I have this rating system that forces me to grade movies that can only be enjoyed when drunk with something less than 4. Captain America is such a movie.\n\nDon't get me wrong, I have a lot of fun watching ridiculous movies while inebriated, so I am not judging here. I can't imagine, though, enjoying this movie in any other circumstance. I had higher hopes for the film as Hugo Weaver was in it, but alas, he got a small cardboard role than even he could not make interesting.\n\nBottom line: good for 3 year old American children who their parents want to brainwash into becoming soldiers for their country, but otherwise... a film to enjoy when drunk.", "Great movie. I thought it was going to be bad but it was really, really good. I will definitely buy this movie when it comes out. I think they chose the right actors for the characters in the movie. The action was good and realistic. Red skull is probably the most epic super villains ever, and is my favorite. I like how it started with cap in the ice and ended with a surprise. The enemy was opposing. I like how tony starks dad was in it. I often thought during the movie, though, if we had that tech then we would have won the war a lot quicker. But yes i will give it 9/10 stars and i would recommend it to anybody who likes superhero/war movies.", "I admire the look and feel of this movie almost as much as I marvel at its incomprehensible luck. The transformation of Steve Rogers from skinny Army reject to American champion is the best I've ever seen anywhere and could not have been made so successfully without these particular actors and today's technology. Someone up there clearly LOVES the people who made this film. If I were a filmmaker I'd despair at trying to play in this film's league, too much must have been sheer serendipity, or so I'd try to convince myself.\n\nThis film's art direction is nearly perfect. But that's in addition to its other superb components from acting to story to photography to music. As most of the paid critics have mentioned, Chris Evans is particularly both enjoyable and indispensable. Even more than being an instant classic in every sense, I'm not sure I could ever trust anyone who didn't like this film.", "As I've said in the past, I go to these comic book movies with little knowledge of the foundation of work put forth over many years. I had already seen the sequel to this one and wondered what some of the schtick was about. It answered my questions. My responses are quite basic. For one thing, I love seeing Nazis get theirs and this allows that, although the guy is more than a National Socialist. The character of Captain America is quite delightful and full of sap. I love that shield. He can hit a three rail shot and take a guy's head off from fifty yards. Overall, it was fun to see how he came to be. It was great entertainment as an entire battalion troops into camp after he has saved them from imprisonment. Of course, considering the enemy firepower, one must question the lack of casualties. I'm sure I'll see the third movie. Apparently, Marvel now produces about half the big budget movies released.", "I first saw this film in the cinema and hated it! Found it boring and dull. Few years later I reluctantly watched it again with a friend and I have no idea why I thought it was boring and dull - I totally take that back! I loved it! Chris Evans as the Cap was brilliant.", "I am a Die-hard Captain America fan. I had my doubts reading the premise of the film. They took quite a few liberties with the characters. There are some that I can see to tie in the upcoming Avengers movie. For those of you who do not know Nick Fury was Sergeant in World War II. As we can see Nick Fury as portrayed by Samuel L. Jackson and an Afro American while the Marvel Comics version of Sgt Nick Fury was a Caucasian. Also James \"Bucky \"Barnes was quite a few younger then Stephen Rogers, not the same age.\n\nSo I went into the movie a skeptic. I came out a convert. They did a very good job of staying as true to the Marvel version as they could. I also realized that this in the Ultimate's Version of the Captain America, not the Cap or Yore! If you like action this movie has it, granted some of it may seem a little corny cause part of the movie is sent in the 1940s or BCP(Before Cell phones).", "Awesome movie i ever seen ...what a story and love story plot", "Wow , what a film. I've seen this movie a couple of times back when I was younger but after watching it today at 3:55 am and counting I came to the conclusion once again that we are in the presence of a masterpiece. For people like me that are a Marvel fan and specially a captain America fan this movie is a diamond. Personally I loved all the script, the set, the story, the great love story between Cap and Peggy and how they made Steve's personality. The script , all the dialogues between characters helps you get personally involved in all types of relationships between them, specially friendship and love. How they made Captain America personality is just so good , a man that went through tough times but never changed a thing of what's inside of him and always looking for the opportunity to defend his country even when he got rejected many times. Recommend 100% and if you like Marvel more then.", "The summer sure got off on the right foot. Thor was fabulous. Then, X-Men First Class kept the momentum by pumping grand life in to the X-Men franchise. Now, after weathering that Green poopstorm in mid June, we get another exceptional hero film. Director Joe Johnson, the cast, the crew, the FX people and writers should all be proud of this exceptional movie and take a bow. The only remotely negative thing I have to say about this movie is that I want more and I want it now! It's a good thing I don't have to wait long to see them all again in Avengers!\n\nSo, saying Captain America is the best movie that I've seen this year says a lot. It's amazing to see it with a rockin' crowd in a packed cinema! I know many movies claim to have something for everyone but this one manages to pull it off while remaining interesting and compelling all the way through. There are spectacular action scenes as well as heartfelt, intense moments. There is humor and fun but it's a serious, well made film. Not to sound like a poster ad but I can't imagine anyone at any age not enjoying this movie. (PS- the train scene is as much fun as the train scene in Spider-Man 2!)", "I'm glad to see the response to Captain America First Avenger has been, for the most part, very positive. I've noticed that sometimes expectations are unreasonable or some fans are too attached to their comic book preconceived notions. Either Cap stayed very close to its root origins or people are judging it as a film first. Whatever the reason, it seems most enjoyed it as much as I did. Visually it is a sight to behold and that goes for the special effects but also for the time period tone and war grit of the film itself. Every scene was captivating, whether it was full on \"Raider of the Lost Ark\" action or the developmental down time. Isn't that what movies are suppose to be about?\n\nAnd here I thought Iron Man or X-Men raised the bar in terms of what we could expect from modern adaptations. While true, what's remarkable is that Captain America raises the bar on what we can expect from a blockbuster in general. It's certainly not just eye candy; it's an all around exceptional movie. Thor and First Class were on the top of their game earlier this year and yet maybe Cap has succeeded in topping them both. What a great year for action adventure films!", "Captain America: The First Avenger is, essentially, a 2-hour setup movie. It has some good performances and fun action, but it almost seems like they are rushing through this movie so they can get to The Avengers movie. Also, I like Cap, but it does seem odd to root for a superhero who is pretty much a poster boy for the advantages of steroid use.", "Captain America The first Avenger is one of my favorite film. I love its genres, it's an incredible action and adventure movie ! The music is perfect and the stunts unbelievable. This movie is fantastic, the cast is wonderful, Chris Evans is such a great actor and Joe Johnson a super director. The plot of the movie is really really good, the story is interesting, if you like action movie, you should like Captain America ! Because the battle scenes are wonderful, the visual effects, amazing ! The atmosphere of the film is one of the best of the Marvel movies and the superhero movie in general. This movie made me become a real fan of the marvel universe. In conclusion, this movie is just amazing ! It's a blockbuster, it has a a wonderful cast and a fantastic plot ! If you like action, adventure movie, please you must watch Captain America, and if you have ever seen this movie, you should go watch the Second Captain America : The Winter Soldier", "I have to say, it was rather entertaining to watch even if it was rather predictable. You could see that Chris Evans did do some extreme workouts to look like a badass superhero such as Captain America! Although not my favourite, the movie was quite good! 8/10", "I like Steve Rogers, the scrawny underdog who becomes a true hero. As a human story, it is quite compelling. The actual plot and villain are more \"comic book\" though, as the Red Skull and Tesseract are quite outlandish. Overall, decent and inspiring but nothing special.", "Is there more to say? The sheer joy that this movie provides makes you happy to love movies. You feel blessed. And you want to thank Joe Johnson, or some god of the arts, for bringing this film, these characters to life. You fall back into a state close to childhood, when every new picture you saw was the best there is. You spend two hours smiling. Just smiling...\n\n2011 was a great year for action/adventure and Captain America The First Avengers is right at the top of that impressive list. MARVEL is definitely on a roll\u0085 what with the record breaking success of Iron Man as well as Thor hitting big this year. Let's not forget how good X-Men First Class turned out and that Spider-Man is getting a facelift and will tear it up next year. Speaking of next year, let's not forget all this greatness has been leading up to THE AVENGERS!!!!\n\nThis movie was excellent and entertaining and deserves all the praise it has gotten. Superb in many ways.", "A WW2 superhero origin story that has a lot of heart. One superhero film I am most nostalgic about because of great action, style, and an engaging Captain America by Chris Evans. None the less the story is nothing special and the pacing is all over the place keeping it from being one of Marvel's several great origin stories.", "It's the early 1940s and the United States military has employed all of its resources to try and bring about the downfall of the Nazi regime. Steve Rogers is a feeble but courageous young man from Brooklyn who's only goal in life is to join the military. Having been continually passed up for enlistment, he volunteers to become the first test subject of a \"super soldier\" program that grants him enhanced strength and ability. Not only does this boost the morale of his country, it also makes him the only suitable candidate to combat the Hydra--a scientific Nazi faction led by the maniacal and astonishingly powerful Red Skull. The latest comic book adaptation to be set in the Marvel universe has special effects to please the eye, a vivid sense of time and place, and the expected action scenes, but without a compelling story, a sense of wonder or excitement, or an effective climactic showdown, it feels like just another run-of-the-mill origin tale. Evans acquits himself well as the hero, and Jones provides some fun as his ornery commanding officer, but both Weaving and Atwell are underused as the villain and love interest. As a whole, film just serves as a prelude to the much anticipated Avengers film. **½", "I have always been a marvel fan but like many have been living a lie as i have never watched every film within the modern marvel franchise. So i made it my quest over this year to watch all of them in order. Captain America is a solid start to this quest and does a good job of setting out the style and substance of these films. Steve Rogers is a very relatable, memorable character and this film really allows us as viewers to connect with him. The film slightly lets itself down with some poor CGI choices and slightly over the top plot but overall it is a very strong start to the modern marvel universe.", "This is among my favorite superhero origin stories along with Batman Begins, Iron Man, and Spider-Man. Red Skull is a threatening villain with his morals shown well. Steve is a compelling hero with his morals shown well. This is good as a romance movie, an action movie, and a buddy movie. It doesn't deserve to be the lowest rated Marvel movie on this site. Age of Ultron does", "Captain America: The First Avenger (2011)\n\nCaptain America is a fighting and action movie. The movie was a success when it released both income and criticism. I think it is a great movie of the year. When i watched this movie i think lead actor \"Chris Evans\" is very appropriate per captain america \"Steve Roger\". Visual effect and Photos editing is a good. The Soundtrack is a big grand when i hear i felt go to war!! I give 10/10 for the best movie. Thank you very much for read my review. This is my first review if there is some wrong, i will for improvement.", "I loved this movie as well as the rest in the Marvel Series.. Can't wait for more to come.\n\nMy only issue is the pants he was wearing when he went into the chamber still fit when he came out...\n\nGiven the \"expansion\" his body went through, his pants should have been ripped and ragged rather than still being a perfect fit.", "I usually really enjoy origin stories. This movie proves that once again. I do really enjoy Steve Rogers in this movie and his personality. I also really love the fact, that he had to fight to even help his friends and the soldiers. The parades and presentations were so far from his ideal life, and you could tell. Peggy and Steve are nice together, but not as good as they should be. Red Skull is a decent villain and he works just fine for this story, but I wouldn't count him in the best Marvel villains of all time or anything. Overall, I would say that this is a pretty decent movie and a great start to an even better trilogy.", "Story never goes off topic. Fully focused on Steve Roger's story with pretty good screen time to fellow characters.", "This film tells the story of a young man who is not physically fit enough to be in the Army. He is selected for a special program to transform him into a superhero that will save the United States of America.\n\n\"Captain America The First Avenger\" is quite unlike other superhero blockbusters. It starts off slow, detailing how he was bullied on the streets of Brooklyn and then in the Army training base. He is finally transformed into a superhero after one hour of screen time, which is pretty long and slow if you ask me. Then, the plot is rather unfocused, as it tells the fight between USA and Nazi Germany, and also the fight between Rogers and the bad red guy. I find the plot so unfocused that I lost interest in it altogether. It is not packed with action enough, not packed with enough thrills or excitement. Though I am a little disappointed, I think I will still watch the sequel to see if it gets any better.", "Enjoyed this movie all the way through that had a great cast and good story.", "The narrative of this movie is fairly simple - a classic superhero story line. It gets a bit fuzzy towards the middle but is overall engaging and I particularly enjoyed how the film ended.\n\nIt was a bold choice to CGI 'skinny Steve' but only slightly distracting and needed for the narrative. The special effects were impressive & there was also some excellent cinematography, but I wouldn't expect less from a marvel film!\n\nIt's nothing majorly impressive but entertaining nonetheless and I would recommend it if you're a fan of action or superhero movies.", "Captain America: The First Avenger is an incredible Marvel movie that's extremely fun, exciting and dramatic whilst being suitably old fashioned in all the best ways, even if it does annoyingly montage through some of its action.\n\nChris Evans gives an incredible lead performance as Captain America. Hayley Atwell, Sebastian Stan, Tommy Lee Jones, Stanley Tucci, Dominic Cooper and Toby Jones are all great and Hugo Weaving is a terrific villain.\n\nJoe Johnston's direction is fantastic, it's extremely well filmed and mostly extremely well paced. The CG is consistently really impressive and the music by Alan Silvestri is amazing.", "I just didn't like a thing about this.It looks like a WWII war movie,only you have some marvel hero fighting Nazis?I don't know,it just looks terrible. Captain America is an American soldier who shoots the bad guys with regular guns ,like any soldier,only he wears a ridiculous costume and the only thing that reminds us he is a comic strip superhero is that he has this super shield that is bulletproof. Try thinking of 1962 series Combat with some guy dressed in tights and carrying a shield ,it just looks ridiculous.The only time you actually wake up and the movie generates some potential is in the last scene when the movie ends!!", "I didn't know anything about Captain America but I thought I would give it a try and I'm glad I did. It's an enjoyable romp and Chris Evans plays him perfectly. I loved the beginning showing how he was transformed from a scrawny kid into a superhero with a physique to match without spending the next 10 years in the gym. Well produced and directed and definitely worth watching.", "The first Marvel comic book I bought on a newsstand was The Invaders #16 (cover dated May 1977, bought in February), and Captain America was my first favorite superhero. So I've been anticipating this film somewhat nervously for a long time. It not only didn't disappoint; it blew me away! Best Marvel movie yet. It has a simple, focused story line that stayed true to the original character; awesome visuals throughout; and perfect casting. Deviations from the original storyline are, as always, forgiven by me. Fact is they captured the essence of Captain America just as it first sparked my ten year-old imagination in 1977. Excellent! Excellent! Excellent!", "Besides I really like Captain America, I actually think this is one of the better MCU movies. It has a slow middle, which I very liked to bond with the characters. The story itself was quit simple, but the smooth line delivery from the actors made it very charming and intense when it had to be intense. The movie also had one of the better villains in the MCU, but the real goal was lacking a bit. The movie is really standing out because of the music and sound. I rewatch it and I was impressed.", "One sin defines it - to be only a package for special effects and the image of a pop culture character. all the ingredients - from love story to noble intentions - are not convincing. the story is cheap, the message to obvious, the picture of the Captain - not more than American propaganda, useful, maybe, under the Cold War but not today. it is difficult to criticize it because , at the first sigh, it seems be wrong because this is its purpoise. so, a film for little kids. or, for great fans of comic - books.", "Laser guns in 1940s!!!! CCTV in 1940s!!!! Magical Godly cubes with unlimited energy!!!! A rather silly, not-scary-or-fearful villain!!!! Pathetic villain!!! Cliché after cliché after cliché! Stupid romance! Some a female British officer can storm in a lab which is conducting a super secret US government experiment and she can shout 'STOP IT'!!! I don't even want to talk anymore about this film it was freaking BAD!!!!!\n\nThe story line is so boring, there are no character developments. When CA decides to go jump behind enemy lines, out of nowhere there is plane available to do that! They never showed CA getting much of training but he can jump from a plane and in the end, he can fly the Red Skull's plane! Just pathetic!!!", "I'm re- watching every film in the MCU, and this was a solid start, i've always preferred chronological order over release order, so this film is the first to watch for me. The acting is good, as is the plot and the ending. The cast is fantastic and the overall film was just great.", "One of the cool solo hero movies with a good actor like Chris evans, it's a good movie in the MCU", "A classic origin story that's sets a great standard for the marvel films in the future. It may not be the greatest mcu entry in terms of scale but it's always re-watchable. The film has a great balance of laughs, emotion and actions but also features some solid performances from both Chris Evans and the supporting cast which lead to an awesome Agent Carter series.", "A good \"feel-good\" superhero movie with a retro style which knows not to take itself too seriously, and when to pile on the strong comic book action. The montages and silliness of certain scenes only slightly hamper the good story and acting, allowing the adventure, explosions, and one-liners to keep you entertained and cheery to the end.", "Marvel has finally managed to once again reach the pedigree they established with the first Iron Man, and bring us another great action adventure film. Whereas Iron Man was a modern, glib and slick take on the genre (matching the character), Cap is a far more traditional flick.\n\n1940s Setting: Check Nazis (kind of): Check Ernest hero with an awesome group of people having his back: Check Dame: Check Badass Villain: Check\n\nThese elements are all you need for the perfect summer blockbuster. And for the most part, The First Avenger delivers. Aside from a lackluster midsection and some rushed delivery on the plot, this is definitely the Superhero movie we have been waiting all summer for!", "As for being the beginning of the franchise it's good, not great but good, I didn't dislike it and over all has a good message which I always love. I was honestly so susrprise to see Chris Evans as Steve Rogers considering the last thing I saw him doing was Tell Me Your Number, overall really good casting and storyline, it's a good beginning.", "It wasn't the best movie ngl, but the story was fun. To be honest I'm only giving it a 10/10 because it's my favorite.", "Although the atmosphere seems to be good during the first scenes, the movie sadly turns into a lousy propaganda b-class movie after about 20 minutes. The general good-evil plot is way overdone and the corny American patriotism should disgust every thinking being. I watched this movie on a 8 hour flight with plenty of time but I could not finish it. After 50 minutes I jumped through the remaining scenes and found that the movie does not get any better. A very very clumsy work that is a waste of time at best. Stay away from this if you can.\n\nIt is sad that this kind of brainless works are becoming the main output of the film industry.", "While it's not a strong entry to the MCU and everything seems to be happening so fast near the third act, \"Captain America: The First Avenger\" still manages to tell a decent origin story", "Hmm It's not that bad, I thought it much better but in general it's good.", "This movie isn't brought up much when people talk about the MCU. It does a great job for a historical fiction war movie and it stays very faithful to its source material. The score is a major improvement from all the other MCU movies that were out at the time of TFA's release. The performances are great and we get plenty of character development. Steve and Peggy have great chemistry, and Red Skull is a very good villain. The First Avenger deals with themes of sacrifice and sends a positive message that size doesn't define who you are, but rather your attributes.", "I'm glad they told the origin story, and most of it was very good. A good villain and such, but the sci-fi elements took me out of it a bit, because they were unexpected. Chris Evans is perfect, and Agent Carter is also good-I'm glad she got at least a small series on her own. The first time in many years that I've watched it, because it's one of my least favourite of the Marvel movies, but still very good quality.", "Through most of this excruciatingly dull picture, I felt like I had seen this movie before. It brings to mind such duds as The League of Extraordinary Gentlemen, and Sky Captain and the World of Tomorrow. It started off well but quickly became tedious. The same old stuff I've seen in a dozen superhero movies.\n\nOf the three Marvel adaptations released this year, I liked this one the least. Thor was fun; X-Men First Class was a bit overlong but not bad; but this one was tough to sit through. I played a couple of games of Words with Friends while I was watching, and was really glad I didn't get stuck in a theater with this one.\n\nNice try, I guess, but the story doesn't engage your emotions on any level and is strictly by the numbers. If you haven't seen this yet ... you probably already have.", "I guess if you like your Captain America in a hair piece and on roids then you'll enjoy this. As for me, no thanks. Very boring and probably strictly for the fan boys.", "After seeing the previews I was optimistic about this new film, and through the first 40 minutes was satisfied that it would be a good movie. From there the movie goes strait down hill. I was looking forward to a good Nazi ass kicking but all the fight scenes were corny and dull. The Darth Vader looking Nazis stumbled around and fired their laser guns a few times and ended up fighting him bare handed one at a time. The acting left much to be desired and most of Captain America's dialog consisted of dumb quotes. The main villain looked like something from a GI Joe movie and after the first hour I couldn't wait for the movie to be over. Save your $8.50 for a better movie and if you must see it wait a few months until it's in the $5 bin at the store.", "I never understood how this MCU film is so underrated. I remember seeing on big screen this movie and wowing all the way... I love retro wwii theme, 40's brooklin/new york, nazis, experiments, crazy lab scientists, submarines, the way they use the captain america icon to boost the morale of the troop.... but the troop prefers women instead of a clown in (perfect stupid) 40's disguise, the comic-book marketing, the howling commandos... so cool!! like watching a retro 80's indiana jones, james bond (with huge set of villain's lair) in their best fantasy, adventure moments (not as serious as today)... an 8 for me!!!", "Meh. This movie is only marginally OK. The whole Nazi crap has really grown long in the tooth.\n\nI know this is now Marvel characters were developed but jeeze do we NEED to see an orign movie? We get it.\n\nAnd after the most recent Avenger flick Captain America is black? Oy Vey.\n\nWhy not make her Miss America?", "I can't say I've ever really got into this whole MCU thing, but this as a stand alone film was enjoyable enough.", "\"Captain America\", the first of the Marvel films, did not fill me with enthusiasm, I actually found the film rather dull. Sorry, but this was not a great piece of movie history. Giving it a 6 is being very generous.", "Okay, it's just a fantasy superhero film, and while you can just put your mind on numb and enjoy it, I hated the whole premise. So while other soldiers in the film give their lives to servicing their country, and men of science create wonders never before seen, who gets all the adoration and hero status, why the it's the good looking guy who's pumped up with steroids of course. Can't get more American and Hollywood than that. While we do shower our Sports athletes and actors with untold riches, the rest of us struggle along everyday just to make ends meet and I need to pay for a movie to remind me of that ? haha\n\nThe acting was at best just average, the storyline was your typical good vs evil, nothing we haven't seen before. Some nice action scenes and of course the inevitable setup for the sequel.", "Another pretty good installment in the MCU. Captain America is probably one of the greatest characters in these films, and to see his beginnings was great. I think that the first half of the film is great with the way they paced the film, and how they did some of the action. This movie falters in the second half though. They go through multiple years through pretty much a 1-2 minute montage, which leads to an underwhelming third act. Overall, pretty good through the first half, but the second half is where it falls flat.", "This movie does a good job of introducing Captain America, Bucky and Agent Parker and because of that the movie feels like a pilot for a series. It takes time to get going and the Red Skull is a weak bad guy. I know he is from Nazi Germsny but feels dated. There are plus points for this movie and is a solid 6/10 but I've learnt to expect more from the MCU.", "Captain America is one of the worst film ever!!! Chris Evans is wooden as CA and only got the part because of his muscles. his outfit looks like its made out of cotton.\n\nHugo Weaving makes a lame red skull who looked like cross between Michael Jackson and the mask his German accent is insulting, offensive and bogus German accent The action sequences are nothing special and boring, they'll make you feel sleepy.\n\nthe only good thing in it is Tommy Lee Jones and his wise cracking one liners.\n\nI can see why this will be a massive hit in America because it makes Americans believe they are the greatest nation on the planet, when they're not.", "Rating\n\n7/10\n\nThis is a solid but unmemorable superhero movie. Sincere, patriotic and old fashioned, it begins well but loses a bit of steam in the second half. Visual effects are ok. Tommy Lee Jones is wasted\n\nWatchable", "From the acting to the story everything was great. There was a lot of action and when there wasn't they kept us entertained with an interesting story line that blew me away. The only issue was when they cut to a different seen it seemed as if they had cut hours later I just wish there was more story in between cuts. But overall a great film.", "Actually I wanted to rate 6.5 but that isnt possible.\n\nCaptain America is a fun movie. I don't have that much to say about this.", "Film started out with the story of how this physically inferior guy blessed with great determination and strength of character ended up in the army after repeated past rejections that part at least contained moments of comedy and human interest worth watching but then it took a turn for the worse. How he became Captain America was a bit ordinary his almost sideshow lifestyle was boring and silly and painfully drawn out to the point of total boredom. Eventually he went off on a little escapade that did provide some momentary relief from the stupidity of the story line and boredom of watching that didn't last long before the filmed turned into something that could sold as a sleeping remedy.\n\nI would not recommend this film to anyone it is a total of time and money and the worst film I have seen in decades.", "Okay I personally love this film. The fifth installment in Marvel's Cinematic Universe introduces us to The Centinal Of Liberty himself Captain America, and in a very good way at that. The visual effects aren't anything truly impressive (except for putting Chris Evans head on someone else's body) but they are so stylized, they look very beautiful and very 40's esque. Joe Johnston (Director of Jumanji and The Rocketeer) really knew what he was doing, he gave us the classic good versus evil story that didn't really feel fresh, but it felt needed and really good to watch. Chris Evans's performance is great! He plays the man many people strive to be, and does so in a great way. He gave us the true American hero. Weaving's Red Skull is very menacing and with great makeup to match, and Hayley Atwell's strong willed Agent Peggy Carter was magnificent. A great film, with true American Spirit.", "\"Captain America :- The first avenger is a Good movie.\" The movie has a unique concept and continues Marvel Legacy the film has got a good concept story and all.\n\nThe acting directing was good Chris Evans was good in Fantastic Four but more good as the Captain America the film has shown sci-fi concepts military and all.\n\nSome concepts were unbelievable and somewhat illogical so this is not great but good movie but film was entertaining.\n\nIt was a fun movie and Comedy was also good for example the shows conducting for Captain America for people and all there is also one interesting thing \"Howard Stark\" father of iron man it was overall entertaining nteresting movie.", "This film ranks right up there with the original release of Star Wars when I was a teenager decades ago and LOTR, which I saw on a big screen cinema. Captain America met my laptop (hardly a proper theatre), but it was awesome to watch from beginning to end. If you love action films with drama, supernatural mythology, and some nostalgia thrown into the mix, you will absolutely love this film! The characters are well-developed, the action sequences flow together very well, the plot is thick and exciting, the photography and special effects very good without being ridiculous, and the \"real feel\" of all the wartime memorabilia make this a work of art as well as a keep-on-the-edge-of-your-seat adventure. While it might be a tad scary for little kids, it is suitable for teenagers and great for adults. I haven't had this much fun watching a movie in years! 10 out of 10!!!", "Better than your average super-hero movie, not that this says much. Great special effects, and plot is OK. Still resorts to the usual predictable fight scenes though, and one-dimensional characters.\n\nIncredibly bad ending though, clearly just there to set up the Avengers movie, and a sequel. Probably the most left-field, out of the blue, discontinuous ending I've ever seen. Turned a 7/10 movie into a 5/10 movie.\n\nDecent enough performances. Not really an actors' movie though, as it is action-, rather than character-, based.", "Was going okay, then came the ending...\n\nBetter than your average super-hero movie, not that this says much. Great special effects, and plot is OK. Still resorts to the usual predictable fight scenes though, and one-dimensional characters.\n\nIncredibly bad ending though, clearly just there to set up the Avengers movie, and a sequel. Probably the most left-field, out of the blue, discontinuous ending I've ever seen. Turned a 7/10 movie into a 5/10 movie.\n\nDecent enough performances. Not really an actors' movie though, as it is action-, rather than character-, based.", "I've seen the entire spider man trilogy, X men trilogy(including first class),Incredible Hulk (Which was great), Thor(One of my top favorites)and both Iron man movies.Out of all these movies. Captain America is my most favorite (with Hulk and Thor coming in a close second). This movie has been given positive reviews and has grossed a lot. What i don't understand is why a lot people on IMDb have given it bad reviews. What i mean to say is, from start to finish, this movie was truly epic. Awesome storyline and action. It is the revival of Stan Li's first avenger and the first marvel hero ever made. It is Captain freaking America and i got to say that this is what i have been waiting for. When i entered the Theater, i expected to see an awesome movie, however, Me and my buddy saw the best marvel movie in ages. A true success. Seeing this...i now want to watch the AVENGERS. I recommend this movie to any superhero/marvel fan.", "I love this movie. I love the scene where the protagonist gets her powers. Makes it nice and easy to watch. I'll give you 8 out of 10 because there's not enough time. I'll tell my friends to watch.", "in my opinion this entry in the marvel Cinematic universe is one of the least enjoyable.i didn't think it was very exciting.in fact I found it downright lacklustre.the villain really didn't do anything for me.i also didn't like Captain America's uniform,to me it just looked lame.the acting was good though.Sam Jacksn reprises his role of Nick Fury.Tommy Lee Jones also appears ,and is very good.Chris Evan is of course great as Captian America/Steve Rogers.but the movie itself seem lower energy than a marvel movie should.that's not to say this was an awful film.from it.but it just didn't live up to it's potential.of course this is only my opinion.for me,Captain America: The First Avenger is a 6/10", "This is what I want from my comic book movie adaptations. Captain America is fun, amusing, lively and well paced, with solid character development and a lot of nice action. This movie completely captures the comic book vibe, and has a 1940s movie-serial quality reminiscent of Raiders of the Lost Ark. (My appreciation of it was increased by having watched the rather soggy Thor the previous day.)\n\nThe funny thing is, I never liked Captain America when I was a kid. He was so stodgy and bland and square-chinned and All-American. I normally prefer angsty X-Men-style superheroes, so I wasn't really that hopeful that I would enjoy this. But I enjoyed it tremendously.", "Unbelievable movie.. just fantastic over all!!\n\nI absolutely love it and how long it is and marvel really know how to make movies!", "The movie has excellent visuals and a good premise, and Captain America is likable enough as a character, but it rips your suspension of disbelief to shreds, then burns them and scatters the ashes. The bad guys in the movie are an outfit called Hydra, which is Hitler's research division in this version of history, except they don't really work for Hitler, but for their own leader, Red Skull. Why Hitler lets them get away with this, considering the seemingly endless amount of resources they consume, and the fact that they straight up murder the guys sent to inspect them, is a retarded mystery. It might have been explained by the fact that they possess technology decades ahead of its time, including guns that can vaporize a man with a single shot, except that all they seem to do in combat is fall over and die, which is the cinematic equivalent of feeding someone feces. Who wrote this, a five-year-old?", "Captain America: The First Avenger is a brilliant movie with a very well developed storyline that i'm sure stays true to the character.I really enjoyed the movie but its certainly not my favourite Marvel movie,I like Captain America's character but nowhere near as much as IA like Iron Man,Spider-Man,Hulk and Thor,I just don't find his character as interesting or as likable as them.Also there isn't as much comedy as there is in most Marvel movies,especially Spider-Man and Iron Man.Other than that though,Captain America is very enjoyable,action packed and a very strong cast and I would recommend it to all Marvel fans.\n\nSteve Rogers (Chris Evans),a small weak man is transformed into Captain America to fight for his country during the second World War.", "Greetings from Lithuania.\n\n\"Captain America: The First Avenger (2011)\" was a really good origins movie. Its fun, entertaining, well written, solidly acted and directed. This movie was involving from start till finish. Later it kinda spent into a series of its own, and while this one isn't the best in the series, its a very enjoyable movie on its own.\n\nOverall, \"The First Avenger\" is a solid entertainment. Its not the best in the series, but i liked it for what it was - a fun and good entertainment.", "I saw this in theaters and remember being disappointed after all the hype surrounding the release. However after watching Endgame and all the marvel movies in chronological order it made more sense the second time around and as a result I can now rate this title accordingly. It could've used a tad more action scenes but overall it was well acted good cgi and a great intro into the marvel universe we have all come to love. Looking forward to the next Captain America.", "A high-budget action movie that seeks to blur the lack of essential qualities by a visual spectacle. Somewhat entertaining, but in the long run totally unimpressive. Although this was my third viewing, I had the impression that I was watching the movie for the first time. There was nothing left in my memory from the previous two watching.\n\n6/10", "2 August 2012. It's rare to find a superhero movie that literally and effusively represents the American spirit, harking back to the 40s, the classical war time stereotypes and perhaps in the Civil War spirit of sacrifice. The ending of this movie is particularly, if not somewhat predictable both American in its relief and yet haunting in its loss. A movie for the downtrodden and the overcoming of evil by innocence of goodness. It's hard to say whether or not this movie is an outdated, old-fashioned, naive young adult fairy-tale of comic book fantasy or a renewed sense of retro-inspiration and a refreshing rebirth of the American spirit has seemingly has been lost in today's selfish, egoistic society. Overall, this is an American action-superhero thriller that encompasses all the elements of both traditional movie classics and contemporary special effects.", "This is a great movie. It has a great story lines It also has great acting. It is very fast past. The Avengers it better. But still this is a great movie. See it. It is one of the best movies ever.", "Captain America was one of the most disappointing films I've ever seen, I love marvel and I was certain they were going to do great on this film (Despite The Fact That I Didn't Like Captain America Very Much Anyways) Marvel has never disappointed fans...I was wrong. The movie's scenery was dull and depressing, Captain America going in the war just did not go right, believe it or not but even the action scenes were bland,the only part I liked about the film was the end. Besides that it sucked! Even if your a Captain America fan, DON'T WATCH. Just thank god that there's a Winter Soldier film, If there wasn't I probably would hate Captain America all my life. My advice, don't watch this one, start with The Winter Soldier first. YOU'LL BE GLAD YOU DID!", "I just watched Captain America: The First Avenger. I really enjoyed the movie. I appreciated the 1940s period settings and costumes, which were a break with the usual generic cityscapes. I got a sense of a broad story, rather than the impression of a series of sensational set pieces. Here is a real movie, not just a noisy assembly of special effects. Of course it's loaded with CGI. It goes without saying. But it has layers and takes the care to be a real film. You know, like with a hero we care about and who has some depth and dimension. And with weight to the story.\n\nChris Evans is perfectly cast, as is Tommy Lee Jones as the grumpy Col. Phillips, Haley Atwell is great (and those red lips) as is Hugo Weaving.\n\nCaptain America wasn't the huge hit I was expecting!! Ending the year, as the 12th highest grossing movie with a $176 million dollar gross.", "I watched it again today. I don ' t know how many times I saw it. The captain is really the initial heart of my Marvel movie. I still remember watching it for the first time. I thought the actor was so handsome and charming. I still see it now. This feeling", "Captain America is a typical blockbuster movie and an average one at that. Some of the action sequences left me shaking my head in disbelief due to their incomprehensible nature. It is alright for a film to be a little unrealistic but it is not acceptable to break the laws of physics. The film was too slow paced and corny for my tastes, but as soon as Captain America became the hero the quality jumped, but sadly it was a bit late in the day. Stanley Tucci's character was my favourite performance in the film. The final scenes are beautifully shot and emotional which was the highlight. Captain America failed at being a decent standalone film but succeeded at being a set up to The Avengers. It's only purpose it seems is to make the audience aware of who Captain America is.", "CAPTAIN America, with its WW2 setting and set-piece chases, reminded me of Indiana Jones and the Last Crusade - and also of Dick Barton on the radio (\"the wireless\", as we called it back in the 1940s!).\n\nThe transformation of Chris Evans (why is that name unfortunate to an English ear?) from scrawny nerd to super-hunk was a jolly piece of pseudo-science, but as Captain America Evans seemed a bit bland (super-heroes all too often are). I liked Hugo Weaving's Nazi mega-villain who looked like Dr No and had an accent somewhere between Doctor Strangelove and Doctor Kissinger.\n\nThe plot seemed stretched rather thin in places and despite 3D and some cutting-edge CGI, the whole thing is a slightly old-fashioned slice of hokum likely to appeal more to the older generation - do they do superhero movies?", "I had a great time with this, it narrowly surpasses 'Iron Man' for me.\n\n'Captain America: The First Avenger' is thoroughly entertaining. I absolutely enjoyed the story and how it is told, while the 1940s style is done fantastically - love the settings and costumes. The only negative I have is about the body double effect of skinny Captain America - which looks, honestly, ridiculous... in an amusing way, at least.\n\nThis is, possibly, the most I've enjoyed the overall cast for an MCU film so far. Chris Evans is fun to watch in the lead role, he does a grand job. Behind him, the likes of Tommy Lee Jones, Hayley Atwell and Hugo Weaving are enjoyable too.\n\nA very pleasant experience, this. Good fun.", "Captain America is not one of the characters that are easy to translate to the big screen. It shows on this movie as well.\n\nThe movie takes it's basic story from the Captain America from the '60s. The Cosmic Cube, plane that's akin to the Sleeper, and they did do a pretty good job of combining them into a single story.\n\nOut of all the Marvel heroes to come onto the screen, I would rate this around 6/10. The WW II settings prevents this movie from really spectacular action movie. It might have been better if the story took place in a more modern settings, but then you can't tell the origin story of Captain America.\n\nI will be looking forward to the Avengers which should make things lot more interesting.", "Oh my god it's this film, it's made out of sh** !\n\nThat was my first thought. Also it was boring. And i am not talking boring in the sense that the boring scenes where filled in with re-filling the coffee mug, or going to the kitchen to pick up a snack, no.. I fast forwarded... And i never ever fast forward movies..\n\nJust before watching this movie, i watched Green Lantern, and Thor. Thor is great, Green Lantern is just fine as well, but this really sucks. You get the worse acting ever, the plot (if there even is any plot) revolves around the bad-guy a former SS Nazi Officer that has been trying to inject himself with some bozo-snot and gets a red skull and some superpowers. It is just so bad and cheasy that i really don't know what to say..\n\nI am actually speechless...", "I really enjoyed this movie, it was the first superhero movie I was able to ever sit through and keep me engaged in the story. I saw it in theaters 9 years ago and finally rewatched it and it's just as good as I remember. Chris Evans does a great job l, and I loved how the movie portrayed Steve Roger's backstory and becoming Captain America.", "I wasn't a fan of this one when it first came out. It was ok, real middle of the road stuff. Watching it again though and it's bumped up a little. There are a lot of great moments in this, moments that I still don't believe all coalesce into a great overall movie but there's some fun to be had. There are a number of montage that I don't love but it still all balances out to something above average.", "A really good enjoyable superhero action flick if it had not been for Xmen First Class this would have been the best superhero film of 2011. The plot follows Steve Rogers and there are some great scenes of a puny Steve Rogers and his story is amazing and is not rushed one bit. It is one of Marvels best and a great comic book it is. The action scenes are amazing Red Skull is a great villain but i feel they don't have the right actor in this movie but it is a much needed improvement on the 90's red skull. There are some great links to the avengers and other hero's we have seen and one hero's father. A great superhero outing for Marvel and it has to be another Marvel success. Captain America Is one of the superhero movies of 2011 that you just simple must see the effect of WW2 is good as well. Stick around after the credits have rolled because what you will see will take your breath away it is amazing and i will say i am counting the days sown till the Avengers as i think it is going to be brilliant.", "Captain America's a superhero due to a super serum, but he looks cool, has cool moves, and flings his shield with bombast, thus making America great again, and safe again.", "Beyond all the Rah-Rah America (kinda goes with the name), this is a great movie, even on this revisit. Good performances (great cameos from some of the UKs best up and comers). Great story. Great relationships. Great action scenes. Great CGI. Do you catch where I'm going? I give this film an 8 (great) out of 10. {Superhero Action Aventure}", "Most modern films don't interest me in the slightest. To me, they are too limited in their story lines and with people who can't act their way out of a rubber johnnie. The main reason I considered watching this new version of the \"Marvel Comic\" superhero Captain America,\" is because it is an adaptation of one of the most popular characters in comic book history. In addition, that diverse character actor Tommy Lee Jones is in this film. I was slightly surprised to discover that this \"Captain America\" film was put together with some glimmer of professionalism and imagination. The leading man isn't required to do much except look tough and handsome (not much else comes to mind). I quite like the 1940s look. That was a smart move by the writers because Captain America was created when the United States entered the Second World War, so this film is fairly faithful to the source material. There is a lot of incident here and a few thrills - courtesy of the dreaded CGI! Being a success at the box office, the film that followed this one isn't so good.", "Taking place in the 1940s and ending in modern day nyc , this film is pretty good for it's age.", "When I was a teenager there were three super heroes of the American comic strips that where unknown in Portugal: Captain Marvel, Superman and of course Captain America. But I had the privilege of reading their stories on Brazilian juvenile magazines I used to borrow from a friend who came from Brazil and brought lots of them. Therefore to watch this movie has brought old memories to me though this version is quite different from the old ones. But sticking to the movie, this is an action movie that adds something more to the story than average action movies usually do: it has an ideology and a healthy one: antinazism. Notwithstanding that the villain here (Johann Schmidt / Red Skull) is some kind of a Nazi dissident who wants to exploit his superpowers to his own profit. The rest is the usual amount of classic brilliant computer made special visual effects, the thrilling action and the no less usual suspense clichés. The ending is a open one and a bit confusing or not fully explained. Any way if you go to see this movie you will spend a couple of hours amused and entertained.", "It was kinda good but it just felt so boring and it really didn't need to make it this long", "An American superhero adventure; A story about a puny but brave boy rejected for army service, who is transformed into being the ultimate soldier with special powers. This is a sturdy, enjoyable action movie of cheesey charm. The pacing towards the end of the second act slows, and the tension drains, but up to then it is solid matinée fun Pleasingly, it avoids over-the-top seizure level CGI which creeps into the later Avenger series of films.", "Marvel's third blockbuster this year – after Thor and X-Men: First Class – is an underwhelming addition to the superhero canon. There's nothing overtly bad about it, it's just that none of the elements seem to gel. Chris Evans makes for a decent hero, however his Cap doesn't have the same charisma as, say, Thor or Tony Stark. The action scenes are sufficient, no more no less; the film is lacking any truly outstanding set pieces, although the fight sequences are well choreographed (with good use of slow-mo). The major drawback is the weakness of the sci-fi plot against a WWII backdrop. Its shortcomings are felt mostly with Hugo Weaving's villain, Red Skull, and his futuristic resources; the whole concept failing to feel right. Footnote for Marvel fans: stay until after the end credits.", "I enjoyed the film especially with it being set during WW2 makes a good change. Also liked the general story and character of captain America.\n\nDisliked the evil guy is basically a clone of captain America and disliked some plot holes.", "My first MARVEL movie, also the best one in my heart.I will always love captain and Natasha.", "I absolutely despise the musical montage. It should \"work\". But after watching a serious, well paced and with a lot of heart movie, it just stops on its feet and drags for about 25 minutes on \"Rogers is/was used as propaganda\" (without any nuanced commentary, just finger pointing) and his sadness about it, plus a few romantic scenes (all mediocre at best).\n\nAfter that, it gets going again and its fine, not awesome, with a lot of action sequences. All good enough but again, not that great.\n\nThe \"used as propaganda\" subplot should've been more heartbreaking or deep. Or maybe used on scenes showing Rogers growing up, and/or his relationships with Bucky and Peggy Carter, both underdeveloped.", "My favorite of all the Marvel movies (so far), Captain America is a simple story that relies more heavily on character and relationships than it does special effects and villains. True, it has both of those things, but in the end it is a relationship movie about a loser with a big heart becoming a winner with a big heart.\n\nThe difference? His heart!\n\nChris Evans is terrific as \"Cap\" as are old veterans Tommy Lee Jones, Stanley Tucci, Toby Jones and Hugo Weaving. Add into that \"newcomers\" like Hayley Atwell, Sebastian Stan and Dominic Cooper coupled with a simple plot (by that I mean it is a plot that is not overly complicated) and you have a very entertaining movie.\n\n9 (out of 10) stars and you can take that to the Bank (of Marquis)", "Didn't think I wanted to see Captain American but I had a taste for popcorn so I went. This is just that an okay popcorn flick. The beginning is done very well and sticks close to the comic. They do well with Steve Rogers story, making it very personal. Tommy Lee Jones steals the show as usual. Hugo Weaving is also good as the Red Skull. The female lead for once doesn't get in the way like the annoying Pepper Potts or all of the Batman female love interests. Howard Stark is also an interesting character, almost like Tony (maybe too much). That's the good, now the bad. The action is sometimes well over the top and the fight scenes often go way too long. The ending is done well with an appearance by you know who.", "Do not waste your time with this movie. I walked out of the cinema with about 25 minutes left. The whole entire movie is predictable. Please, don't waste your time or money, if you know good films, like me, and you have half a brain, then don't waste your time.\n\nLook there is not much I can really say about this movie because I have tried to forget it. Three words come to my mind, predictable, predictable and predictable. Storyline, script, everything. Just one word, Predictable!\n\nYou will regret disregarding this message if for some silly reason you decide to go and see this movie.", "OK, so I watched this film because there was nothing else on, and in fairness its overall execution was not bad. It's the standard all American hero/superhero bs we've seen so many times before. A standard 'we are yanks and we love ourselves' kind of thing. There is nothing about this film that makes it stand out, but plenty of truly cringeworthy moments that will make you duck for the vomit bag. Acting: OK. A little boring, and you have to wonder if this Chris Evans guy was ever given a challenging part to play.... CGI: as usual. Plot: None to idiotic I lost interest about half way through in all honesty. Seen it done so many times before going right back to The Shadow. I would rather pick my toenails clean as at the very least I might find something of interest. The thing that worried me most of all about this flick was the idea that many younger kids might actually believe that the second world war actually had particle weapon technology and was won by a fictional superhero, or am I just getting old? :) In conclusion: OK if you had two hours to do absolutely nothing at all.", "Definitely an amazing and fun film to watch, Captain America is something you should not miss. I have already read about how Chris Evans's muscles disappeared and thought I would try to spot some glitches on the effects. It was fantastic and very realistic! Nice one! I was thinking back then that Chris Evans had tried the Edward Norton diet which Norton underwent for American History X but I forgot that the effects used in Captain America was probably not yet available.\n\nActing wise, everyone did great. They were funny and tear-jerky moments but overall, it's edge-of-your-seat. I recommend this to everyone who is looking for an entertaining film to watch. Now I know why it beat Harry Potter.", "A disappointment, but not a total disaster. Liked Hugo Weaving as the villain, but he had not much to do.", "It's \"Die Hard\" for the comic book crowd. Captain America has a shield the size of a large pizza but kicks some major buttocks. I love the fisticuffs back and forth. The story is well told and gives you a good idea of how a boy named Steve becomes the hero. The characters in this film have a lot of depth and the realism with which they are portrayed by the actors is surprising at times. As is often the came with comic book movies, from an artistic standpoint, there were some plot elements and character developments I didn't think were totally needed. They do however drive the story, which seemed to be their purpose, so I can accept them.", "Captain America plays like a tribute to the great pulp novels. The film knows the novelty and I enjoyed the film. When you look back at the phase one films, this is quite unique and delivers on the campy beats of the era. Hollywood has been attempting pulp heroes, but this is one of the best because it embraces the character. The ending in particular is moving because the storyline and characters delivered. It won't be to everyone's taste, but if you enjoyed the comics and novels of the era, you'll enjoy what Marvel delivered. Underappreciated film.", "#MCUrewatcb. After an uber cool Tony Stark and a funny Thor, it was always going to be a difficult task for Captain America to be introduced to the audience as the final member of the Avengers. But it is a good thing they have started with the other two first. Because in this film Captain America is a bit of uninteresting goodie goodie. There is no real character arc here. His body changes rather dramatically but his character stays pretty much the same. Which is in terms of story less interesting. Weaving does a solid job as Red Skull, though it is more his mask and makeup that impressed then his limited screentime. The whole WW2 setting is a nice hommage to Indiana Jones and at times gives the film the same kind of feeling. Just not as exciting or with an interesting protagonist as in Raiders of the Lost Ark.", "Had a sudden urge to Watch Captain America tonight, don't know why. Steve Rogers pre serum is basically me at the gym. It's amazing to see how far the MCU has come in the decade since this came out. Was a simpler time, the effects have not aged well considering how good the new movies look now.", "If you compare this Captain America film to any of the origin films in its genre, it ranks right at the top. It's remarkable how well they cast and wrote this film. It's complex yet perfectly paced. It would compare very favorably to Iron Man, Spider-Man and Thor. In fact, I'd say it incorporates the best of those three classic origins but adds its own flare. That places Cap FAR ahead of films like Batman Begins, Superman or Elektra. All those flawed films couldn't get out of their own way. Batman Begins was flawed at every turn. Superman was great for its day but the cheese spoiled over time. Elektra was as big of a mess as Batman Begins in terms of plot and silly action. I'm so glad Cap avoided the pitfalls that hurt those films.\n\nEverything Cap delivers results in making every character believable and relate-able. What results is a thrill ride that delivers at every point of the running time. It also delivers depth and intelligence. Now THAT is how to tell an origin right.", "While this might not be the most memorable MCU movie and had kind of a misplaced montage sequence in the middle instead of showing us more action, not much else was wrong with this movie! I liked the message and deeper meaning behind Captain America's origin and always love Hugo Weaving as a villain (who should've returned later). The twist ending (while expected) was also well-played. Are Thor and Iron Man cooler and better with their phase one movies? Yes, but I can't ignore this one either, along with its triumphant and original score!", "I ventured into the theaters this evening expecting to see a decent film or at least the best adaptation of a comic. This is what I'd heard the last few days.\n\nCaptain America is NOT the best comic book movie. It is a very average film with good special effects.\n\nTo be totally honest, I don't think this film is better than Thor. Thor's writing was much better. Captain America is entertaining, but it lacks a certain element which would make it exciting.\n\nIf you have not seen this, you can totally wait for the DVD. It isn't better than any of the Iron Man films, not better than Thor and it was just enough so the Avengers film would be made possible.", "A bit on the purposefully cheesy side. Lays the groundwork for the next movie, which I like much more than this.", "This type of film is conjured up in dvertising firms based in what John Q \"wants\" to see. They're designed for you to sit back and mindlessly have every morsel hand fed to you. It MIR all the way. kid but depending on mood, MOR can be just fine. Chris Evans has all the aw shucks qualities to embody the character and he's very good at it. The rest is all rehashed usual fare- the obstacles, the bff, the girl, the struggle, the glory.", "Captain America: The First Avenger is a 2011 American superhero film based on the Marvel Comics character Captain America, produced by Marvel Studios and distributed by Paramount Pictures. It is the fifth installment in the Marvel Cinematic Universe. The film was directed by Joe Johnston, written by Christopher Markus and Stephen McFeely, and stars Chris Evans, Tommy Lee Jones, Hugo Weaving, Hayley Atwell, Sebastian Stan, Dominic Cooper, Neal McDonough, Derek Luke, and Stanley Tucci. Set predominantly during World War II, the film tells the story of Steve Rogers, a sickly man from Brooklyn who is transformed into super-soldier Captain America to aid in the war effort. Rogers must stop the Red Skull, Adolf Hitler's ruthless head of weaponry and the leader of an organization that intends to use an artifact called the \"Tesseract\" as an energy-source for world domination.", "Not the best of the marvel movies. Still some good bits and some great cgi in the beginning", "This film took forever to get started (lots and lots of exposition)and once it does it goes no where. The biggest disappointment was how they utilized the new super-human powers that they gave Captain America. He did nothing more amazing than what Stallone and Schwarzenegger do in their action films. He fought, killed, and outwitted the bad guys no better than any human action star does in movies...what a waste of highly developed muscles.\n\nAlso, the bad guy looked like he was Jim Carrey from \"The Mask.\" Did the director realize that they both looked similar?\n\nFinally, the female character was extremely annoying...and it was hard to swallow the idea that the army in the 1940's would ever have a woman train new recruits.", "I do try to watch all movies to the end. This one I could not. I know its Captain \"America\" (or more accurately Captain U.S. of the same). Still, too much is too much. I acknowledge that this movie is in Zeitgeist and showing no \"Nazi\" faces, only masks. Still, killing off anyone who doesn't speak English in a WWII movie is long forgone.\n\nThat's just for my personal interests.\n\nFor the everyday-audience-flaws: Just wtf? Firstly, if CA was a dwarf b4 becoming the mean machine, please depict him as such and not just shrink the image. No small person looks like this. Secondly, the labs, weapons and such. there heave been numerous films overstating what the Germans could do in WWII. But what with all the black light? The lab of the \"Hydra\" looks more sophisticated than what NASA could do in 50 years from now). For the rest: gotta go, whats yourselves", "Mediocre acting with cliché lines aplenty and good ole lets fight for the American way,more cheesy lines than a fondue and not much more to say about the rest of the whole movie,nothing too congratulate either the producer or director for either and the effort and thought put into many of the scenes was sorely lacking.\n\nA serious drop in quality expected from the marvel series of movies that are obviously coming to the big screens in future,and from whats expected from the iron man movies (which at least were entertaining on some level)im hoping this mediocre effort is not what we are expected to veiw in future releases.", "After the decent Thor, the disastrous Green Lantern and the under-performing X-Men, the Summer of the Superhero looked in danger of becoming its box office last stand instead. While Captain America may not break any records, and it likely won't surge much past 200 million domestic, it is still one of the best SH movies to come from the glut of the past decade.\n\nIt's first and last half hours are the most compelling. The former a rousing build up that actually has you caring about a character, and the latter a non-stop parade of action sequences, reminiscent of old time serials. Not quite in a league with 1978's Superman (still my benchmark for the genre) or The Dark Knight, but easily as good as any X-Men movie, and possibly better than Iron Man, Cap arrives just in time to give the bloated, sagging genre a shot in the arm. Time will tell if word of mouth will make it a smash, but it bookends Marvel's summer on an up note and should ramp up anticipation for \"The Avengers\" next summer.", "A movie which makes us proud because the cast is truly beautiful to look at; CAPTAIN ROGERS and his dream girl both. The continuity from AVENGERS naming list of CAPTAIN AMERICA as the FIRST AVENGER like the 'off.' STEVE ROGERS is the name that IRO MAN calls him in the latter issues of comics because these are prints from the culture that readers in the subcontinent get in magazines.", "It's not about strength. It's the kindess that a good solider different from the rest. Captain America The First Avenger is a decent installment of the beginning phase for the MCU.\n\nSolid story with some minor flaws and decent writing. It has good directing and camera work also. The start and ending were pretty good but the middle was a bit rough. It had a great cast that did their job playing their role. And the CGI,music and the acting were decent.\n\nOverall an enjoyable film.\n\nMemorable: No Rewatchable: Quiet unlikely.", "This movie was made in that time right before all movies has to \"help\" the cause. It was a good movie. You loved the characters, the plot was feel good action.", "Followed comic origins almost to a tee with subtle changes that fit the direction the movies are going. Graphics were on par, some moves were cheesy but fun to watch none the less since it's what he does in the comics. This is a back story, so everything is not blowing up for no reason and it has major focus on WWII because that's Capt's beginning. A few parts may drag for people who don't read comics. Otherwise I think Chris Evans did a fantastic job as Steve Rogers and Tommy Lee Jones along with the rest of the cast added laughs in appropriate parts. The Red Skull played by Hugo Weaving was perfectly matched for the part. Sexual tones are kept to kisses and side long glances while language is mild at most so this is a film the whole family can enjoy.", "The story of the film is fairly simplistic, in that Steve Rogers is a skinny boy who gets kicked around a lot but has a heart as big as any, however when a German scientist discovers him when he eventually enlists to the Army on the 12th try (or whatever it was!) He is then part of a \"super-soldier\" program and becomes the superhero Captain America! The main villain in this film is Johann Schmidt and whilst he is not the most outrageous of villains and it's sadly quite boring in places, he does seem like a worthy adversary for Captain America. The film establishes one the favourites of the MCU and the future leader of the Avengers who wears his heart on his sleeve and will die for his country/world without a second thought", "Captain America: The First Avenger is a solid introduction of the MCU's first (in chronology) superhero. Evans embraces the role and gives a convincing performance of a hopeless 1940s teenager turned super soldier. The rest of the cast does well, and Stan Lee's cameo is a bonus. The film's downfalls can mostly be attributed to its presence as an origin film with a lot of ground to cover, not allowing time for more character development. The fight scenes are only decent, and the villain of the story does not get enough screen time to truly provide the audience the strongest foil possible to the beloved Captain America. Certain dialogues, either with emotional depth or a spot on comedic tone, assist the film's overall well-progressed plot into becoming an exciting story to be continued.", "It starts decently but drags way too long for its little content. At least they spent enough time on the development of the main character for once. It's not easy to portrait Captain America in the 2010s without ending up looking ridiculous, and it was actually cool that they started him off as a cheesy fictional propaganda character before shaping him into an actual superhero. Just, nothing relevant happens afterward. The story is not interesting enough to make this worthwhile as a story-driven film, and action sequences are dull. I'm surprised no one mentioned the ridiculous CGI backgrounds that make the whole movie look like a cheap-ass music video more than a 3D sensation. I also hated their rendition of Howard Stark. They just tried to make him look and act like Tony so that they could have an interesting character but failed miserably.", "This film was unbelievably good plus it has Chris Evans!!! The storyline line is amazing!!! Sadness, gratitude, love, action packed!!! What's NOT TO LOVE about this film!?!", "I pledge allegiance to the flag of the United States of America and to the Republic for which it stands one nation under God indivisible with liberty and justice for all. And I pledge allegiance to the greatest superhero of all time, Captain America. Thank you for becoming the First Avenger.\n\nCaptain America will return in the Avengers", "Despite a low rating, I love this movie. The captain is likeable and the story itself goes smooth without any boring parts. If I will need to say some negative thing, then it will be a weak villain. A big plus for me is a retro atmosphere which gives the movie a nice vibes.", "I continue the marvel series I think it was the worst marvel movie ever, by far the worst in terms of visual effects only the story is beautiful. Captain America is not one of my favorite heroes somehow I couldn't warm it up. The movie is not beautiful, it is watched without getting bored above average, but the action scenes and the fight scenes did not affect me. The effects are bad, I just like the subject to be more realistic.", "The Captain America is too humble among a bunch of superheroes. His skills are very plain, not my type. But on the contrary, it is more grounded, more like a normal person with flesh and blood.", "The films starts off nicely. The set up is great, in which we can see a puny Steve Rogers wanting to be more than he can be, by trying to join the war to help his country.Unfortunately, the government turns away the scrappy guys, so he cannot get in to fight. Enter Dr. Erksine with an experiment that could possibly changes things for our little outcast. The experiment works and then the doctor is assassinated, so things seem not so good for Steve. He even goes on the road, also starring in some films before he is taking serious when his comrades in war need him. It is the adventure of a lifetime for Rogers, who will become Captain America, then the films falls apart. It becomes a little boring and predictable. The fault is not the cast, especially Chris Evans, who shines in this role as an all American hero. He is perfect for the role. The fault does lie in the writers and directors hands. The direction seems aimless and the story loses momentum half-way through. Don't get me wrong, i stuck it through because i had hope and a large popcorn and cherry coke to finish.", "Unfortunately, I did not get to see this in the theaters, but I just saw in on my i-pad. I have been a Cap fan for all my life. I have seen every version of Captain America. This movie is the best of the lot by far. Some say it was predictable. The story has been out for so long how can it be anything but a bit familiar. But it was version well told. Also I think Stanly Tucchi and Tommy Lee Jones take the movie a the next level. Bringing out that Rogers strength of character comes from when he was a smaller man is highly important, and this is what makes Captain America different. He is the most compassionate of super heroes, and the one with the greatest sense of duty.", "A Sci-Fi movie of World War II that doesn't bring anything new and even the clichés are not done well. The actors have done a decent job but everything else (including screenplay, directing, costumes) is worthless. I don't want to spoil it and tell you why the script doesn't make any sense, I'll just let you know that it doesn't. If you are expecting a villain with a complex, evil plan and a hero who fights back with an even better plan... then you will be disappointed. For a Super Hero / Sci-Fi movie, I expected some huge special effects. I saw none. I could not believe they even copied the bad guys nose job from Harry Potter. Who does that? Do not waste you money on this (unless you are an American and you want to see your flag all the time)!", "I don't know, its okay, but its not that good. Its kinda boring and pointless.", "This is a fun start to the MCU. Lot of action and did not slow down much. I liked how they focused on captain America and didn't spend much time of the other supporting characters. We were there to see the captain. I was a little confused on the teserex or whatever it was called. They didn't explain it much but I'm guessing it gets explained better in future movies.", "This movie shows you Captain America's first steps, but there's no background information about the Serum and also the plot feels a bit thin.\n\nThe action and especially the production is superb, I couldn't ask for much more from a movie honestly.\n\nGotta watch it if you follow this whole Marvel franchise, but else not mandatory.", "Girls : it's been 3 weeks he must've moved on and forgotten me.\n\nBoy's After 70 Year's : I Had A Date. 💔\n\nSteve Rogers is a super hero icon, easy to identify with his Red White and Blue Shield, he is unlike any other superhero. This movie is a suitable origin story for his powers and vehicle for background on Rogers, Agent Carter, the Cosmic Cube 'Tesseract', Hydra, and Stark Industries. That said, it is long, the fight scenes usually hold no real value because nothing is really at stake. We know Rogers gets frozen in ice, he will never live out his life here in the present so it's hard to grab onto and care about too much in this setting.\n\n8/10.", "You appreciate this masterpiece even more after watching that tremendously awful TV show. They took the character of Bucky and turned him into a wuss. They ruined Sharon Carter's arc. And, they took a great character introduction here with Sam and make you look at him now as nothing but a race baiter and a frustrated paranoid leftist. Try to avoid that race baiting, divisive, mongering TV show and stick with this movie and enjoy it for the classic that it has become.", "I know this is a superhero movie and its not supposed to be realistic, but I can't fathom some of the action scenes, they are really dumb. I love a movie when they completely contradicts itself in the most obvious way. Howard Stark specifically mentioned that Captain America's shield is vibration absorbent but when Bucky uses the shield its no longer vibration absorbent somehow.\n\nBeing a superhero movie of course its packed with CGI, some looks worse than the other but overall it looks alright. One thing that I do like about this is the aesthetic, I like the WWII settings. The story has a little bit of depth but not like its the main selling point. The main selling point itself as I've mentioned is poorly executed, the action scene is just not convincing enough and some of them are really dumb.", "I know a lot of people out there still read and collect comic books but I am admittedly not one of those people. I do, however like the newer comic book based Super hero films. I watched Captain America because I had not seen the Avengers yet and wanted to make sure I had all the stories.\n\nI felt this one was a giant step backwards for comic book super heros. It was corny and comical and not in a good way. I get what they were going for, and if we lived in the 50's or 60's and this movie came out I would have loved it. That being said, I think they could of made this movie in a much more adult way. It just felt too much like an old comic book. I was hoping it would be a little bit darker and more humanizing. The acting was somewhat Blah, and way too over the top for my tastes, as was the entire movie.\n\nIt was a 6 for me.", "I guess this is an okay movie didn't hate it or love it...", "Maddeningly drawn out and sometimes unbearably cliché, Captain America manages to spoil the depth of story.\n\nScreenplay...................................... 4 / 10 Acting............................................. 5 Cinematography / SFX.................... 7 Sound................................................... 5 Editing................................................ 3 Score........................................................... 7 Timeless Utility................................. 4 Total.................................................... 35 / 70 = 5 Verdict................................................. Passable", "Captain America: The First Avenger. I'm a simple guy from Brooklyn. A good solo film about one of the very first Avenger. The very image of the Captain is a little boring and does not fall in love with himself, and the story itself is very interesting.", "The first half of this movie is great, on its own it would've gotten a higher ranking, but the film starts to get riddled with problems in the second half. It feels like a character study of Steve Rogers, who goes from a weak pathetic nobody to an unstoppable solider. The main villain is also much better in the first half, but after that he becomes generic and forgettable.\n\nThis film has a lot of good things in it, they are started, but are never finished.", "It can be watched to get to know the Marvel universe. If you aren't interested in all the movies, don't watch them at all.", "Captain America: The First Avenger is a film that inevitably fails to be something better, much better. Starting as a light-hearted war film, the plot eventually turns sideways and falls into the generic hero vs villain dragged plot with sci-fi ingredients added to the mix that don't really go well with the general tone established. Still, it somehow manages to end on a high note that may leave you wanting for more.", "Fun and entertaining to watch, this film was decent and good enough for its contemporaries. The script and production was safe, and there were no unnecessary plot details. An amazing film to watch to start the entire MCU timeline.", "Captain America The First Avenger is about Steve Rogers trying to get into the army. He then is disliked by everybody but one doctor. He makes a machine to make Steve big a strong and then Steve is super famous. He also wants to help the army stop Hydra.\n\nThis film was amazing. The time that this happened was really fitting. It showed how he became Captain America. The only thing that annoyed me is how futuristic this movie was. The stone made sense but the guns were just stupid. They even looked bad. The acting was great. The casting person did a great job. They hired some of the best actors. The scenery in this movie was also really great. The choices for where they filmed were top notch.\n\nCaptain America The First Avenger is a great movie. The best Marvel movie to me.", ".Handsome captain and beautiful hostess, super good-looking! Highly recommended!", "A real thrilling fantasy is \"Captain America:the First Avenger\". It is directed aptly by Joe Johnston. And it was written by Christopher Markus as well as Stephen McFeely. The protagonist is Captain America (Steve Rogers) aptly played by Chris Evans. He initially is rejected by the Selective Service for military duty in WWII. But he is persistent in his pursuit for physical success and eventually winds up on the front lines. Hayley Atwell plays Peggy Carter, and she portrays a dedicated woman with super heroine gusto. Sebastian Stan is James Buchanan, (Bucky Barnes). And Tommy Lee Jones gives his usual precise performance as the Colonel Chester Phillips who is in command and needs to be convinced that Captain America can handle the challenges frequently encountered. Hugo Weaving is Johann Schmidt with a red skull as his persona. He is menacing in his portrayal of this mean, dark character. It is an action packed film that can please the adult as well as the young at heart. It got a two thumbs up.", "It was just a bit boring and too much propaganda about America Hayley atwell plays a good part Tommy Lee Jones plays a good part but the others where a bit to wooden the guy that plays capt America I just couldn't root for him", "I haven't seen many Marvel movies so thought this would be a good starting point.\n\nThe movie was only just interesting enough to watch, and I found myself yawning through a lot of it.\n\nWas a pretty average cheesy action movie. Barely any plot. Unoriginal story.", "The best thing about \"Captain America: The First Avenger\" is that it is set during World War II, and thus has a very pleasing 1940s movie serial aesthetic. It's almost like watching another \"Indiana Jones\" movie. It's nice to see this as a homage to old school superhero stories. A clear evil guy going toe-to-toe with a good guy.\n\nMy main gripe with it is that it lacks good characterization. It would be cool to see Howard Stark (Dominic Cooper) and Bucky Barnes (Sebastian Stan) get more screen time and attention, considering the fact that they play a huge role in future \"Captain America\" films. Hugo Weaving is good as Red Skull, though nothing too spectacular.\n\nIs it just me or is this one of the ugliest Marvel movies? The colors are all brown and warm and it just makes the movie look ugly. Regardless, it's decent enough as an origin story for the character and a good direct lead-up to \"The Avengers.\"", "People got very angry when this came out as many decisions happened to lead to continuity in the MCU. Obviously well thought out and the plot lines were necessary and still shine through the newer movies and tv shows.", "True courage lies in the heart and not in the hands is the basic idea portrayed by the movie. This is an interesting fantasy that takes us back in history and presents the creation of strong superhero out of an experiment. Also the shield, its built up is an add-on. Wonderful stuff for watching and enjoying. But at the same time screenplay and acting are worth noting.", "Before watching this movie, I always thought Captain America was one of the lamest superheroes from marvel, I thought he was just a propaganda character that refused to die. But now, I have a different perception of him. Hes like the Superman from Marvel, always trying to do the right thing, always the best and the boy scout aspect of the character is what I really liked about him. The story does a really good job at how it shows Steve at the beginning and how hes just a good person. And I love that. The story is very cliche, the nazis are bad, we need to stop them, but thats not bad and I really like war movies so it just ads into making my experience more positive. A great movie.", "Hands down my favorite of all the MCU films. It might not be the strongest character, but the story is just so amazing.\n\nI am a huge WWII fanatic so to see the setting and the story arc of the Rogers character is so uplifting. He is one of the MCU characters that is just so pure. He stands up for what he believes in and never backs down.\n\nNow, I wouldn't say that Captain America is the best Marvel hero, but his personality, his belief system they all are so strong that it just makes you root for him. Hugo Weaving as Red Skull is mesmerizing, personally, I don't think there is a character that he can't do. Especially if that character is supposed to be menacing and villainous.\n\nI will definitely re-watch this film over and over again.", "Eight years ago, I watched Captain America: The First Avenger and I enjoyed the film. I liked the 1940's style and art. It's just like watching a serial film from the 1940's and it's something like in the Indiana Jones franchise. Chris Evans is awesome playing Captain America. Hugo Weaving is scary as the Red Skull. There were people saying that the film was not good but I know there are true Marvel fans who enjoyed viewing the film. I like the story and entertainment of this film. Alan Silvestri composed the film's music so perfect. I also liked the Winter Soldier and Civil War.", "Captain America: The First Avenger is an okay movie. Not essential to Captain America, but still has a nice cheesy 40's charm. A problem I do have with the movie is that Steve Rogers doesn't become Captain America until the middle of the movie. And the scenes before he becomes Captain America are quite boring to be honest I would like this movie a lot more if he was started punching Nazi's earlier. Another complaint might be that their isn't as much Nazi punching as there should be, its only really in one montage (admittedly a great montage). My favorite part the movie was probably the World War II action and montage. Overall the movie is harmless and does deserve a watch.", "Many reviewers will be turned off by the politics. In other words, anything pro-American is looked at with disdain. It's why Superman was changed in the 2006 and 2013 reboots. The \"American Way\" is now looked upon by Americans with even more revulsion than that felt by foreigners. Not sure when this self-hating strain became a tsunami but I think the 60s would be a good guess for it's genesis.\n\nThis film should be rated higher than 6.8. It's a nice little WW2 movie spiced up with sci-fiction and spy movie action. It brings forth some old-fashion ideas that have fallen out of favor while also embracing some old-fashion values with have not fallen out of favor.\n\nWatch the movie without the veil of politics screaming at your brain and you and your gal can enjoy some popcorn and soda along with your big budget Hollywood entertainment.", "Just watched this for the first time and I was super impressed...Evans is unprecedentedly touching and engaging for a superhero - and the rest of the cast help this adventure seem something close to character-driven instead of just being a bundle of stunts.\n\nEvans, who previously starred in Fantastic Four was ok BUT as Captain America he is the bomb. I still cannot believe I used to ignore this movies and others that followed..", "With plenty of pulpy action, a pleasantly retro vibe, and a handful of fine performances, Captain America is solidly old-fashioned blockbuster entertainment.", "so at first the movie seemed pretty cool, but as soon as captain America actually became involved in the military, it just went downhill from there. the special effects got increasingly ridiculous. \" lets go jump over a 50 foot tall tank (ikr like really 50 feet), throw a grenade in it, and throw our shield at people!!! even though it is solid steel and would be impossible to throw and would kill you when it came back at u. lets make this guys face red! ya lets screw up the ww2 story and add futuristic crap.\n\nso much potential, but failed miserably, especially the ending. \" ow u shot me so ill crash this plane into the Arctic ocean but of course I'm superman so i wont die. huh i think ill take a nap. whoops i overslept now its 70 years l8r oh well.", "Way more camp than I remember .\n\nCaptain America: The First Avenger feels as though it has taken the framework of a more conventional war drama and just thrown in some superhero stuff and I don't necessarily think that is a bad thing. When this film embraces its campness it can be very entertaining. Chris Evans was a prefect casting choice for Steve Rodgers and this film does go in an unexpected direction by making Captain America basically just a mascot but once again the villain is weak and large sections of the plot are forgettable. Overall worth re-watching it is probably better than you remember.", "I love the MCU but this film is so, so weak. When your film is like 15% montage you've got a problem then covering it with cringe dialogue and boring action sequences you have the worst MCU film. The only redeeming qaulit in this film is the acting and the introduction of Captain America and Bucky Barnes to major players in the future of the MCU.", "I hated the movie, the whole moviwcis horrible except for lovely Miss Jenna Coleman that is in this for 20 seconds. The extra star is for Jenna. Otherwise this movie is trash. The acting and everything is dull.", "What a disappointment. After learning it surpassed Harry Potter - Deathly Hollows 2 in earnings, I thought to myself this movie must be damn good. Yes, I am afraid expectations were high. In comparison, Iron Man 2 (which was a failure in comparison to Iron Man 1 personally) looks like Star Wars to this \"over-inflated flat tire\".\n\nThe acting is over-driven above tasteful limits, if there is acting at all, mind to say. Story has some nice Sci-Fi elements, and thats the whole reason I gave it 2 stars. Hugo Weaving was way over the top, this is probably his worst role so far. The part that looked like a commercial probably was homage to old times, but for me it was a moment when I decided to abandon this farce.", "I saw this film one evening with my son (who is seven and currently obsessed with all things WWII) and I was hesitant. But to my surprise \"Captain America\" turned out to be a solid and well made film. Honestly, I am not a Captain America fan and I was under the presumption that the film was going to flop. But the film is fun, well-written, and delightfully three dimensional fun that is reminiscent of old matinée action films but with a deeply felt message. Chris Evans is engaging and well-cast as Steve Rogers a/k/a Captain America, a plucky scrawny kid from Brooklyn trying to join the Army until he is selected for a top secret experiment where he genetically transformed into a superhero.\n\nArmed with a cast of strong supporting actors Stanley Tucci as the brilliant and wise scientist, Tommy Lee Jones playing his usual tough guy as he can only play it, Hugo Weaving as the bad guy, and Hayley Atwell as the lovely and brave love interest (yes, I love a good comic book movie where women are not objectified damsels in distress!).", "With the MCU at a high point they introduced a iconic hero who is the symbol of patriotism for America and the story would give us a new look at hero's. Captain America is played by Chris Evans and he just just perfect for the role i can't think of anyone else to play the lead role his sidekick Bucky Barnes played by Sebastian Stan and he is another person perfect for this role. the minor characters like Peggy Carter played by Hayley Atwell and Armin Zola played by Toby Jones who in there own were amazing minors with the addition of Tommy Lee Jones an Iconic actor. the villain the red skull is played by Hugo Weaving and he is the best version of the character. Overall the first outing for Cap was awesome i enjoyed the WW2 setting and the Nick Fury cameo at the end which sets up the avengers i would watch this one again definitely.", "181020: On a triple-header night, which included Horrible Bosses and Cowboys & Aliens, this film came in third. All were close but I'd take the other two over Captain America: The First Avenger. Didn't read his comics. Did read Captain Canuck however. Perhaps therein lies the problem? Good entertainment all around for comic book fans. Well paced and fun.", "Captain America: The First Avenger is a good film. Nothing less, nothing more. The first act of the movie is great, introducing us to the character of Steve Rogers and his struggles. Unfortunately, after he becomes Captain America, the movie loses a lot of its focus, and becomes a mindless action movie. On top of that, the action isn't especially well-filmed. The characters are overall pretty good, and the story itself is fine. Unfortunately, the Tesseract felt too much like a MacGuffin, and it didn't interest me much. The villain also felt a little boring, even if Hugo Weavings performance was good. All in all, the only thing keeping this movie from being mediocre after the first act is the character of Steve and his interactions with other people.", "After seeing the Avengers I decided to delve into the stories of the characters separately and i'm really glad i did. Even though Captain America: The First Avenger was a bit slow i do think it is a good set up since it is the first instalment. You get to know Steve Rogers and you learn how he became Captain America and you even get some action as well but it didn't give me the WOW factor i was hoping for.\n\nThat said the film is still well acted and it made me curious about Captain America, just not as big of a WOW factor i thought it was going to be after seeing Iron Man.\n\nDefinitely still worth a watch!", "Captain America : The first Avengers is a movie about a fragile boy, Steve Rogers, transformed into a super soldier . Chris Evans is such talented actor, he is really into his role, he has a such great bound with Hayley Atwell and Sebastian Stan, they are so perfect together ! If you are looking for a film with a love story, war and super-heroes, or if you just want to watch an awesome movie, then stop everything and go watch Captain America : The first Avenger. Trust me on that, the film is long, but it's really worth watching, the plot is really captivating, and they choose such great actors : Chris Evans for Steve Rogers, Hayley Atwell for Peggy Carter and Sebastian Stan for Bucky Barns.", "OK, after the crap-fest of Thor, this was a very good reprise! The Marvel team got their heads out of their tail-ends, and back to making a movie again.\n\nCaptain America was well done, kept you watching for what was going to happen next, even if you figured out what was coming, it usually came in pairs, and at least one caught you off guard. Even with the few flaws, the story was solid enough to cover them. A real delight to see one of these comic movies brought back to life, without someone walking around with the \"actor's\" scripts to be read from. And they actually sprung for a competent crew this time.\n\nI am hoping that Ironman and Captain America will be the same actors, but that they change out Thor.", "Best way to kick of a film series. It had an amazing plot and bonus of seeing Chris Evans looking buff. One of my favourite films.", "Such a solid movie! Great acting. Great characters. I actually think they could have gotten 2-3 movies out of the plot, but I know they needed to get to the Avengers. Sad they wont make more with Evans. He was perfect for the role. If possible, I would love many more Cap standalone films.", "This is the movie I've been waiting for. I love the concert of a character being idealist to a fault. And I especially like how that character is tied to the American narrative and culture. Perfect movie. Cap is now my favorite super hero.", "Just a good movie to spend your evening. Good atmosphere, interesting relationship between Cap and Peggy, but poor fight scenes", "Some of the action is too far fetched and the CGI was too much for this particular movie but other than that, this was a really good movie.\n\nGreat origin story to me from who Steve Rogers was and who he became as Captain America. Having Howard Stark involved and flash forwarding after he was frozen was really good. And of course the teaser end-credits leading up to the 1st Avenger movie.", "But you have enough time then you can watch it once", "This movie was a perfect mixture of WWII and a superhero movie. I would say this was a pretty good movie", "The story doesn't grip you at all. There is not even a single action scene that is jaw-dropping. The comic punches are lazy and boring. The only thing that makes this movie still tolerable is the performance of its actors. Watch the movie only if you want to complete your count of all the movies in 'The Avenger Series'.", "I decided to watch the MCU movies in chronological order from time periods, so I started with Captain America. It kept me entertained, and I really liked the start, but it definitely stagnated a little at times in the middle of the movie. I feel like Marvel can definitely do much better than this, but it was a good introduction to Captain America, who I will be seeing lots of in the future in these other MCU films.", "People have criticized this movie for what..... I'm sure the know better than I. I'm not a literal movie watcher, for me it's the idea, just an enjoyable idea idea. So, sit back an enjoy.", "This movie was great but 8 stars is I didn't like final battle", "Frankly, i'm not considering myself as a fan of Marvel movies or Marvel Universe and i think that they're like a \"popcorn movie\". I don't want to be so prejudiced tho, i've decided to start watching 'em in chronological order so, Captain America is the first on the list but actually, it's not a good start.\n\nThe script is so weak in my opinion and it has so much void and flaws. Chris Evans fits the role as Captain America perfectly, nevertheless, he couldn't turn it to a fair average one.", "This movie is fun. Pure comic book glee. It's heartwarming, fun and entertaining. The visuals are wonderfully entertaining and it's pure fantastic", "Captain America is a little tongue and cheek, tastefully done. Throwback, intentionally old fashioned. Fun, means to set up captain America, and intro to his character and motivation, and now we are ready for the avengers. Succeeds on what it wanted to be. Could have been more. Keeps up recurring themes in marvel this far, like dips in the second half and boring love interests. But overall recommended. Neat set ups and hidden Easter eggs. 75%", "I could only make it through half of the movie. It was that lame. Something about seeing this dumb@!ss run around trying to be all stealth wearing an American Flag costume and carrying a silly shield the size of his chest that he uses to block bullets just had me thinking that this one should have been left in the comic books and never turned into a movie for the big screen. There is just no way to make the movie even half believe-able, so I am left wondering why they even tried. So, unless you are a moron or maybe semi-intelligent yet able to suspend that intelligence for hours at a time and enjoy lame entertainment, I would highly recommend you forget you ever thought about watching this movie... Then again, as I said above, I only made it through half of the movie, so maybe the second half is a real hoot you might be thinking. Somehow, I just do not think so...", "Oh good grief. Some people just can't have fun. I take that back...some people have fun by nitpicking a movie to death. Was this movie slow at times? Yes. Did it always make sense? No.\n\nWas it fun to watch? Most of the time. This is a popcorn movie. An expensive pulp fiction movie. It is a big budget Grandson of the action serials from the 40's and 50s. Go watch it for fun. Don't over analyze the thing for crying out loud.\n\nThe only part of the movie that made me cringe was a 5 min portion which almost turned into a Busby Berkley musical. If I had been the editor, that was the part I would have cut out. Other wise...I look forward to a sequel.", "I recently watched Captain America on Netflix. Chris Evans was very convincing in his role as Steve Rogers aka Captain America. All of the actors and actresses were very convincing in their portrayal of their characters. The director Joe Johnson was very effective in telling the story of Captain America. His choice of lighting, camera angles, and soundtrack really set the tone of the movie. The plot of the movie was very well thought out. From beginning to end the movie was very enjoyable.If i had one complaint it would be the movie did not have enough action and drama than from what i had hoped.That's just my opinion though.. Overall this movie was enjoyable. I would definitely recommend this movie to my friends, family, and to anyone who enjoys action,romantic, and some what comedic movies.", "The Blockbuster of the year is here and I got it on DVD off amazon and the action was excellent and the heroism,comedy and performances were superb the only scenes I didn't like were the hydra lab scenes with toby jones in they could've been shorter and a bit quicker but nevermind cause there's better things to talk about like the big and exsplosive action scenes which are fantastic cause of the lives he saved and the heroic things he did especially what he did at the end which is obvious cause he sleeps for 70 years then gets to start his membership for shield/avengers from nick fury and he afterscene shows a little bit of footage from avengers assemble with some new faces like Mark Ruffalo as Bruce Banner Jeremy Renner as Hawkeye who played him in Thor as a shield agent in the building were the shield company took his hammer and his friends research from them and Black Widow from iron man 2 who was also a shield agent and had shorter hair and still worked for Nick Fury. \"This is one of the best blockbusters along with Thor\".", "It was funny seeing Nazi Elrond. However, there wasn't much to enjoy about this film. It was a pretty bland origin story which had an even blander ending. However, being familiar with Captain America's origins might have been why this film felt so predictable and meh to me.", "This movie is actually really good. Steve Rogers is a small guy and wants to enlist in the army. (Btw the CGI on Chris Evans and the other guy is great) he becomes a hero and experiences war and it's action packed and even at some points violent. This movie is one of the only marvel movie before 2012 to feature bullet wounds and effects such as the scene were Steve uses a car door as a shield and gets grazed through the door. The only problem is that there is a huge montage in the middle that seems out of place. But the ending gives me chills every time. I won't spoil it so you got to watch it. The relationship between Peggy and Steve is fantastic and Howard Stark is hilarious and feels like Tony.", "Booring stupid story with no charm . I can not understand how boring holllywood get", "Captain America is possibly the worst MCU film I have seen. The plot was interesting but not executed very well at all. The characters were all quite unintriguing and it ended up being a very tedious watch. I hope the Captain America character becomes more interesting in further films.", "Amazing backstory of captain America. The first hour of this movie was amazing but it got slower and than montaged through WW2. Red skull is a pretty forgettable villain and the plot didn't really have that feel of urgency, also the ending could have been better.", "Just another cliche movie about an american underdog becoming a hero because he doesn't give up Too boring unfortunately....boring and too predicable....almost like a kid's movie...also the whole surveillance cameras and all this is by no means 1942 even for a superhero movie.", "A Very Interesting Movies Shows The Creation of Captain But The Only Problem Is Villain That Looks Like Very Weak In Front of Captain America Otherwise Its Enjoyable And Highly Recommended.", "Why would they cast the guy who already played a super hero in the movie \"The Fantastic Four\" as another super hero. GAY! Out of all the super hero's Captain America is by far the worst. He has virtually no powers and a stupid shield. Maybe they'll do us all a favor and kill him off in the next Avenger's early. NTM he is dumb as a bag of rocks. They need a replacement super hero. One of the best parts of the Avenger's movie is when Iron Man verbally clowns Captain America. I refuse to see the actual Captain America movie. Horrible casting! I overheard that they were supposed to cast \"Curt Angle\" from the WWE as the initial Captain America. That would have been a little better. IDK I think they are flopping with the Spiderman cast's and Captain America's cast. It was almost as bad as when they cast \"Halle Berry\" as Catwoman or Storm. PFF! The woman they should have cast for Storm is the actress Iman. She is even from the continent Africa and looks way more like Storm. Who is the casting directors on these projects? Do your homework!", "The film is not that bad, acting and action is good, but there is no continuity. By this I mean that the motivation for each action becomes sillier and sillier at the movie advances. The villain was cartoonish and ineffective. I still enjoyed :-)", "If your an American patriot that loves about everything about American and what America is... watch it... other than that it sucks... first I've been angry at some movies for not giving enough time to introduce the character and see where hes/she is from and what shes like... this movie takes forever to get to the story... this is probably the only movie that I've seen with this problem.. second when it comes to the action which i thought this movie was full of.. it had barely any good action scenes in which i can remember... be warned that this movie also has the most awful acting by Chris Evans I've ever seen.. i mean I've seen more talent in TV reality shows... not only that the ending is terrible in every way.. not only is it uncalled for but the action sequence that leads up to the end is the worst I've seen in my life...", "This is a BAD film. It is not even good enough to be formulaic.\n\nAny talk of \"character analysis\" is a joke. There is about 5-minutes of the most simplistic \"I'm a weed who wishes I was big, isn't life tough.\" Transformers had more character analysis.\n\nThe 3-D version is a disaster - far too dark to see anything. The director should have remembered that 3-D viewers are looking through dark glasses and things need to be brighter than average. 3D was obviously added afterwords, with little attention. It is not used as a filmic device to enhance the film in any way.\n\nThe plot is dull, and almost non-existent. The film is at least 45 minutes too long, and the middle 30-minutes could be cut without anyone noticing.\n\nThis is probably the worst super hero film since Hulk. Do yourself a favor, AVOID!!!", "Seriously, this was one of the worst movies I ever watched for the whole of 2011 so far! i don't know, maybe for people who want to watch nothing but action, this might be your movie. If you usually look for something more than action / effect, like I do, pls save the 10 bucks or so and avoid this one! The first twenty minutes were actually not bad though, but that is it...what happens afterward was totally forgettable! Well, to be fair, you don't ask for much when comes to an superhero action movie and I didn't go into the cinema with a high expectation to begin with. Some people actually compared this one to X-man first class. In my humble opinion, how could it even compare???", "In my opinion, 2011's \"Captain America: The First Avenger\" is the best movie based on the titular character.\n\nAs an avid fan of the indelible Kirby-Simon source comics, I believe the character of Captain America flourishes most when the story is set during wartime. This movie exudes the patriotic charm and stylish ambiance of that era, and to me, the endearing perseverance and bygone disposition of Steve Rogers doesn't have the same charm outside of that wartime era's world; whenever the character is set in the modern era, he's diluted. But hey, that's just my opinion.\n\nIf 2014's \"Captain America: The Winter Soldier\" is instead your preference (or \"Captain America: Civil War\", though it's more like an Avengers sequel), that's fine, I just don't agree with it, and can defend my claims; \"I can do this all day.\"", "This is the worst movie that i have watched this summer. Thanks to IMDb's 7.8 rating i had to sit through 2 hours of torture. There is thin-to-no story line. The characters are very weak, and the female role has absolutely no part in the movie but to walk around. If you have watched the trailer, you have watched the movie. Do not expect anything \"interesting\" from the movie. It is full of logical flaws. The 3 rating i have given is for the gfx effects, there were lots of continuity errors. Captan will be running for a second and the very next shot he will be in some place unrelated. In one word they have killed a comic classic.", "I have to admit that I don't know much about Captain America. But I decided to check out the movie because I love movies that adapt comic book characters, because there is usually a rich background and character development that the director has to work with, which is usually a good formula for making a good film. This movie was enjoyable, I was not bored while watching it but it was not as action packed as I had heard it was. I found that with any movies that introduce a comic book hero, this was filled with more dialogue and background history than the actual daily adventures that makes one a super hero that we love to watch. However, the acting was good in this movie, nothing over the top. I like the choice for Captain America, as I feel Chris Evans carries the charm of the underdog that we all cheer for. The reason why this movie did not get a 8,9 or 10 out of 10 was because I didn't feel the excitement that I usually feel during super hero films. Overall, it is a good movie but it will not be added to my favorites list.", "Captain America is probably the best superhero movie that Marvel has produced since they invented the Marvel Cinematic Universe. The film has received some negative reviews here in England as it portrays the Americans as the heroes of the war. Whatever you do, ignore those reviews- Captain America is one of the most fantastic films of the year!!! It contains the best storyline, the best actors, the best characters and the best cameo appearance from Stan Lee ever. What really stood out for me in this movie was the superb acting from both Chris Evans (Captain America/Steve Rogers) and especially Hugo Weaving who plays Red Skull/Johann Schmidt- the best villain in a movie since Sauron from Lord of the Rings. 8.8/10", "With Kevin Feige as the producer, such idiotic and impractical movie seems to be very disappointing. The story-line and the depiction of Military was such a disease. This movie can be tag-lined as the most poorly presented movie in the Avenger Series. The plot, Military Tactics and the fight scenes were so funny. I think this movie is incredibly a time-waste.", "This film is for children for sure, either because it was quite a while after i watched it for the first time or what, what happened in this film was all coincidence, he was the one who was chosen, the universe just opened its way, very annoying, but that's it, i think marvel used it to open their gates , attract viewers and so on.", "This movie was great, the acting was very good and the story was written perfectly, the humor the action the seriousness of this film was all put together very well. This is one of the first superhero movies that is well made and actually feels like a comic book on screen. This is one of my favorite comic movies and i love that they keep making more superhero movies, when all of the marvel characters come together its going to be great, The Avengers is going to be excellent and the way in this movie how they had captain America come to the future was awesome, its all coming togehter smoothly for marvel and i don't think it could be done any better. all the movies that have been made and are part of the avengers have all been top notch, you have iron man 1 and 2 they were great, thor was very good, the last hulk was much better even though in the avengers its a different actor then from the movie, and captain America to rap it up for the avengers", "Captain America: The First Avenger is a film that is not horrible, but it just kills time before the Avengers.\n\nHere are the upsides: Chris Evans is pretty good as Captain America and Hugo Weaving does a stellar Red Skull. The rest of the cast is good, but not really spectacular. The action does keep the movie going at a good pace, so your never bored. It even has a few good comedic one-liners.\n\nHere are the downsides: The story can feel really un-realistic, especially near the ending. I also thought that the romance between Captain America and Agent Carter was forced.\n\nBut all in all, Captain America: The First Avenger is entertaining and decent as far as comic book movies go.", "I love the avengers series in general but felt this movie - set first chronologically was one of the lamer offerings... I know they are super hero movies but very unbelievable as I couldn't grasp how a scrawny guy now with injected muscles can now run special ops missions with no training... And also some very unclear characters and waste of great actors in Tommy Lee Jones and Hugo Weaving.. overall once was more than enough", "I was really frustrated to see last two movies from mcu but At least MCU offered something to stick to even though It isn't that much memorable. Its just a good popcorn action.", "Once again like most faze 1 MCU movies this film does its job and shows us another avenger. All around it's not a bad film but the pacing was a little slow. The movie does show us some cool fights by the end but the trip to the end takes longer then expected. The movie does pay off in the end and is definitely worth a watch. Just nothing outstanding.", "This movie is the story about the origin of captain america and the war if he exists. you can enjoy this movie twice or more if you all watch all mcu movies and do this again. so good movie.", "Like a psychology teaching mv, tell you a truth: internal consciousness drives the external destiny, external reality is the projection of internal imagination.", "When I first saw this, I thought it was way too cheesy and cartoon-y. However, this movie has really grown on me over time. Chris Evans really did a great job with Cap, showing that even the smallest person can have the biggest heart. Hugo Weaving as Red Skull was fantastic, showing us why the US was so reluctant to use the super soldier serum in the first place. Also liked Tommy Lee Jones popping up in a Marvel movie.\n\nMy only problem is that only Evans and Weaving had memorable performances, whereas the 4 above this one had great contributions not just from the main roles, but from the side roles as well. Still the definitive Captain America story though.\n\n9/10", "Marvel unleashes a new superhero movie, Captain America, in a World War II setting. Captain America was created by a wonderful scientist who believed that a super soldier could stop the war. The government naturally wanted to capitalize on the super soldier rather than letting him do the job that he was created for. He hated what the government was making him do and he knew that he had to save his friends who were fighting in the war and protect the country. So the first avenger has been created in the Marvel line of super heroes. This movie shows a lot of courage in fighting the bad guys including the Red Skull. I thought this movie did better than the comic books did.", "Positives: -Steve Rogers before he becomes Captain America -All of the side characters that Steve gets to know -Star-spangled man\n\nNegatives: -Boring action scenes/to much time spent on action -movie drags on near the end; would have liked more time spent on developing Steve's personal relationships -generic villain", "I can't help but notice that many people gave this movie a poor score and review for all the wrong reasons. Anyone who has ever read comics from the 1930's and 40's know that the technology displayed in this film was far beyond what was plausible back then but that same silly tech was featured heavily in the comics of the time. Is this movie perfect? No. Did Joe Johnston play it a bit too safe? Yes, but he in my opinion brought the same flavor of films like the Rocketeer (which he directed) and the look and feel of movies like Indiana Jones, while staying pretty faithful to source material, and trying to include the film in the MCU. I personally had a blast watching this movie even with its flaws but I couldn't help but enjoy it for what it is. Captain America is a period piece that manages to tell his and his supporting casts story while weaving itself into the mainstream Marvel Cinematic Universe.", "Scoring .5 -Plot .5 -Characters 1 -Acting 1 -Writing .5 -Cinematography .5 -Direction 1-Pace/Tone .5 -Score .5 -Special Effects .5 -Cultural Impact/Influence 6.5 Total Rounded total to 6", "After being deemed medically unfit for the military; Steve Rogers volunteers for a top secret research project that turns him into Captain America, a superhero. Its an all action, kill the baddies and save the world kinda film, not great, but not all bad, The same format, hero, and a girl he likes, and of course she likes him. the villain of the film, was so borderline comical,but you knew you had to hate him. The direction of the film was clear from the start. the action was none stop and that was of course,the basis of this action film. Its enjoyable as long as you don't take this film too seriously. The acting inst bad, and you sorta find that deep passion to cheer Cap America to finish line", "(Pre-Endgame MCU Rewatch) Steve Rogers' pre-super serum days are great, the Howard Stark Expo is a nice and fun addition, and initial post-super serum Steve is hilarious. He punched Hitler in the face 200 times! Once he finally gets to see real action I feel it loses a bit of fun but it's still decent.\n\nBoth Tommy Lee Jones and Hugo Weaving are excellent in this film and I expected nothing less from them. Agent Carter is a great character and if you like her I definitely recommend watching the Agent Carter series.", "Unexpected from a franchise like Marvel Cinematic Universe.\n\nSkip the movie and watch only the last post credit scene.\n\nThe only thing you should know is Captain America sleeps for 75 years and then wakes up.", "The movie is really interesting and I love to watch it! I would say it's one of my favorite MCU movies. I recommend this movie to everyone. It a 10/10⭐", "I guess I've come to expect more from Marvel and its movies. Character development, interpersonal relationships, ... I found this thoroughly unimpressive and predictable. Oh well.", "This character has no flaws, no character change or growth, no inner struggle. His heart is pure and \"perfect\" as it is throughout the whole film, which makes him the least interesting character to follow. The post-credit scene is the most engaging one.", "...........Cap's mortal enemies are the reds, which could be communists or Chipawas or gingers, and he's friends with basically anybody else who wants to think they're a 'superpower' but really isn't.\n\nTommy Lee Jones does a great job of playing Captain Canada, the Cap's slightly younger friend who just seems a lot older because back then they didn't have free health insurance, but is also a lot less douchey and generally easier to tolerate. Ryan Reynolds is perfect as Captain America. I don't think there's anyone in the country they could have cast to represent us so well! Except maybe Jason Lee? Read the rest of this 'review' @ http://skipnappan.com", "Although I have always been a fan of the idea of Captain America, a patriotic flick sure to put a smile on anybody's face, this did no such thing. I was unfortunately so perturbed by this film that I had to stop watching before I even reached the halfway point. Although the action scenes are well... Actiony, they are ridiculous and unsatisfying. Not to mention a terrible story line, and just terrible acting. I would like to think that this film was targeted at a specific age group 5-10yrs old, and that is why I felt it was not good. Take into consideration that I am not a comic book fan, have never read any CA books, or seen any of the previous versions, so my opinion may be biased.", "I liked the bit when the Nazi got shredded in a plane propeller.", "I think if this was the first superhero movie I watched this year then I would have LOVED it, but honestly when compared to some of the others Captain America struggles to get noticed. Bit's were brilliant, other bits not so much. I've read several reviews that state the CG body changes at the beginning are amazing, but for me, that ruined the beginning of the film. Chris Evan's head just does not fit right on a skinny man's body, and his head looks a bit like they stuck him in the stretching machine of Willy wonka fame. As per usual the heroine of the film was about as annoying as they could possibly make her, I just wish they'd find that happy medium between damsel in distress and chick that kicks ass, because until they do, its never going to work in my books! Overall a 6 for me, you'll have to work harder next time Steve!", "This Movie Perfectly Shows The Origin Story Of The Well-Known Hero Steve Rogers. Rogers To Me Is a Classic Marvel Character. I Read The Comics Too, And Gotta Say This Movie Wasn't a Let-Down TBH. Also a WW2 Setting Is Brilliant. Really a Good Movie.. If You Never Tried This, Maybe Its Worth a Shot :D.", "I didn't have much expectations of this film, I have never been a fan of Captain America. I decided to lose all my prejudice and watch the film from unsoiled eyes. I was pleasantly surprised. The actors are fine, the story is solid, the visual effects is very good, the music and cinematography could have improved. The time-period is well brought to life, and believable. Whilst not being able to fully escape the Marvel- superhero film clichè's, the director, actors, writer and crew manage to steer the film away from being just another film. I was able to recognize originality in everything the movie presented. Well worth watching, although just a small step away from being a must-see. 8/10", "Out of all the comic book films to be released captain America is definitely not the worst. The first twenty minutes of the film when the viewer is getting to know the man who would later become captain America we see the potential of what might of become one of the summers biggest and best hits. what happens instead is that the polished muscles of the captains must have blinded the writers as to the rest of the plot. The plot line is extremely weak and the action become extremely repetitive because how many ways are there to hit a man with a shield but that isn't even the worst part. The main problem is what has effected all of the marvel films that have been release and that is that there is no where near enough development around the bad guy and it lets down the whole film because you as the viewer just don't care what happens to ether of them by the end. The marvel film studio got it so write with Iron man but since then there has been let down after let down. so go and see captain America if you want some extremely mindless action then go for it I think personally i'll just wait for the Dark knight rises.", "I wanna talk about one especially: in the battle field where everyone runs around and shoots each other with BIG weapons and all, one female soldier (Peggy Carter off course) wasn't wearing a helmet because clearly the crew thought it would ruin her perfectly made hair. Not to mention she was wearing red lipstick even in that field. She is more bulletproof than Captain America's shield itself. Marvel, will you ever stop making women look like they just got out of the hair saloon even when they are fighting? Some of us actually have bad hair days!", "The fantastic four films weren't that good.But Chris Evans did a superb job as Steve rogers AKA captain America.The whole supporting cast actually did a good job.The whole movie was great B movie fun.Hugo weaving as the infamous red skull really just nails it.Also this movie is an origin story for the winter soldier as well.Captain America really expanded the marvel universe well movie wise fantastically.The storyline I actually dug and really got into.The action is explosive fun rehash of WWII movies.Joe Johnston direction really gives this film extra flare and excitement to it.Captain America really surprised and actually got me excited for the avengers movie.", "Slightly boring. Characters are not sympathetic enough. Even between main characters there is not much chemistry.", "I only went to see this US propaganda pantomime because I watched some of it being filmed in Liverpool England, and although watching it being made was a long drawn out and painful process I didn't realise watching the finished movie would be a far worse experience! Im really going to keep this short and to the point (which is what the films production team should have considered doing) The film starts slowly picks up about a third of the way through and then coughs and falls over! The action scenes are poor and not what you would expect if you have ever read the comic book, however the acting isn't bad but then quite a number of the cast are British playing Americans.\n\nThe whole thing would have been much better as a computer animated movie with plenty of tongue in cheek humour thrown in! If there is a sequel I hope they don't make it in Liverpool again as I could do without that dock road being closed for another two weeks as I have to drive home from work down there! also I would rather lose a limb than have to watch anymore of this tripe!", "Captain America is the latest in a seemingly endless line of origin stories and the last of The Avengers prequels. Captain America falls into the prevalent pitfalls of origin stories. So much time and effort is expended explaining how the protagonist gains his super-powers (and exploring his initial usage of them) that there's not enough opportunity to develop a compelling storyline beyond his \"baptism.\" The final confrontation is disappointing, lacking scope and energy. Evans is alright but with so many heroes to choose from he doesn't really do anything unique except don the cape and look beefy.", "I was not at all looking forward to seeing another super hero movie and the only reason that I considered it was because Chris Evans was starring in it and you have to appreciate his humor! Not to mention his good looks! Captain America is a \"must see\" for everyone who's proud to be an American and for those who are disillusioned with this great nation-I totally recommend it! It is full of surprises from start to finish, it's action-packed and it's a movie for everyone and I do mean everyone! When we saw it, the theater was filled at the early showing on a Sunday morning,(we usually go early to have a choice of seating and avoid distractions) but this was one of those \"see with a large group\" type movies. The more, the merrier! Clearly everyone was enjoying it. The audience consisted of people from the ages of about nine years old to maybe ninety years old without any distractions, cell phones, excessive talking or walking! I hesitate to say any more about it because I do not want to take anything from your enjoyment of this movie. We saw it once and are waiting to purchase the DVD ASAP.", "Captain America is pretty good movie and worth the time.well if your really into a story line this has kinda got it not like transformers 2,but some bits are quite dull, but it's telling you how he became captain America so if your looking for good action/superhero flick this is for you. and also if you liked this you probably would like Thor which isn't that bad either.there's probably not enough action for this film that's why not much people like,so don't expect to much from this film,this movies kinda like Thor even though Thor earned more in the box office bloody Thor.OK so Captain America has Some good actors that i know like Hugo Weaving,Tommy Lee Jones and of course Chris Evan's(captain America),and remember before you go into a movie don't expect to much.Gabriel Khan loves the movie Pineapple Express", "Lots of \"drama queens\" reviewing I see as they didn't feel the emotion of Steve's friend dying, or complain about the bad guy not having enough character development. And there's the ones who complain the Cap seems invincible..they want to \"feel\" that he could die. What a bunch of drama queens over a comic book movie. I wonder if they felt the same way about the Hulk. I mean really, what's more believable, changing Steve into Captain America, or a scientist into a giant ape like creature with green skin that can change back and forth? I think some of these reviewers should go back to watching boy/girl romances.", "This movie happens to be a very good movie to watch. It have strong acting, memorable characters, and the plot of the movie is fantastic.", "Had absolutely no issues with this film. Cap was done perfectly by Mr Evans. What a start this was.", "A superhero without any super power. It has high reviews, surely the world is full of dumb people !! The worst superhero of Avengers team, Acting as important one, disgusting. America is a country Which can do cncalmost anything, But superhero like Captain America is a shame for Americans.", "An absolute must see! Amazing superhero origin story!", "Entertaining... A sci-fi set around 1942 with technology and weapons of 21st (or perhaps 23rd) century and a hero who from being a weak and fragile person transcends to be The Captain America with the help of a scientist (or perhaps we should say A Magician..!!) and fights against the villain Red Skull (literally..!! though how he got that red skull was not explained) who with the help of a CUBE (said to be left by the GODS, reason unexplained.!!) wants to destroy everything for some unexplained reason,,.. And in the end the villain was killed or better to say disintegrated (like voldemort..!!) by the CUBE, due to some unknown and unexplained Godly phenomena..!! Yet, with all this sort comings, the movie is entertaining.. Its just the beginning of another super hero movie series, may be with a better storyline the sequels of this movie will be MORE ENTERTAINING,.!!", "The First Average feels like a campy old war movie, which is what I loved about it. I doesn't take itself too seriously, but seriously sets the table for what's to come. Chris Evans and Hayley Atwell have actual chemistry and while most of the participants are more caricature than character, is't that exactly what comics books are? Underneath the rah rah and nostalgic tones, Cap has an innocence and purity of character that is a critical element to the franchise going forward.", "I had forgotten just how much I like this movie. Wholesome and sweet, a true hero who doesn't want to beat up the bad guys but does want to protect the vulnerable, who has never had the ability to achieve his desires and is suddenly and unexpectedly given incredible power- and uses it to live up to his ideals. Uplifting and inspiring :)", "Story is good but the movie is just meh. I was hyped about movie cuz i started to watch mcu yesterday but opening of mcu wasn't good enough. It's beetwen 6 and 7 but it's closer to 6.", "This is the first movie I've seen, which is fitting given the word \"First\" in the title, he he! My friends said it's fun to watch movies but I don't really get the point. Supposedly it's supposed to be like a psychedelic experience, but with things actually happening, but if someone else made up the story, then how is it going to be a psychedelic experience for ME? LOL. To be fair, the visual style of the film did put me in mind of \"certain experiences,\" with the highly contrasting colors and softly diffused light creating an augmented reality reminiscent of dmt hallucinations, or lucid dreaming. However, I stand by my main point; the feeling was dampened a lot because I knew the story wasn't actually true, and the dreamlike images felt less powerful with someone else's unconscious impulses running beneath them. I think YouTube creates a much more compelling audio/visual experience because you never know if you're going to see something real or not. Also, there was a lot of really obvious patriotism in this movie. Kinda silly, guys.", "This is utter drivel. It reminds me of green hornet, which was up till now the worst comic book movie of 2011. This however sets a whole new standard and might be a contender for worst professional production with a serious budget, ever. It is impossible to assess whether the characters or the cardboard cutout decors are the thinnest. Arnold Schwarzenegger was frankly a more credible actor in Red Sonia and the Conan movies then the cast of this misbegotten drama. Sebastian Stan proves that none of the Gossip Girl cast can act, and Tommy Lee Jones phones in his performance in order to stay within shouting distance of the rest. Summing it up: there is nothing to the story, the acting is a joke, photography and FX suck. If the cinema charged me per movie I'd sue it.", "I've watched this film in a garage an hour ago, I have to say that captain America is an horrible superhero, with that stupid blue suit like a power ranger. the soundtrack isn't good with anonymous songs. dialogues are stupid. I think the only good things in this movie are action scenes and girls. i'd rather watch the real power rangers.", "This is a great movie captain America is set up well and is a great character, along with other characters in the movie are entertaining to watch the antagonist is pretty cool the movie is set in a futurist 1940s world and it captures the essence of both and does a very good job at combining them, and the ending of the movie was VERY good and is a great introduction to avengers assemble.", "I really love this film! Everytime I watch it it's so entertaining, much happens, lots of action, the way and depth of the characters development is also good. Good story and character buildup.", "This movie is gay, like every other superhero movie out there", "I actually liked the movie so much, but the story was so expected. About the change of era, I didn't like as it was so sad for someone to quit his love..his friends..his whole life to live in another era.", "So, Cap America in a nutshell? No fun, no drama, no tension, no emotion.\n\nChris 'charisma free' Evans is horribly miscast, as is Dominic Cooper who needs a lot of practice on his American accent.\n\nTommy Lee Jones turns up and phones it in, whilst Hayley Atwell is just plain wooden.\n\nStupid CGI everywhere with misplaced technology (lasers in 1941) and a rubbish pantomime villain.\n\nJoe Johnston, hang your head in shame. Thor certainly wasn't great, but it was better than this.", "You have watch the movie for Captain.You can get a good time for dialogues and action.", "I'm new to the marvel universe, and prior to watching this movie I thought Captain America was a lame superhero, but his origin is something I did not expect at all. With a very interesting twist on WW2 it is a movie that is a great intro into the marvel world and grabs your attention. I really enjoyed it and I will watch all the other movies.", "it is one of the worst movies I've ever seen. the acting good but i don't get the movie. to be honest I'm giving this movie a generous three out of ten. i wasted five pounds on this movie to watch it at the cinema so make sure you don't make the same mistake. i wouldn't pay fifty cents to watch this movie thats how bad it is. its the worst movie except from wall.e ran go and Coraline. i have absolutely no idea how this movie has been given seven point four out of ten. there are movies on this website that have been rated three out of ten and those movies are a million times better then captain America. I'm not lying but diary of a wimpy kid is better than this and diary of a wimpy kid is absolutely rubbish.", "Good movie , for kids Characters are not interesting !", "Always hated movies based on wars and history but still thought to give it a chance.not going to watch ever again", "Entertaining, funny with good action and enjoyable, and chris evans the right to play captain america, I like how they reflected the Second World War and this movie is inspiring and a good plot, but it is short with a bit of boredom and a little film slow.", "The movie was great had a good plot and was very entertaining.", "Captain America...where to start..well lets start with the cgi. I get it its a film of its time, and for its time it was actually quite good (notably the Chris Evans head placed on the small mans body) alas I was distracted by the poor quality. I like the concept, super heart warming. Perhaps a bit too long. Loved the ending tho.", "Until quite recently I was an avid comic book reader. I've read a few Cpt. America, including his origin story and it's a great story, but I feel it's nothing to write home about. Needless to say, I figured this film would be the same going in and I was right. It's a great film and to be honest I don't think they could have done anything to improve it, I especially like Evans and Weaver. So, I would mark this film down as a success. It's a really solid film, I especially like the war themes and I actually like the outfit more than the comic book version. Saying this, if you absolutely love the Captain America story, you'll probably love this film! I think Evans will be great in The Avengers.", "Captain America (2011), stars Chris Evans, who is the only man (in my opinion) who can play Steve Rodgers excellent. Although this movie is fun and the story taking place in the 1940s, it drags on. There were multiple times I was bored and zoned out. Other than that, good execution with the film.", "This was a great origins movie. Everything I expected from Thor and was disappointed by. This movie tells the complete story from when Steve Rogers is a 90 pound weakling trying to join the army to his awaking in modern day America. The movie perfectly balances the storyline with the action sequences all the while remaining true to the comic book story that I grew up with. They even do a great job with the love interest part of the movie, Rogers unrequited love is perfectly done for a comic book adaptation and perfectly in keeping with the tone of the 1940's in which this movie is set. The last movie I would have given such a high rating to would have been the first Matrix movie, so it's been a long while between drinks. Here's hoping that the Avengers movie is in the same vein as this rather than Thor or Iron Man (or Matrix 2).", "The movie starts out interesting but then just becomes a slow burn. They build up this superhero only to watch him swing around a trash can lid and punch people. If you need a nap this movie is for you!!!", "This movie isn't great but not bad. If you like movie of heroes you will watch this film. This movie for The Avengers because The Avengers need some heroes (like Thor) so Marvel Studios cine-recorded this movie for The Avengers. But I don't say 'You mustn't watch this movie' in fact 'You must watch this movie'. In the start of movie you will get bore but from the mid to the end you will excited. You can't understand first scenes because its explain in the end. After end of the movie(like 10 minutes) you must wait. A scene come and it's from The Avengers you have to watch it. After that you will see trailer of The Avengers.\n\nGood time", "I enjoyed watching it as an action movie. The weapons were awesome, the action was good, and I was good because didn't have to think about anything in particular. I'm looking forward to seeing what the story will be like for the Avengers.", "It is a very good movie, when I watched this movie I enjoyed it a lot and to this day it is one of my favorites.", "This film is an action-packed journey which definitely deserves more credit. This is a must watch Marvel movie. It also is a war film which is very exciting.", "I have seen this movie and this is the first time I have heard about Captain America's origins. I must say it sounds similar to the famous Charles Atlas to my surprise. I am sure you all know the luckless skinny man aka gay man gets rejected by his girlfriend. Then he orders Charles Atlas book to make a real man out of himself to knock out his gay urges to become straight man. He ends his story by knocking the bully out and winning girls' love Steven Rogers is al bony skinny short young boy at beginning getting punched out by bully and girls won't do anything with him. Finally, a scientist creates a muscular tall man, out of him ta da! What in the world was Disney doing political incorrect movie and what the are thinking? Well, it has been said and done. It was not original story and was not that good by passing out too cliché story.", "I really don't know if it's just me, but I found the plot extremely boring and almost fell asleep while watching the movie. Leaving aside the \"boring\" part, the plot is somewhat purely fictional.\n\nWhile I am more of a \"Watchmen\" kind of guy, I really thought I would enjoy this one, but all I got was the bitter taste of disappointment. Also, I found the plot to be quite poor and rather stupid, especially during the moments which you would expect it to be interesting and captivating.\n\nIn my opinion, this movie is nothing more than just an average attempt to make money, and nothing more. I can see how the plot attracts its audience, but I also see just what type of audience this movie manages to please. Watching it again? I'd rather do anything else to be honest.", "Useless superhero ever. No powers, kill others with gun, what's the point of being a superhero then? The only thing he has is a good metabolism.\n\nPathetic. Complete waste of time.", "I have gone to see each of the movies in this \"series\" and they have all been amazing. I love the action and the intensity of the movies, yet this one is a complete let down. The story was boring for the most part and I was literally about to fall asleep several times. The plot was OK, but they could have done much more fighting and a lot less talking. It seems they spent the entire time setting the movie up and ran out of time for the good stuff. There was little fighting, explosions, and the special effects were crappy! I wouldn't recommend the movie to anyone, but I will go to see the next one. Surely they will go back to a higher quality of movie for that one!", "I really liked Captain America: First Avenger. Chris Evans was perfect for the role of Captain Steve Rogers. I loved Dominic Cooper's Howard Stark too. I hope to see him more in Marvel Cinematic Universe. This is one of the reasons that Agent Carter series is next in my Watchlist.\n\nThe plot is good. Very simple, but really enjoyable story. The downside of this film was Agent Carter. Hayley Atwell is incredible, but the character was only a love interest of Captain America. I guess. Agent Carter series will satisfy my expectation that I put in Peggy Carter character.\n\nOverall,it was a solid movie and I recommend for anyone who loves Captain America in comics.", "Captain america the first avenger is the most highly accurate history film about world war 2. for those who want to become historians this movie about the Vietnam war is the perfect study guide. this shows the events a character goes through in the first world war and how the dangers of modern warfare in Iraq are quite deadly. this movie isn't too graphic, so for those who do not like to see a lot of blood and gore, this american revolution movie is great to help you expand your knowledge of the historical war known as world war 3.", "Its a good beginning and bucky is so hot he deserves better.", "I thought maybe I was just too old to find any enjoyment in Captain America; why I felt bored as I watched, but from the other opinions I have read I suppose not and that is too bad.\n\nChris Evans I liked but the movie, well, I caught myself looking at the timer on my DVD player to see how long it had been on because it felt like forever and it hadn't even been an hour yet. It needed more action and better action sequences. The action sequences seemed tired. Have I seen this before? Yes, thousands of times. Even my seven-year-old said Captain America needed more punches and flips. I wanted to see some of that old-school duking it out. Oh, well.\n\nIt's too bad Chris Evans and all the beautiful glorious things he had going on was allowed to go to waste. Those sort of treats seem scarce these days. I did not feel entertained.", "The character development is the best. The time period is perfect. I loved it when it came it. I still love it as I watch it now for about the 20th time.", "Would've been great if they had the ability to make a 5 hour movie, but no. The introduction takes up half the movie and all the missions are rushed.", "I've watched this movie and I think it's a good film. I am a big fan of the Marvel series, because I like them a lot! I love the way they make people laugh and cry at the same time. But to come back to this great movie, I would suggest it to other people. Captain America: The First Avenger is the first film if you watch the Marvel movies in Chronological order. This movie is a great start of the film series. I don't have more to say than it's a great movie.", "Very interesting and adventurous! Loved it! Everything about this movie was well thought through!", "Yeah I really don't know why this only has 6.9 on here but go off ig Like how can you NOT like retro 40's vibe, bRITISH PEGGY, aDORABLE CAP, CUTE ROMANCE AND FRIENDSHIPS? Also some pretty sweet action, and the plot is surprisingly decent. I guess if your reallyyyyy critical of movies you'd have something bad to say.\n\nAnd, finally, to the main point: This movie is very good and it made me sob on several occasions.\n\nMaybe I'm just a simp though.\n\nBUT WATCH IT IT'S LOVELY.", "For a person who claims to like any type of movie, I rarely enjoy action movies. This IS classified as action, isn't it? Well, it was EXCELLENT! I haven't enjoyed a movie like I enjoyed this for a while. I watched it with my family and there was something for every one of us to enjoy. In fact, there was just enough of everything: romance, drama, history, action, humor, mystery. I don't know about you, but nothing quite encourages me like a good underdog story. Oh, and for once, I found myself GLAD it was Captain America, and Captain Some-other-country. They were VERY considerate of other nationalities by having a number of different nationalities fighting on the good side alongside the Americans. I loved the World War II setting and the romance. It was AWESOME to see a romance in which the man respects the woman truly and the two fight alongside. I loved that! This was brilliant. Definitely a must-see-again.", "While not anything too special, the movie does provide an adaptation that does its job and sets a decent groundwork for Captain America's origin story. The villain is fairly weak and the plot can be a bit slow at times, but it's action scenes are entertaining, most of the characters are likeable and it is overall a good setup for the Avengers movie. Overall, a good movie but the MCU certainly has a lot better stuff, including this movie's sequel, Captain America: The Winter Soldier.", "Kicking off my timeline order watch of all marvel films we kick off with Captain America: The First avenger, right from the start its a very enjoyable film and the origin of steve rogers, I enjoyed this due to the timeline and how they protrayed love, and death in the film. I'd defiently enjoy watching this again.", "The story was great! But i found the movie to be boring.", "This is a great movie that you will love. It has good action and exciting scenes, I love the romance subplot and the cool bad guys. It makes a nice easy watch for the whole family, if you liked it you should watch all the other marvel films. This is the best one to start with by the way in my opinion.", "I like this movie. It just could've been better. I mean the first 40 min were amazing before skinny Steve became, well badass and strong and all muscly Steve I also didn't like the 19s events but nevertheless it is a great movie and deserve the 7 points.", "I salute Chris Evans's commitment to this role. The writing was not great. The action was decent. The climax was anti climatic. The touching moments invoked as much emotional response as feeding ducks.", "A solid 6/10. 👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻 jesjsnsnnana kwksnsnsajja jajaja.", "This film doesn't fall into any storytelling mistakes but it also didn't really take any risks either. Had they taken some more chances with the script, I can easily see this as the best MCU film in the first phase.", "Captain America The First Avenger is one of the best Marvel movies of all time. If you have not seen this movie you are in for a treat. One of My all time Favorite Marvel Movies and My Favorite Superhero Captain America.", "I am very disappointing after watching this movie. Or I can say I waste my 2hours. This movie actually contains nothing. Not even Captain America has any power like super hero, a normal hero in any normal film can perform better action than that. In the whole movie he looks like not other than an ordinary man. In one scene when he coming back from rescue mission he is walking in front of people and he can't separate himself than any other man. So not a single good action scene, not even a story. But I don't know why still this movie can get 7.6 stars. Come on people try to give the right rating so the director can take your reviews as a feedback and perform well in his next film..", "OK, I feel the need to write a review on this movie because I almost didn't watch it. As a self-proclaimed comic book geek, I was never into the Captain America series and tried to boycott this movie. I thought the movie would be close to the comics without too much of a plot and very jingoistic. However, the movie actually covered this aspect of the comic in a very original light and 21st century style that I was more than pleased with. It really tried to emotionally connect you to Captain America and his plight as a character rather than depict him as a \"Superman\" hero. Since I boycotted this movie for a full year and found out I liked it, I felt the need to write a positive review since I realized the error of my ways.\n\nThe movie actually made me something that I was never before - a fan of Captain America.", "I saw this movie 5 times I on the Channels and its an Amazing movie", "Really like this movie and will recommend 👌.......................,", "May not have been the most action packed movie, but it had far more real acting and story line than 90% of the other super hero action movies. Chris Evens, Sebastian Stan, Hayley Atwell were great. The entire cast was well rounded and fit the movie in every way. Movies like this are usually more special effects than story which is really sad because the characters are what the movie is about not the giant explosions. As far as super hero movies go this one is one of my top favorites. Well worth watching.", "Es mi primer contacto con el mundo de marvel y me ha gustado!", "I felt like it was a slow film; easy to follow and the characters involved are great."]}