{"reviews": ["It wasn't that bad of a movie, but undoubtedly it had a few flaws in terms of screenplay. The story itself was fine, and I'm personally a big fan of Captain America's origin story so this movie was a nice watch for me. Maybe not so much if you don't care at all about superheroes such as CA.", "At the time it came out, this was my favorite MCU film. I don't know how this one could've been done much better.\n\nThe casting is perfect!! Evans was obviously the choice to portray Steve Rogers. I will forever keep Hayley Atwell in that red dress as a fond memory. Weaving as Red Skull? No brainer. No one else could've done it as much justice. Stan, Jones, Tucci, and the rest of the cast of characters bring the story together.", "An excellent movie that I very much enjoyed watching, not the best Marvel movie, but it's one of the best. The villain of the movie was not up to the standards. He could have been better than the one that appeared from the movie. I'm surprised that the movie is considered one of the most hated Marvel movies.", "During World War II, Steve Rogers, a frail man, is transformed into the super-soldier Captain America and must stop the Red Skull from using the Tesseract as an energy source for world domination. There is a plenty of good performances and pulpy action sequences. The movie has a very good CGI and a beautiful origin story. Captain America The First Avenger is an entertaining ride that doesn't take any significant and creative risks.\n\nRating: 7,3.", "This movie excels in every way a superhero movie should be. Lots of action, some humor, a love scene or two, and lots of thrills and chills. Chris Evans plays with gusto performance as Captain America/Nick Rogers, a skinny man who with the power of something that's like steroids becomes a super soldier intent on defeating the Nazis and Red Skull, played by Hugo Weaving. The British actress who plays Cap's girlfriend is hot. I'd choose her over Mila Kunis night and day. The effects are good, and the attention given to the movie from the comic book is well done. Stay after the credits for the Avengers trailer. It's worth the $10. Stay away from the 3d version.", "People suck, that's the only reason this movie is rated to low! I love this movie!", "Captain my captain; you have come into your own as a movie. MAN I loved this film; it was a perfect example of what a superhero film should be. It made the best of humor and action and told us a story of how a scrawny kid from Brooklyn with a huge heart made a difference in World War II. This movie is one complete origin film that makes a huge springboard for next summer's The Avengers. The people at Marvel have an excellent crew of film makers who understand that humor, action, drama and excellent story telling are key points in film making. This movie gets a green light from me and is a great action ride that is a 'do again' just to let the movie wash over you. I am going to go see it again because it's a movie that looks good on the big screen.\n\nTo see more of this review go to fatsamuraireviews.blogspot.com", "Best Marvel film so far. Thank you Joe Johnston. Love story also beautiful and best!", "This is one of the Best Marvel Movies I have ever seen, you have to go back and watch this Movie.\n\nIt's the Best Origin Story of all of the Marvel Characters so far in my Opinion.", "Brilliant movie from start to finish. Captain America is my favourite character in MCU and Chris Evans portrays everything that is good in captain America really well. Real good story and with CA and Buckie being a massive part all the way through this reall was done well."]}