{
    "reviews": [
        "Every month i watch this movie and i laugh a lot. This is the one. No movie cant beat this awesome comic movie",
        "When you feel low watch this is film is in League with hera pheri.",
        "Actors have done a great job to justify their characters in the movie and the movie is still too funny",
        "Very funny!!!! When I find my self in find myself in times of trouble DHOL comes to me speaking words of wisdom. Very awesome all dialogs of RajPal Yadav's dialogs are awesome!!! Get the DVD it is awesome very funny. The surnames seen is one of the funniest scenes of the movie the acting of the four is very good. In 2007, when I first saw it I was kicked out of the theater right after the surname scene then I went for another show and the next half was also awesome and then they add a bit of suspense to it. Very good movie! Must watch. The DVD now is very rare and is very weird if you see it. Many many funny scenes in it but it comes very often on TV, frequently",
        "Extremely hilarious, do watch if you understand hindi.",
        "Top class comedy .This made me laugh so much ...and also acting of all the actors is superb .. Must watch. Definitely go and watch this .. This is so good.",
        "I Watch movie at 8to 9 times..very funny .deserve 10 out 10 stars.",
        "After 'films' like 'Hulchul', 'Garam Masala', 'Bhagam Bhag', 'Bhool Bulaiyaa' and whatever crap, director Priyadarshan has gained the reputation of being one of the worst directors today. 'Dhol' only further confirms that spot. I got to watch this piece of litter when I was visiting my parents.\n\n'Dhol' too features some of the worst actors (e.g. Tanushree Dutta, Rasika Joshi, Tushar Kapoor etc). There is no story. Direction is ...well, there is no direction. All the performances are of abysmal quality. Rajpal Yadav is the only one who's remotely funny but I'd advise his fans to watch something else, well, pretty much anything else. The songs are better forgotten except Payal Rohatgi's item number which is pleasant to the ears. This is one tacky film that should be seriously avoided.",
        "Simply Awesome. Fun from start to finish. Appropriate to watch with family.",
        "Their acting is superb. Storyline also good but it should be more comedy.",
        "Such an amazing movie. It's s complete entertainer. Even after 15 years, I love to watch this gem on weekends. Every character has ultimate comic timing and the songs are good too. A must watch!",
        "Saw the trailers and was very excited and had very high hopes from the movie. But alas it doesn't stand up to its previews. A story about 4 boys and how they chase a rich gal and get entangled in unexpected mess. It hardly manages to evoke any laughter, save for a few moments. Sharman Joshi is good in this movie, actually the only saving grace. Kunal, Rajpal and Tusshar are not so good, Tanushree (for whom i have always had hots) is good looker, but so bad in acting that she can give Aishwarya's acting skills a run for money. Apart from the title song, no other song worth mentionable but kudos to the director for not using too many songs so that we could get away with the ordeal soon. All in all, watch it when you have no other choice and make sure you have lots of friends so that you won't be the only one to suffer through it.",
        "I mean just thinking that people are calling rajpal yadav cringe are surly the one in love with varun Dhawan's work. There is no way you can have big Lebowski expectation from a movie like this. Its like watching step brother or hangover but less adult content but not the fun. Seriously dude it's shocking that people haven't watched this movie.",
        "No comedy movie is close to dhol, loved it.\n\nEnding is not that great as expected, still the scenes are amazing, can't stop laughing."
    ]
}