{
    "reviews": [
        "I usually don't watch action films. They just aren't my sort of thing. However, my daughter insisted that I watch \"Pacific Rim\" and I was feeling absolutely horrible when I watched the film, as I had just gone through some painful surgery that morning. So, to take my mind off my aches, I gave it a try. And, thankfully, it turned out to be exactly the sort of tonic I needed--entertaining and crazy fun. While I didn't see it in the theater (the best way to see this type of movie), I did see it on a very large screen at home and watching it on a small screen is practically a waste of time. For once, I loved that a film has eye- popping visuals, explosions and action--and it manages to deliver an entertaining experience without leaving you feeling dumb for having enjoyed it--a problem too often associated with movie of this style. Well worth your time.",
        "This is one of my all time favourite movies. This is a must watch for all age groups. But only this first Pacific Rim, not the second one.",
        "Sometimes when I sit down and watch a movie I just want to be swept away and be dazzled with both sight and sound. The movies don't have to be dramatically perfect just capable of blowing all my sensors.\n\nBattleship and Pacific Rim are 2 of those movies.\n\nPacific Rim takes a cool concept for a story, Monsters vs Machines and entwines a human element (the pilots) to result in a really fun extravaganza. The movie is not deep but has enough story to piece together the fighting sequences.\n\nSit down, hit the lights, pump the volume, disengage brain and have a blast :)",
        "This big budget science-fiction takes place in the near future. Large and destructive alien creatures have emerged from the Pacific Ocean. In defense, large robotic machines are used to fight the enemies.\n\nThe film begins well with some interesting scenes mainly due to the special effects. Some elements of the story are interesting as well but the film seems to go downhill by the second half.\n\nEven the special effects are hard to follow at this point. The characterization is weak and the atmosphere is cold and dark. With a predictable outcome throughout, this film is quite disappointing. - dbamateurcritic",
        "A trans-world rip at the bottom of the Pacific Ocean has allowed monsters, named Kaiju, to come into our world. After tremendous losses, the world got together to build massive robots called Jaegers. However, the monsters keep coming, faster and bigger. Now the Jaegers are stretched to the limit with resources being diverted to building a wall.\n\nDirector Guillermo del Toro is having a lot of boyhood fun with robots battling monsters. It doesn't get more childhood fun than this. The designs are beautiful and original with both the robots and monsters. There is nothing more youth affirming than playing with these toys. The characters are solid with interesting actors like Charlie Hunnam and Idris Elba. Coming into this, I feared the story would be too silly or convoluted. The story makes perfect sense and the action cannot be beat.",
        "C'mon! This is a good monster movie with great cast and visuals. A fusion of east and west.And please, please put Charlie Day in more movies! I want to see him in a Marvel project for example!",
        "this movie really rocks and keeps u occupied for 02 hours . Stunning visuals , giant robots look really giant .\n\nThe Very feel of a giant robot walking is super cool . Idres Alba stands out in film. his looks and dialogs were excellent. The best part is in middle of film having emotional feelings and don't want to spoil it.\n\nit is a true cinematic experience especially in 3d .and to watch it in home TV screens will be disgrace to this movie.\n\nHope the Sequel or Warner Bros next projects show much more improvement.really anxious to watch movies like these in future",
        "The film should at least be an overall 8 like this film is amazing its full of action its beautiful and its got a sad but yet happy ending and great acting",
        "Pacific Rim is a movie for people who get distracted by shiny objects.\n\nThere is no plot, no suspense, no drama, no humour, no attempt at characterisation . All there is, is a big pile of CGI and a script that looks like it was written by a four year old.\n\nThere is LOTS of cgi. Its not very good CGI and it completely fails to disguise the fact that the movie is idiotic and lazy, with nothing to offer anyone except the completely undiscerning viewer. The film even has much of the action taking place in poorly lit environments to attempt to describe the lameness of the effects.\n\nThe actors do their best, but even Idris Elba, whose work I normally enjoy, is completely wasted in this trash.",
        "I was surprised that this movie didn't do well at the Box Office. Not only because it is done by Del Toro, but mainly because it is really good. And it seems people like it generally too (see rating here on IMDb, currently ranking at 7.6). So why didn't it perform? Tough to say, but seems like people didn't want to watch it at that time, so maybe the release date was off.\n\nYou can't tell with those things though, so I'm pretty sure this will do much better once it hits the video stores/markets and sells/rents like crazy. The movie deserves that. And not because it is a great movie, but because it is very entertaining. Predictable and filled with clichés, Idris Elbas performance alone is worth the money! Sit back, relax and enjoy the show",
        "Pacific Rim is an incredibly fun monster movie that's epic and action packed. Charlie Hunnam, Idris Elba and Rinko Kikuchi are all great although the other Jaeger pilots could have used more depth. Ron Perlman, Charlie Day and Burn Gorman are all really good. The CG is excellent throughout. Guillermo Del Toro's direction is incredible and it's extremely well filmed. It's well paced and the music by Ramin Djawadi is amazing.",
        "Unlike some, I had no problem with the high concept of the piece: Transformers vs Godzilla. It had a lot of potential. And when the movie concentrates on what we are all here to see (giant creatures and robots beating on each others with oil tankers and smashing through skyscrapers) it is very successful. But when things get quiet... less so. Too much time spent on \"Top Gun\" like fighter pilot shenanigans. Not enough nuance in the characterizations. An ultra linear plot with few attempts to confound expectations. The acting isn't bad - and isn't required to be great in this sort of film - but it is nothing special either. Sort of universally \"meh\". Good for a Blu Ray rental.",
        "As a war between humankind and monstrous sea creatures wages on, a former pilot and a trainee are paired up to drive a seemingly obsolete special weapon in a desperate effort to save the world from the apocalypse.\n\nI resisted seeing this film for a while... I was under the impression it was going to be a lot of CGI robots and monsters bashing each other, which I really have no interest in. There is still some of that, but director Guillermo Del Toro made sure that things went a bit deeper than that, with some decent human characters.\n\nReally, the casting is to be praised. Del Toro regular Ron Perlman plays one of his best characters yet, and the choice of Charlie Day as a scientist was brilliant. I wasn't sure if he'd be the right sort of person for the story, but he was beyond perfect... that Charlie humor we love, with just a twinge of madness.",
        "Pretty darn entertaining movie, lots of monster fights and decent enough conversations inbetween. Try to see it in 3D , looks great and was clearly designed to heavily show off 3d.",
        "Lately movies that claim to be monsters and action have proved a complete failure, and, to be honest I thought this was not going to be the exception.\n\nAny change to see a real action movie with almost unstoppable battles monsters, and a dose of special effects so amazing you just leave you with your mouth open.\n\nOf course, not everything is good, but entertaining plot is somewhat similar to that of other films: The hero gets a big pain that leaves the battle, then when the world needs the triumphant return finds the love of his life between the two due to the bad, the nearly died, and finally live happily ever after (like a soap opera).\n\nWe must clarify that thanks to special effects, battles, and good performances, the plot is not uncomfortable. I really think it's worth watching.",
        "For the first time in many, many years with this movie I was taken away from the problems in my life and went to a place where those things didn't register anymore. It was almost magical. I had to keep reminding myself about the bad things in real life, but then a new robot vs monster battle happened and all the sudden that didn't matter any more. Total escapism done with excellent design attention and detail. Thank you GDT. You have to be an artist and a science fiction geek to appreciate this. I came out of the movie and realized all my problems were still there but I was also hearing the theme music in my head. Got the DVD now and I escape that way. Channel your inner six year old, lean back and enjoy.",
        "I'm not going to give any summary of the plot line, as much of it is derivative from enough films we've all seen before. The dialogue is simplistic, the acting cast little better but it's a CGI-fest.\n\nDon't go into this film thinking you are going to find any new great gem. It's part-Godzilla, part-Avatar, part-Independence Day and so on. It looks good, but there's hardly any good story. I was mostly bored.\n\nSome are going to like this a lot, as evidenced by the surprisingly positive reviews from the professional critics. Many others will just find it to be a passable action sci-fi thrill. I've seen much better elsewhere, and think you will have too. Up to you.",
        "This was everything that a summer action film should be. Stunning graphics, a unique story line, solid plot, solid acting (though this was likely the weak point) and a very well paced movie. I found myself in sheer awe of many of the CGI scenes. They were really, really well done. Stunning in fact.\n\nThis movie could have actually been a 9 or 10 with better acting and tweaks to the script. That said, this was an absolutely entertaining film that is sure to be added to my personal video library. It will be a great \"demo Blu Ray\" for any home theater enthusiast.\n\nBTW, Idris Elba was the stand out of the actors. He did an excellent job. A couple of the others were also solid, but no one rose t Idris' level. Had they hired better actors, this could have been even better.",
        "Yeah, most idiotic movie EVER! They create those ultra high-tech gigantic robots, and all they do is box-matching the enemy (the green dinosaur- like creatures)? What is this: Mike Tyson versus the evil lizards? It's absolutely insulting! No gamma-rays, no ultrasonic weapons, no lasers, no satellites, no stealth planes, no Apache helicopters, no secret weapons, no flying saucers, no nothing!!! Who made this \"movie\", a three-year old with a mental condition? Imagine Star Trek in the Stone Age, that's what this movie really is. SF movie means is science-fiction. But there is no science in this one. Just lots of punching. I'm sure that boxing fans will greatly enjoy this installment.",
        "Before watching PACIFIC RIM I noticed it had a lot of critics really hammered down on it and truth be told it really wasn't that bad. Then again I stopped listening to critics a long time ago. Although many would agree it could be somewhat overblown with special effects but it did have a decent plot. The acting wasn't the best but also not the worst. All the effects were very nicely done and the fight sequences were very engaging partly because the film established what was at stake before them.\n\nAll in all, PACIFIC RIM isn't as bad as critics say it is in fact I think they might have been too harsh. The best way to see PACIFIC RIM is probably without expecting to much and to judge for yourself if you like it or not. For me it was good and better than expected and I would recommend it as a better alternative to a lot of other films out there.",
        "Totally loved it. An awesome film with STUNNING visuals. Seeing those giant robots walking in the sea alone is worth ticket's price. Del Toro's passion and perfection speaks for itself. Not in a single place you find the CGI or visuals lacking. CGI is so damn perfect which isn't a small feat given that it's a film about giant robots fighting giant monsters. And man do these robots look beautiful and awesome? Like a piece of art. And they are done so perfectly, each and every movement, every little detail, has been given attention. These giant robots really put all what we have seen in Transformers to shame. The action scenes are jaw-dropping and are so brilliantly choreographed, without ever going over the top. It's a pity that this film couldn't do well on box office while every other crap coming out every day makes tons and tons of money. I sincerely hope Del Toro gets to make a sequel.",
        "I didn't have any expectations going into this and also didn't have much knowledge about it aside from Del Toro being the director. In a short description- it was excellent! A ton of fun, great characters, amazing visual effects, a story that doesn't fall under clichés. That's basically it in a nutshell, and the actual story stands-out from all of these seemingly formulaic and predictable blockbusters. I was hesitant about Charlie Hunman (although I remember him from Undeclared, much skinnier back then though) but he was a pretty great leading man and I have high hopes for his future. Del Toro nailed it with this, and hope he continues to give us more mainstream-fare.",
        "Well that was two hours of my life which I will not recover. Fortunately I did not pay to see this absurd oeuvre, but borrowed the DVD from the local library. But this is what kids now spend their allowance on??\n\nToo many things to comment on, but among them are: how can only 8 helicopters lift one of these robots, when they weigh 2500 tons? Why don't the kaiju's attack en masse, rather than just one or two at a time? Why can't the robots be controlled remotely, rather than risking the lives of 'pilots'? Why not simply shoot a missile (using all those helicopters) down the kaiju's throat when it inevitably opens up to make a loud roar?",
        "The similarities between Pacific Rim and Sharknado go far beyond their lithe, telegenic screenplays and nuanced character-driven plots. Practically Shakespearean in their world-views and intricate family dynamics, both movies will keep you on the edge of your seat as plot twists have you guessing right up until the end on the big \"who done it\" question. Oh certainly, first-rate special effects added to well-crafted acting with so many layers of emotional depth you'd think its respective sea creatures were pipe-lined straight from Citizen Kane, or perhaps The Godfather, or maybe a bit of both. Really, who's to say which picture will garner the most Golden Globes or Academy Awards this year. My bet's on ILM's splendorous work in Pacific Rim although I've got to say Sharknado's sharks really projected tremendous amounts of fear-inducing horror that weren't quite the equal of the more anime-inflected denizens of Pacific Rim. I suggest you see both films in a double feature and decide for yourself.",
        "I had more fun when I was 3 years old sitting in my bathtub playing with plastic submarines. I think I would have had more fun today too, doing just that.\n\nProducers need to spend more money on the WRITING of a movie than the Computer graphics. In the 1980's movies were better because it was all in the writing, and there wasn't much computer editing. The writing was more important than the Acting, also.\n\nIf there's a movie you don't like, it's mainly because of bad writing, I don't care how much computer graphics is spent on it, it will be lousy, like this movie!!",
        "Just terrible. Really, truthfully, I promise you – terrible. I had to consider if 1/10 was too harsh but thinking the film through i genuinely can't justify giving it a 2! We know that special effects exist and they can pretty much do anything these days – so, big deal. (I didn't even think they were that special to be honest)\n\nI was squirming in my seat, anxious – waiting for it to end (it wasn't a quick death either, I can tell you).\n\nThis is a B-movie in 2 years. We'll be poking it with a stick and laughing at it.\n\nIn summary – run for the hills.",
        "I'm really surprised that Del Toro created this garbage. Average story, monsters that looked like they were stolen (oh sorry, 'homaged') from the 1960's Gamera movies (especially the Knife nosed monsters), the only good thing I can say about this is it was slightly better than the last fifteen Transformers movies - all of which seemed to be the same movie. (That's sarcasm kids). A waste of a good cast, spouting platitudes that have been said in too many other movies. The 'action' scenes mostly at night or in the rain, were dull and unimaginative. Finally the final scene was a rip off of Independence Day. If I never see this again, it will be too soon.",
        "The current note 7,1 for Pacific Rim on IMDb.com is another example that new generations are writing the history of cinema or at least the reviews.\n\nOn the positive note, the effects are superior and there are some reference to Godzilla and H.P.Lovecraft.\n\nOn the other hand, there is nothing memorable about the plot apart from several CGI sequences. But even they were interesting only if you're into special effects. All members of the crew offer sub-par performance. At times it seemed as if some of them weren't even trying to act but rather spout the lines in front of the camera.",
        "This movie had some great fight scenes and really well done cg! Can't wait for the 3rd one in the series!",
        "I really loved Charlie in Green street hooligans. His charisma influenced the attention on the screen every time he was on. IMHO better than wood, but this one... he wasn't good. He can't play relentless hero. It's just not him. This movie has some great effects and decent back story, but he can't (at least for now), play the main roles similar to these ones. Loved Charlie Day and Ron Perlman (but I like them in every movie), though they seem too out of place. If this movie was shot in \"Batman\" style, it would have been much better. Never the less, it still worth to watch. At least once. Del toro can create spectacular scenes, but at least in this case, not a good actors choice.",
        "... And that's pretty much it. In the first minutes of the movie the whole story is so quickly summed up that it makes you wonder if it was something the editor felt he should throw in a couple of hours before the first screening. And then there's little left of a story to tell after that, so the easy solution is, of course, a lengthy bombardment of intense monster-mash- robot-high-tech extravaganza. In addition to this, it doesn't really have much potential to be a movie that you remember for being very distinct (giant monsters trying to destroy the world, mankind desperately defending itself, etc). And as for what the characters goes, You hardly remember them by the time the credits are done. There's no time to bond with them in any way between all the fighting scenes. If you can't really bring yourself to care about whether the monsters or the humans win in the end, you know something has gone wrong. Pacific Rim has fallen into the CG-trap, emphasizing visuals and forgetting about the story. Someone are sure to be blown away by all this, if they are into that sort of movies. I for one, was not.",
        "This movie is one of the best I have seen in a long time. Everything I can think of is incredible in this movie. From the incredible CGI effects to even the awesome soundtrack this movie does no wrong. The only negative thing about the movie is the length, but with the amount of information and depth they put into the movie, one is amazed by how short the movie is compared to what it could be. Not once did I look at my watch and think \"When will this be over?\", like I do with most movies over 2 hours long. The fight scenes are very well done in this movie. You expect a fight scene between a 250 foot robot and a 300 foot monster to be cheesy and in your face but they aren't. All of the technology is explained very well and the camera angles are ones that allow you to see everything going on. I highly recommend that everyone on this site go see this movie now. Between the incredible visuals and the intense soundtrack you will almost be wishing this plot was real so you can hop in a Jaeger and kick some Kaiju ass.",
        "This is what all action movies should aspire to be. From the first 5 minutes of the movie you can understand and comprehend the world the movie presents and inmediatly caughts your attention and never lets you go. The story is very simple but the actors, especially the supporting cast, are giving everything they got to the point I can actually remembera lot of them after months without watching the movie. The fight scenes are the highlights of the film, it has only a few, like 3 I think, but these fights are some of the best out there, making you feel excited at all time. The CGI hasn't aged a bit and even stands strong despite being almost a decade old and even looks better than a lot of movies today. This movie is really a banger from minute 1 to the end and I really wish, Guillermo had directed the sequel.",
        "A visual treat, I must say and a fairly good movie. Seriously I expected something bigger from the director who made me believe that fairy tales could be serious in Pan's Labyrinth. The movie certainly is bigger technically but falls behind novelty. Everybody has known transformers, battleship etc.., and not again with this combats. I've seen these animated combats way before in 1998 when I played metal fatigue game. Actors did a fair job sailing along the script and I disagree with the other reviewer who was telling that actors were bad. The first 10 minutes was excellent and I felt like 'm gonna see something like District 9 but the movie lost pace in the middle and got highly predictable (something like a lunch with a good soup and a bad main course). The bottom line is that the movie is visually appealing with nicely written dialogs to match but falls behind any new essence.",
        "Bad... Very bad. Bad Acting, Bad Story, even the CGI effects which you would expect to be good seemed to consist of mainly badly modeled robots splashing about in a sea of Gray and blocks of concrete or cars flying about. I am guessing the effects were made to emphasize the 3D experience, unfortunately it only emphasized how bad it all was.\n\nAs this is a mainly CGI driven film I have to compare the cgi with things like the transformer films which although not great films in their own right were nowhere near as bad as this turkey.\n\nI should point out I am an utter scifi/cgi fan but I watched the whole thing hoping that things would get better but they didn't, and sorry to say but this over hyped film really disappointed.",
        "The best film I've seen about giants robots. The fights, violence, sounds and feeling about the weight of the Jaegers it's incredible, Del Toro is an hell of director! I've loved the fact that the film it's not just about giants robots and monsters but even the plot it's great!\n\nAnother thing incredible about the film it's the CGI, this movie seems from 2030, it's insane!\n\nIt takes some inspirations in Evangelion, so if you love the anime you must see it.",
        "I can recite the lines in the trailer; that's how much I looked forward to this movie. But I fell asleep while watching it, literally. So disappointed. The comments made by people around me always start with \"horrible story\" and end up with \"perfect special effects though\". Truth to be told, I can totally foresee that, for nearly all action movies follow this trend. But I was wrong. There is no single twist surprising and the actress really can't act! What's wrong with her face?! She does not know how to smile, does she? Then the robots. Come on. These huge machines are unable to leave deep impression on audience. The fighting scenes are of great chaos-sea water, buildings, robots and monsters mix with each other so that I could only tell that something is moving in the screen. The finale eventually adds the last awful stroke. The only thing of this movie worth keeping is the theme song, boosting work efficiency.",
        "Guillermo del Toro is an incredibly talented director and has always (until now) made interesting, intelligent films. Why he would stoop to a CGI loaded character-less film like this is beyond me. Are we sure this wasn't made by Michael Bay? I was excited to see \"Pacific Rim\" and had hope at the beginning but after about 30 minutes or so, I was bored. With poorly developed characters, this is nothing but a movie cartoon. Now that is probably fine for many movie goers and if that's what you like, fine! I like substance, a well scripted movie that gets you completely involved. That is not this film. Another issue is why do these type of films have to be so long? They are always well over two hours which can seem much longer if you are uninvolved.\n\nI don't understand the mostly high scores and positive critical reviews. Does this mean we expect that much less from our blockbusters? CGI alone does not a picture make!",
        "I absolutely love this movie. Ive watched it over 5 times. Love the action, the actors, storyline and pace. Only thing that ruined it was the sequel. You won't regret watching this movie, it had me gripped right from the start. The cgi and editing for this was very smooth too. I don't wanna spoil anything so just watch it. It will be fun especially for slightly younger audiences.",
        "Decided to go see after reading so many user reviews of 8, 9 and 10. Absolutely love movies in this genre as well other movies that Del Toro has directed (e.g. Pan's Labyrinth, the Devils Backbone, Hellboy) I was expecting to be blown away - and yet, at one point during movie husband and I contemplated leaving. I don't understand how so much money can be spent and effort not made to create coherent script with believable characters. I can accept campiness if its done well - but the two scientists for example were just ridiculous.\n\nThe amazing visual effects were what kept us in the theater - but just barley. Could clearly see Del Toro's mastery in the creation of the aliens and Jaegers.",
        "I really enjoyed this movie. If your looking for an intelligent watch with well developed characters and plot, I would NOT recommend this. However, if your looking for more of a mindless WAM-BAM-BOOM kind of movie, filled with gigantic war machines and terrifying monsters, then hey, this is one for you!",
        "This movie showcased probably the most awe-inspiring, realistic Mecca special effects I have ever seen. Utterly amazing.\n\nUnfortunately, they have also succeeded in making the movie boring, boring, boring. They somehow managed to stuff into this movie pretty much every single Hollywood cliché, character stereotype, utter predictability, unfunny comedy relief, and UN-heart-felt emotion. Despite the stunningly realistic special effects, this movie felt completely fake. Perhaps, many viewers can tolerate fake movies as long as there is compelling suspense and drive to hold one's interest. I am sad to say, this movie presented near zero suspense or drive. It's actually a mystery how the makers of this movie managed to kill off all fun and excitement given the awesome effects available to them. Couple that with the lack of a single compelling character, we have a movie that should have been so much more...",
        "Warning- DO NOT under any circumstances, pay any extra money for this movie. Not 7 dollars, not 3 dollars, not 1 dollar. But if it is free on demand, then you can pay for it. This movie is an absolute waste of good film stock that the producers made in order to \"make their nut\".\n\nThere is no plot, no character development, no story and no rhyme or reason to it. The character which the black actor, Ilba plays, commander or the flight squadron, comes across as a handicapped idiot. The main 2 characters,Raleigh Becket and Mako Mori, appear to be in high school the way they relate to each other. I wouldn't even think this movie would be good for a fourth grader to watch. After all most fourth graders liked Star Wars, a movie which this film is far, far below. Maybe a first grader could watch this movie and take some benefit out of it.",
        "I don't want to write much more but you did it excellent, for a Kaiju and giant robot fan. Thank you very much. One of the best movies I know, besides Godzilla, King of Monsters but Pacific Rim is better. Just to say this. Looking forward to more of you!",
        "It has a good score here on IMDb, but again it proved to be highly overrated. I gave it a 5 because it would have been much better, and contains no serious logical mistakes. It looks like the creators wanted some easy money, so they mixed everything together: robots, some fightings, aliens, etc... But. The story is poorly written, and basically follows a well known, and unbelievingly boring, and predictable path. No surprises at all. It's like nowadays no one really cares to write a good and exciting story, they concentrate only on the CGI effects, and they think the rest is not important. They copy-paste it from other movies and that's it. Apparently it looks working, sadly...",
        "I was lucky to catch an advance screening of Pacific Rim & I went into Pacific Rim excited, ready to see Giant Robots take on 3000 ton monsters & left completely satisfied. This movie turned out better than I expected, Pacific Rim is the best summer movie so far. The action delivers, whenever there's a kaiju/Jaeger fight scene you wont be able to take your eye's off the screen. Great visuals. Good plot. Solid acting. The character development is fair. Pacific Rim is overall a fun/good time movie that will bring out the inner 9 year in ya. If you're going into Pacific Rim expecting an Oscar worthy performance & plot, well sorry... Guillermo del Toro hit it out of the park with Pacific Rim & as I mentioned the visuals are great so definitely give this one a look at in 3D & if there's an iMAX near your area GO FOR IT! P.S stay for the after credits.",
        "Are there lots of explosions ? - Yes Is it bright and colorful ? - Yes Is there a story ? - No Is there any character development ? - No Is it interesting ? - No Is it innovative ? - No Is there an interesting message ? - No Has it all been done before ? - Yes , every little bit, just never all thrown onto the screen quite like an upchucked multi coloured ice cream like this sickening little money waster was Of course it will all be outdone soon on the effects front and there isn't one iota of an idea or image that will be remembered from this pile of overblown Hollywood tripe I managed to watch it all the way through in a state of shock ... Its not that it doesn't keep you looking ... Its just that it wastes the eyes ... And your left just thinking WTF have I just sat through STINKY VACUOUS NONSENSE",
        "I have to confess that I was bowled over by Pan's Labyrinth, so was looking forward to Guillermo del Toro's latest film.\n\nOverall the film was very disappointing. I have seen another review that raves about the film being exciting from the start to the end. I can kind of see where the reviewer is coming from as the film is pretty much action all the way through. The downside to that though is that there is very little in terms of character development. The characters and plot play second fiddle to the action. You really don't care who lives and who dies because you have no insight or feeling towards any of the characters. This film is very much for the adrenalin junkies and if that's you you'll love it.",
        "After seen, Man of Steel and Evil Dead (remake) I didn't thought that a movie could even get to the toe of them. But wend I saw Pacific Rim yesterday I knew I saw wrong.\n\nPacific Rim is the best movie I have seen this year is action, the story is great the fighting scenes are mind blowing. The Monsters and robot looks are great.\n\nThe direction , music, editing all was right and perfect. The acting was great.\n\nI really can think of anything I didn't like about it if one of the those films that are meant to be seen.\n\n100/100",
        "If you want to save some money, go and rent any of the Transformers films directed by Michael Bay, because this film is a complete rip-off of that particular franchise. Guillermo Del Toro should stick to doing something else! None of the actors in this film are recognizable. I don't know what all the hype is about. But if you want to throw your money away, you would be better off throwing it into the trash can at the theater.\n\nHonestly, as bad as this film is, it should have been a direct to DVD feature. Nothing special here! I would rather watch Adam Sandler's new film, \"Grown Ups 2\" and hear the same old jokes I heard in the first one.",
        "Story?Did you call it a story?I think it is just an excuse for marvelous giant robots vs giant monsters battles.Pacific Rim isn't really telling a story,however,it's realizing our childhood dreams.When the Japanese monster movies were hot,many kids must had dreamed of giant monsters.Due to the limit of technology in the 90's,monsters were no more than plastic toys destroying model cities with dumb movements.But I remember that my childhood friends and I talked about monster movies each time we played together and the fun pretending to be monsters smashing things and got punished for that.I guess boys have inborn interests in monsters. After seeing Pacific Rim,I couldn't help crying. Isn't it what we dreamed of when we were kids?Giant monsters smashing a city to rubble,giant robots punching monsters with a fist bigger than a bus and hero saving the world again.All in one,all in almost realistic CG which gave me an illusion that monsters were alive and kicking. Pacific Rim is the best monster movies I've ever seen.Please support the movie or monster movies will extinct.",
        "One of those movies that I call made on auto-pilot: everything, from the characters to the unfolding of the plot is pretty standard (stereotyped) and produced a zillion times the same before. Yes, the effects are pretty and there is some good ol' action going on, but the rest of it feels just pretty awful, in short: Guillermo del Toro on the trail of Roland Emmerich. My verdict: boring with the exception of the action scenes. My solution: I wouldn't make a directors cut but an action cut - cut all those boring filler scenes, and put everything that got some explosions and gunfire going on together to a non-stop Pacific Rim action pack together - it would be a way better and more honest movie.",
        "Pacific Rim is a well pasted film with great action, with alright human characters, I can't even remember any of the characters names. Idris Elba and the scientist characters are easily the best human characters in the movie, but even with okay human characters the action makes up for it. The Yeager v Kaiju action is easily the best part of the film, you can feel the weight of the Yeager's movements when it's fighting a Kaiju or just walking. Overall it's a must watch for mecha anime fans, monster movie fans and action movie fans.",
        "If you don't like these two things then skip it, other end of the spectrum buckle in and get ready to want to be in a Jager and destroy monsters. It's fun it's serious and it's seriously badass",
        "I heard the director talk about this film, which is why I am writing this review. He seemed to think he was making a story of valiant underdogs struggling against the odds. I can suspend disbelief and enjoy a movie fantasy as well as the next guy, but even for mindless entertainment, this is mindless. A hundred million dollars buys a lot of computer generated imagery, but that seems to be all it bought. The dialogue is just plain dire, a string of clichés, including the required \"noooooo!\". The acting is wooden, but with a script like this you can't expect much else. I just don't get how you can be given so much money for a project and produce something with so little impact. Hollywood has got to get past its green screens and start writing some stories to go with all the CGI.",
        "Big giant robots punching big giant aliens in the face. Even with this puerile premise you'd think with the millions of dollars at Del Toro's disposal, he could've come up with something better than this mental diarrhea. With every cliché in the book, combined with every Del Toro cliché in the book, it's not only a crap-fest plot-wise, it's also visually awful. In one frame everyone's bathed in blue light. Next it's yellow, then it's red. As if it was not only written by an 8-year old, but filmed by one too. There's inappropriate steampunk sets, all of Del Toro's favourite 'actors' doing their best wood impressions and so many bad computer graphics you can virtually see the mouse pointer hovering over the screen. There is nothing in this film to recommend it. How it's garnered a score above 7 is beyond me. I guess Hollywood's squeezing out so many turds at the moment, audiences are just getting used to the taste.",
        "Pacific Rim: Science fiction for Smurfs or something. Ridiculous, boring, trite, with silly writing. It was like watching 'Rockem Sockem' robots come to life and attack imaginary alien sea creatures. I think they hooked up brain scanners to a couple of 7 year-old kids playing with their toys and recorded their deepest thoughts. Wouldn't it just be more cost effective to fire tactical nuclear weapons at these creatures instead of building, well, 'buildings' to fight against them? And why are these Jaegers manned with people on board? Really? Why not use our drone, predator technology and control them remotely? I had to leave halfway through and go watch 'The Lone Ranger' which is an entertaining movie.",
        "I really looked forward to this movie when it was announced. I'm glad it was worth it. I won't go into detail regarding the plot, I would like to relate the feeling I had while watching this. Saw it in 2D and it was a spectacle in it's own accord. Giant behemoths dealing punches, superimposed over general population, produces a feeling of wonder and awe that, I'm sure, del Toro captured unerringly. Adrenaline powered speeches and last minute heroics really made me feel like child again. I had the whole cinema cheer and boo at the screen on various occasions, and the demographic was from 3 to 93 years of age. Feeling is similar to Ridley Scott's \"Gladiator\" through out. It's what \"Transformers\" and \"Godzilla\" SHOULD have been. No better way of spending your afternoon than this. Just go watch it...",
        "Pacific Rim ->> It was a great,spicy,delicious, a-bit-bore 3D DISH made by mixing Transformers & Jurrasic Park in HONG KONG.\n\nSeriously man how much destruction you can expect within a movie after watching a film like Man of Steel..this movie seriously surpassed MOS..this was a DESTRUCTION MAHYEM.\n\nToo much loud..too much action..too much DINOSAUR vs ROBOT but in a great FASHION...loved it.. if y'all like Hollywood with loud bang you will also have a great time.\n\nToo much loud..too much action..too much DINOSAUR vs ROBOT but in a great FASHION...loved it.. if y'all like Hollywood with loud bang you will also have a great time.",
        "This is a pretty bad movie. The acting is horrible but it is tough to tell because the movie is so poorly written. If it were just that the characters are as flat and predictable as a bad children's film then we could forgive it. I might even be able to forgive if there were just the major plot holes. However, they decided to break one of the cardinal rules of science fiction writing, which is \"be consistent.\" To the extent that one can figure out the plot, there are huge problems with what is happening and why. The weapons and abilities of the robots and monsters seem to change based on the whim of the CGI animator. You have to wonder if anybody saw the entire movie script or plot line before the movie was complete.\n\nFinally, there are the pointless back story and side stories. When you're group is the only hope of stopping the end of the world, I'm pretty sure that nobody is going to put up with people who waste time on political infighting and alpha male dominance.",
        "Giant aliens from the sea, have wrecked havoc, destroying half the cities of the world, so the military puts up a funding for an experiment to build giant sized robots called Jaegers, in hopes of being our last line defense, but the question is will it?\n\ndirector Guillermo del Toro really shows how much he is a big fan of those old giant monster movies from Japan. Pacific Rim is a tribute to those old films. The effects are incredible, they don't look fake or phony CGI like your always seeing. But it does not only depend on the action and the effects, but the cast really bring a presence to this. It's over two hours but does not feel like it is, unlike The Lone Ranger. Pacific Rim is very well paced, never gets boring for a second.",
        "(68%) Take note Michael Bay, here is the movie you spent hundreds of millions tying to make in three whole attempts, and yet you failed every single time, whilst del Toro did it better in one single attempt. This is a fun filled, CGI ridden good time that knows exactly what it is, which is a Power rangers-esq movie (only not awful), with effects that impress throughout and enough character to bind everything all together. I didn't get the chance to see this in cinema (where a movie like this really needs to be seen) yet I still enjoyed it, more so than Transformers 2 which I did on the big screen. Says a lot about how poor Bay's crapfest was and still is.",
        "Here's the recipe: Take Cloverfield, Transformers, Battleship, and as many clichés as you can possibly find. Now and crush them all together. Spread that out on any old worn-out story. Now add excessive shaky-cam and pouring rain in every scene so nobody can focus on how terrible it really is.\n\nFortunately I didn't care much about what I might be missing as it was simple-minded and predictable. I just wanted to get out of the theater and salvage what was left of my day.\n\nI yearn for a return to some truly excellent science fiction. This isn't it. We seem to be stuck in a rut where impractical machines with as many moving parts as you can possibly render aim to keep our minds distracted rather than engaged and immersed as science fiction should be.",
        "It occurred to me even as I watched it that PACIFIC RIM was a lifelong dream come true: a live-action version of the ASTRO BOY and GIGANTOR cartoons I'd watched as a child, done right. Del Toro doesn't waste a lot of time trying to infuse PACIFIC RIM with the kind of boring, pointless melodrama that most such movies engage in: he gets down to business early on and rarely strays from the program. (The jab at Modern Man's world-destroying efforts is appreciated.) Moviegoers who've waited for a true Summer Blockbuster will walk away satisfied, though the hype surrounding this movie has been a tad on the RESERVED side, if you ask me: considering what we have here- the overall scale of EVERYTHING-, the trailers should've been Longer and even Louder. The fx actually ENHANCE the drama, the way fx always should (but rarely do). If you're a fan of Giant Monster movies or Giant Robot movies or Giant Monsters vs. Giant Robots movies, you're in luck: PACIFIC RIM is now playing.",
        "Easily my most favorite movie in last few years. It's like Batman Begins of \"big fighting robots\" movies. Beats Michael Bay's Transformers trilogy on many levels. Actually it beats most of the latest \"invasion\" sci-fi movies on many levels. The movement of the giant robots feels very real thanks to the excellent visualization and sound mixing. The main music theme *is* present every-time when it's needed to build that feeling of justification and awesomeness and it's epic presence is appreciated by the little boy in me watching the monumental scenes with eyes glued to the cinema canvas. It's *maybe* not taking itself very seriously, and characterization is quite flat, but the \"threat\" still feels more serious than in movies with similar themes. I couldn't get rid of the wide *cheshire cat grin* on my face when I was driving back home. It was *that* good. Thank you Guillermo del Toro.",
        "They made this movie and I saw it. There were parts where I was merely floating along, which is to say the movie plays but I did not follow. Just a sleepy lazy days sort of movie, y'know, toss back a few sit on the couch and pass out under the light of the TV displaying Pacific Rim. Boring. A lot of stuff is going on but none of it really matters or makes sense, like the film makers were more wasted making this movie than I was watching it, man, so much stuff. Like a word I enjoy using is 'overwrought', it conjures an image of a potter at his wheel ruining vase after vase, so is this movie overwrought. Look, if you love this movie, don't take my review personally, that this movie is made out of sh*t is not your fault, nor your burden.",
        "lets be honest about this. There is practically no plot and the actors are given nothing to do. There is nothing for the audience to empathise with and its practically impossible to care about what happens and the fate of the characters.\n\nYes. I know. There is LOTS and LOTS of CGI. I have no interest in CGI. I think the kind of people who do are those who are distracted by shiny objects.\n\nIts sad to see Del Toro ( whom I do admire) turning out a complete dud like this.\n\nThere is some consolation in the fact that this turkey flopped and there won't be a sequel.",
        "Took a chance on this actually stupid movie whereby you would have to be stupid to believe any of it.The premise that if you build a giant robot to fight a giant monster and then punch the monster like it was a title bout is ridiculous, and an insult to your mind set. why spend billions to build these robots only to fire cannons at them from close range. the thought that you would power this giant robot with the thoughts of two separates minds is staggering.I found it to not be worth a tenth of the money spent to see the hype. I would call it \"Godzilla vs Transformers \" for a Saturday morning kid show . but to cough up $50.00 for 2 adults and 2 kids to see this movie,is just not worth it.My opinion was not the only, my wife and kids hated it too.",
        "From the very first word that forces its way out of Charlie Hunnam's opening narrative you know exactly what's coming. Cheese! Top, grade A Cheese. Now don't get me wrong i am a sucker for cheese, but this takes the biscuit, or more appropriately, the cracker. Every line by every actor is covered in it. I couldn't help but laugh and sometimes even cringe, but does that hinder my ability to sit back and enjoy the movie? Well, a little, yes. I just couldn't focus, and was unable to invest in the characters or the underlying story. If i was lactose intolerant i may have been in trouble.\n\nHowever the action scenes are riveting, you almost don't want them to stop. But as much as the film is a \"leave your brain at the door\" kind of film, i couldn't help but nitpick (which i hate myself for doing) at several of the scenes which i felt made no sense whatsoever. Misplaced analysing aside it is definitely worth seeing. A great action movie that doesn't take itself seriously. Remember though say CHEESE!!!!",
        "I do not particularly like these types of movies but this was ok.\n\nThe action was from start to finish n the cgi n special effects were incredible.\n\nActing was as expected over the top but it suited the movie n the characters were good n there was a thin veiled sense of humour to boot.\n\nThe ending was as expected but thrilling.\n\nI definitely recommend this movie especially if you like sci-fi n plenty of action.",
        "This is the wet dream of a stalinist. there is no reason, although some emotions are built to mimic some sort of shallow logic. but the rest is everything about getting together to weave the better hive. how everybody and everything got together against an enemy built, like all western apocalyptic narratives, after the model of satan: chaotic, out of nowhere, and very powerful. and all the humans have to do is admit they are simply cogs in a bigger machine, of course, like all despots \"for the sake of everybody\".",
        "The visual effects and the scale of the monster/robots in this are really impressive. It looks phenomenal in 3D but the pacing is a total mess. It goes from great truly impressive moments to incredibly dull filler. And the reason why the filler is so dull? It's because of the terrible writing and acting of the characters. The characters were not one dimensional, they were zero dimensional solely consisting of shouting and bravado. You'd think someone would inject a bit of personality into this but no! The ones that try are just annoying as hell. Watch this for the effects only, I recommend watching in 3D and with heavy use of the 10 second skip forward button.",
        "I was hopeful going in from a review I read but it could have gone bad. Instead it went great. You know that the humans win - of course. Instead of making up some twisted plot you get interesting side stories, some surprise, good acting, good fights and an attempt at realism. The scientists were good for comedy without being annoying. I only recognized one actor so I saw some new people who were great, like Elba and Kikuchi. A part of the opening is how so many countries worked together but there is no message that would serve no purpose but would be heavy-handed.I didn't see any of the Transformers movies; I will make a comparison to Independence Day.",
        "Almost a great Movie-liked it really with the theme sets and the way soundtracks and directions fade in for the screenplay apart from the Monster and robot thing may seem to be childish to some still the way the movie theme in 2020 how Humans adapt to use technology wise as per the circumstances is well depicted. The way the action is choreographed is best even if its a robot fighting- The fights seems like more Human to a Monster and it was Stylish. Movie rating as per my thoughts is perfectly 8.5/10. The Storyline that makes the Human world to be almost responding to a catastrophe even though its strange from normal-the Movie is perfectly scripted. Sometimes have felt that instead of creating this as a sequel let this Movie remain as a legend or evergreen movie of all time and it perfectly deserves i guess.",
        "What happens when you mix Transformers, Avatar and Godzilla? You get Pacific Rim. If you were disappointed by Transformers, this will replace it in your heart. It's everything Transformers should have been. Michael Bay, if you're reading this, have the director of this help you with Transformers 4. You absolutely must see this on the big screen. Don't wait for the DVD/Bluray. It's a BIG movie that absolutely positively MUST be seen in the theater. It's got action, explosions, wit, and is definitely the best movie of summer 2013. My only complaint is it ran a little too long. They could have cut a half hour. Grade: A+ 10/10 5/5 stars.",
        "This is an Epic fighting movie. With amazing vissual effects and a fantastic Soundtrack. This movie will never get old, it's not %100 perfect, but is worth to repeat. Oh, and we better forget the sequel.",
        "I won't bother with an actual summary of this film since they managed to pour in every cliché imaginable. You've seen this movie already, just think Transformers meets Godzilla, add some terrible acting to the mix and there you have it.\n\nThis movie will seriously go through every lame cliché from the 90s.\n\nMovies like this insult the viewers intelligence, I don't know why this crap doesn't go straight to video, isn't there a committee of any kind that establishes quality?\n\nThe rating on IMDb is unbelievably high so I'm guessing they actually went ahead and bought good reviews and ratings. IMDb is slowly but surely becoming untrustworthy because of things like this, it's honestly sad that you can't even rely on them to have a clear depiction of the quality of things.",
        "Absolutely best action movie so far this year, there is something different from other boring, same old story movies like Transformers, Iron Man 3 franchises. Not so good story and not so meaningful that where the alien came from and the actions taken from human, world and how they are fighting them but start up, action scenario, no boring drama made movie something different and very excited, that team play and showed whole world, human, technology power you probably accept that best movie so far human against alien, second biggest monster movie as i remember after Godzilla and soundtrack in every scenario matched so. After all hadn't time to think about root cause and other things watching the movie for 2 hours :P",
        "'Pacific Rim' is more bland than 'Transformers'. I really couldn't care less about a movie. Of course it's kind of nice to look at due to the CGI, but that's about it.",
        "Guillermo Del Toro has an amazing visual sense. His movies are beautiful to watch. However this was visually interesting but otherwise shallow and plot less. This felt like a live action version of Neon Genesis Evangelion. The character were all 1 dimensional archetypes. Other than fight scenes in CGI - which I didn't find that interesting, there's not much to the film. There was not even an interesting backstory on the Kaiju. Their dinosaur form and adaptation to battles was kind of interesting but wasn't explored. The entire plot and ending was completely obvious (you knew who would fall in love, who would nobly sacrifice themselves, who was going to die, etc.)",
        "OK, so going in, I didn't know what this was aside from \"big robot fight\". After I heard the word \"kaiju\", I knew it was a Japanese manga-style tale. And it hit just about every single cliché from the \"Kaiju\" genre of anime and manga.\n\nNot that thats a bad thing, especially if you don't normally watch Japanese media.\n\nI can understand why so many if the American \"professional\" critics hated it. They don't understand the culture it comes from. Ironically, these same ideals used to dominate American media decades ago, when we weren't all emo about being a powerful nation.",
        "It's keeps you engaged till end.......................",
        "This movie is everything that is wrong with Hollywood \"sci-fi\" action flicks. It follows a predictable script, characters are no different than in any other blockbuster movie, and even dialog stinks of mediocrity. It was made for children who enjoy flashing colors and explosions. This is not the Independence Day, its just another Transformers movie with same clichés and crappy animations.\n\nThis movie is everything that is wrong with Hollywood \"sci-fi\" action flicks. It follows a predictable script, characters are no different than in any other blockbuster movie, and even dialog stinks of mediocrity. It was made for children who enjoy flashing colors and explosions. This is not the Independence Day, its just another Transformers movie with same clichés and crappy animations.",
        "If you want some uber fantastic CGI, action packed, monster pounding, rockets blasting, loud booms and explosions then you'll love this movie because it does that VERY well. If you're expecting a deep and well crafted story, you'll be a bit disappointed. The strong point of this movie is the struggle of the human race against all odds. The courage, bravery, and comradery that everyone has to go through to make it together. It displays a lot of inspirational moments and makes you remember who you are as a human being, weak and fragile. We may not be much alone but together we can overcome anything. An inspirational action packed robots and aliens movie in summary. Not a romantic or a movie filled with plots and twists. Movie is obviously geared towards younger audiences.",
        "Its a well rounded movie, it has great action, hints of humor at the right moments, and has a little bit of everything. Unlike most movies, I like the female main character's personality and how she is portrayed in the movie. I also like how she's Asian. They don't over sexualize Mako or the relationship between her and Raleigh, which I enjoyed a lot. I loved the relationship between the two, how deeply they connected and how their relationship developed. They don't over emphasize things in the movie, which I really liked. They give you just enough to be satisfactory and hint at the rest, they don't overwhelm you with certain aspects of the movie. This movie isn't mind blowing, life changing, or touches your heart and pulls at its strings, but overall it was enjoyable and entertaining. It was a nice movie to watch and nothing about it really frustrated me or made me want to change it. It's like Goldilocks and the three bears, it's the porridge that's not to hot and not to cold, it's just right.",
        "I thoroughly enjoyed his movie fro start to finish, even the comical parts which in an other film would have been out of place. I initially thought it was the follow up to cloverfield. But filmed totally differently but i think I am wrong about that.\n\nThere were some lines/ designs throughout the film which plays homage to star Wars, but done in a way which enhances the film.\n\nThis is a film that can be watched so many times over the fight scenes are great but are grounded by the actors. If the film has one problem it is the main character sounds a bit punch drunk and the acting is a little wooden but Sean slater (eastenders) is great apart from his slightly dodgy accent and Luther is awesome as always. It all ties together so undoubtedly thanks to del toro's direction and story telling which left me putting some pieces together which is clearly deliberate. There will hopefully be a sequel.",
        "Everything about this movie is big. Ginormous. Bigger than life wouldn't do it justice.\n\nI worried that seeing this at home wouldn't have the same impact, but the intent is still there. Giant monsters going head to head with giant robots.\n\nNormally I'd scoff at this, but the director is so enamored with his love of all things monster related (and believe me, it shows) that you can't help but feel his passion.\n\nThere's flat dialogue, sure, but do we care? I don't. This is stylized action at it's best.",
        "This movie is a lot like, \"God, it's good to be a teenager again.\" Let me just identify myself : male, thirty-nine years of age, well-educated, always consider the consequences. And this movie, I mean, it has monsters ... and robots ... and romance ... and bromance ... and love ... and loss ... and sacrifice ... and perseverance. So can they be victorious? I also think the Newton's Cradle was a nice little touch. Get it? Little? Touch? Aw, man, this movie was just so much fun.",
        "This film will go down in history as \"that robots killing aliens movie\". It's just so epic. When I first went to the cinema I was really sceptic. I thought it's just a movie created to make lots of money, because of special effects.\n\nTurned out I was wrong. It wasn't about the effects, it wasn't about the fights, it was much more. It will be something you will remember after a few years. It will be something you will watch again and again.\n\nThere is something for everyone. For the geeks - beautifully designed robots and the monsters were very interesting, unique and familiar at the same time. Epic battle scenes with much details, looking realistic. For women - you have a lot of hot guys showing their bodies. You have a universe worth exploring. And it's not only serious business, you will have a few laughs. But on the other hand, you might shed a few tears, too.",
        "I forgot to post a review so here i am many years later!\n\nThis movie was revolutional in being the first movie i seen that was animation with humans pilot a giant mecha (Besides power rangers Lol) I really enjoyed this film and i feel it was 1 of a kind until the day Gundam Becomes a live action movie 😁.",
        "This is the best blockbuster movie of the year so far. Watched in 2d so cant comment on 3d version. Excellent story, simple and not too overcomplicated, with obvious major nods to manga/anime influence. Basically its all about monsters vs giant robots fighting and you get plenty of that! No slow build up, straight into the action. Characters typical clichéd bunch with tragic back stories, but reasonably well done so matches the story. And a few eccentric characters very typical of Del Toro. Very much like typical Michael Bay OTT film but Del Toro influence raises it above this. Only niggles is that some of the action shown very close up and dark so maybe not getting the best out of the fights, but that is the style of the film. And as with many blockbusters, the sound effects sometimes seem to swamp the dialogue. Also film feels bit rushed could actually do with another 20 mins. But all that is very minor. After a good year for sf films with iron Man 3, Star Trek and Man of Steel, and Elysium still to come, this is even better. See it in the cinema, this is the place to watch it! Simply perfect entertainment.",
        "When people saw the trailer to this film you know only one thing popped into their heads, people inside giant robots controlling them to fight giant creatures.. yeah POWER RANGERS YAY!\n\nI have read some mixed opinions some saying its a good film because its different and that it looks good but to be completely honest it did have a good premise but the way it panned out was really bad. Its not enough too LOOK good, sure seeing colossal sized robots fight against monsters is cool but that's not enough.\n\nI think if it was done better the film would've been sweet but the fact that I thought the acting was sub par , they tried to add depth to the story but failed, there were some unnecessary parts included where other parts to the film good of been better expanded on. It was just not very good, its watchable... for your kid but other than that poor film.",
        "I don't dislike action but this was a whole lotta nothing. I must admit I did decide to watch it because I like the director and maybe that raised the expectations for me.\n\nIt's just noise though and some aggressive guys essentially doing \"privates\" measuring contests.",
        "OK. So I heard the reviews and paid far too much attention to the hype. My son begged me to take him to see it and I thought it was the perfect excuse. All the indications were that it was going to be a couple of hours of mindless fun, action packed, unpretentious and tick all the boxes for a Friday night popcorn movie. Sad to say that despite the fact I expected little in the way of acting and dialog, even the action had me bored and a little bemused. I found it messy, overcooked and repetitive. I haven't left a film in years feeling such a sense of relief that it was finally over. I did tonight. Even my son, who is 8, felt underwhelmed by the whole experience. What's happened to modern cinema? Where's the euphoria, the emotion, the exhilaration and real sense of storytelling gone? In short, i felt it was a monstrous mess... CGI CGI CGI CGI.... blah blah blah. I know I am the odd one out here,but I will happily remain so and pick my movies more carefully in future, paying less attention to the movie going public who seem to have a deluded sense of what constitutes entertainment. I need a shower. Rant over.",
        "I had seen the trailer dozens of times and with each time I wanted to see the film more and more. It wasn't a let down! It's absolutely stunning, even the monsters are beautiful(in their own gruesome way). The director Guillermo del Toro did a fantastic job! The acting and the effects are amazing. I loved the details that were put into the film(rust on the Jaegers;chipped paint on their Jaeger suits,so on). My favourite Jaeger is Gypsy Danger(a bit too obvious,eh?). Another thing I love about the film is the unique way of showing aliens. The aliens are obviously from another planet but they come trough a portal that is deep into the ocean,they are intelligent despite how they look and above all they clone themselves and send clones to do the \"dirty\" work. They are truly unique. I strongly recommend it to anyone who loves robots and monsters and the everlasting battle between good and evil.",
        "This is a really entertaining movie. Everything about it is really cool. Badass robot designs. Scary monsters. Cool fighting scenes. Beautiful visuals. The 3D effect wasn't an after thought. It was actually really noticeable and added to the movie's beautiful visual design. Pacific Rim is an homage to the monster movie genre and to many anime series such Evangelion. If you are a fan you will love this movie. The plot is fairly simple and the characters are not that deep but despite this there are still a few emotionally gripping scenes. I really enjoyed the atmosphere of the film. It struck a balance between seriousness and lightheartedness. The movie is serious enough to make you care enough for the characters and believe that the world is plausible. Yet it is light enough for you to have fun and a good laugh at times.\n\nOverall, a really good time at the theatre. 8 Jagers out of 10",
        "No cohesion, No humour (that I noticed) and No connection. I like a bit of fantasy and escapism as much as the next man but despite my continued (misplaced) faith in film makers like GDT this movie was not worth the continued \"I'll give another ten minutes\" syndrome. It's not the worst film ever made but it's not worth watching. I'm still wondering why the war lasted so many years when they could have ended it like they did anyway (at the end). Not 2 hours completely wasted because I've made up my mind not to give this type of trash another ten minutes for more than ten minutes.",
        "There is nothing about this film that's worth 90 mins of your time. There is nothing you haven't seen, nothing notable in execution, and you will only get cheesed off by the stupidity of the plot.\n\nEvery cheesy cliché is there, it is completely predictable, back story is nonsensical and devoid of any logic, insight into future or basic understanding of the present (important for a film that pretends to be SciFi).\n\nThe only success of this film was in creating hype and astroturfing to sucker people into paying to see it. Perhaps most accurate description was from fellow cinema-goer: A pretentious Sharknado.",
        "OMG the adrenaline is still pumping through me!!!! Pacific Rim is beyond awesome!!! I was wide eyed, open mouthed and trembling with excitement all the way though, and I am GUTTED that right now I'm not with like minded folk because I really want to play Kaiju and Jaegers. I would be \"BAM!! BAM!! BAM!!!\" and doing the moves and rolling around for hours!!! I am really envious I'm not a child because I wish I could be justified in having all the bedding, toys (so not only could I play at K & Js physically with my friends, I could have fun for hours playing fights alone with my merchandise) and maybe some pyjamas too. Love it soooooo much!!!!!!!!!!",
        "This movie is bad. I do not know how could anybody rate this movie higher than 3. 3 is a good rating for this movie. So lets start: characters are pathetic, story is lame and full of inconsistencies, combat scenes is ridiculous. I will not mention CGI because nowadays anybody could do that. OK, if you are a 5 years old kid move could be great, but for all others (5+) is a insult for intelligence. Any episode of children series Power Rangers is better than this. I like SF so that is only reason i rated this movie so high as 3. There is many games, comics, cartoons with big robots and it is sad that no one could write good screenplay and make a decent movie. In a last decade only thing that matters is CGI, so make bad screenplay with a lot of CGI, make a good trailer and here you go. It is too bad that no one really cares about a story. I was expected from Del Toro much better movie, but...",
        "If giant monsters and giant robots are not your thing your going to hate this movie. If they are your thing and you still have access to your inner 10 year old you ought to love this movie. That's really all I'll say. Enough other people have commented on the acting and writing. This movie isn't about those things, and if you went into this movie expecting great writing and acting then I don't know what to say. What it does have is some amazing spectacle.",
        "Such a refreshing action movie. Unlike many action movies nowadays that are based on well known comic books and books and we always know the story and the element of surprise is not really present. This movie however I went in with just seeing the trailer and omg hands down the best action movie I have seen in a long time. The story line was great it went into correct amount of depth and was not just action action action. It starts off with a great action scenes and then takes some time to build the plot. Then it goes into awesome action scenes and also had a great ending. Definitely worth watching in 3D. I know that this movie was filmed in 2D and converted to 3D for the theater. But because of all the large objects the 3D effect really made it seem like we were in the movie. Also the soundtrack was amazing for pumping you up.",
        "I expected better of Guillermo del Toro. Dinosaurs emerging from an a-hole in the center of the earth from another dimension or whatever. The basic message is one of desperate collectivism in the face of almost certain global annihilation. To distract adolescent viewers and sugar coat such a malevolent totalitarian pill, they throw magnificently exploding garbage at their 3-D audience numbed into the desirable zombie-like trance, and shell-shocked into submission.\n\nIt's enough to make me miss the blatant fairy-tale (but at least anti-fascist) mysticism of Pan's Labyrinth -which nonetheless revealed the same basic motivations at work in the commie resistance fighters. At least I won't be wasting any more time on this director. He truly has said whatever he may have had to say and is now reduced to repeating himself, however inarticulately. Also, too predictable and empty a story for a spoiler alert. If you've seen any disaster film ever, you will see nothing new with this one.",
        "It is one of my best film my childhood memory of seeing fighting robot in cartoon. Now in Live action film which is awesome and Awesome CGI. There are so many robots fighting with monster and so good action seen I love it. It look similar to Neon Genesis Evangelion And one of my favorite anime.\n\nThe story is good and the directing also Idris Elba done a good acting I love almost every seen of the Pacific Rim. If you love action film then watch this with awesome visual effect. The design of robot and monster is good look so realistic.\n\nOverall 10 Master Piece of Robotic action scene.",
        "This is the first movie in a long time that I've switched off before the end - I made it 90% of the way through so feel justified in writing a review.\n\nThe entire movie was just a series of fight sequences between big boxing robots and giant space lizards. Now I'm all for a bit of tongue-in-cheek action but unfortunately this movie attempted to deliver its paper-thin story all too seriously.\n\nThe film actually features some good actors but the lines and plot they are forced to work with meant the whole thing felt like a series of low budget sitcom scenes spliced together with special effects fight sequences.\n\nIn summary - I wouldn't waste your time.",
        "Looking for substance? Look elsewhere. Looking for original writing? Look elsewhere. Looking for a CGI 'mindless blockbuster'? This is your mindless 8.5.",
        "I wish I could give this movie a lower rating. Everything is terrible, storyline, acting, cgi, everything.. Do not waste your time. I wish I had not. I do not believe there was any forethought into the technical aspects of the movie. Produced in an age of drones and wireless communication, why would there be a need for manual pilots that actually have to run in place driving huge mechanisms to control movement. Why would they 'feel' when the machines arm is ripped off. Why would this fight not be with nuclear weapons instead of trillion dollar bipedal robots. Why would you need to 'drift' two separate minds together to control one. Ever heard of Mechwarrior? Kids play that crap in their basements on a controller with two sticks and six buttons. What a damn waste of time and imagination. I wanted to like it, by the end I just wanted to say I finished it, and now that I have, I want my money back :(",
        "The only reason I did not give this a 1 is because I should have known better. It begins with a fairly lame premise, starts out slow and then kind of just falls completely apart. No direction, no plot, no point, just flashy lights. Big whoop-de-doo.\n\nI am bitterly disappointed in Guillermo Del Toro - everything else I have seen of his has been so brilliant.\n\nHowever, I should have known better - the key words were there, the idea of giant mecha battling giant monsters, please, I am sure I lost at least 30% if my IQ watching this.\n\nIf your are a pre-adolescent boy (or girl), who doesn't really fit in, and would prefer living a virtual life to a real one, then this is probably a movie for you.",
        "Awful cliche characters. Especially the helpless japanese misaku, struggling against her daddy issues with horrible english and creepy acting. White man saves the day.\n\nAmazing load of garbage.",
        "Short and Sweet This isn't Romeo & Juliet, War & Peace or any Epic piece of fiction like those. It is a big budget smack-down. The battles in the cities around the world are pretty cool, but i would have enjoyed a more international flavors to it. But that's just my opinion. Transformers/Godzilla mash up, with shadows of Japanese robot fighting stories. The Jeagers (Robots) themselves have plenty to look at on the big screen, in some shots you get a good, if quick look at the mechanics inside, Sort of like the brilliant work done on the First live action Transformers movie.Characters are light and not completely original but what is nowadays? Good special effects and plenty of action.... a few nice non action character scenes to remind you of the stakes. Music is alright but not rousing. I give it 8/10",
        "I love watching this movie. The scenes of the giant monsters and robots fighting are visually breathtaking. The CGI makes it realistic and watchable, especially when compared to the Godzilla movies. Some of the lines my friends and I love to use because they are so stupid, yet funny. While it's not a think-piece, nor is it supposed to be, it makes me smile. Guillermo del Toro, is one of my favorite directors, and I'm so glad he went the distance with this ground breaking movie. If you want to be entertained, but not think too hard, this is a great film to unwind to when relaxing after a hard day at work.",
        "At first,it makes feel it like the copycat of Japan Manga - Eva Evangellion: Zero.But at last i feel it had its own style to plot the movie. The director cleverly edited the ideas from Eva and make it become its own movie. It makes me unbreathable from the beginning of the fight against the kaiju. The visual effect of the movie is also well done. The kaiju seem nice and real.The story line is also well plotted. I feel Rei is alive when i see the role of Mori appears in the movie. The beginning and the ending of the movie is well established. I cant believe that I see Eva goes to the movie and no longer stay in the anime version. Finally, a well edited version of Eva Evangellion. Hope the second episode will even better than first. Great work, masterpiece of sci-fiction/ fantasy movie.",
        "As \"science\" fiction this is infantile. Like the new Star Trek, and Terminator Salvation, Battleship, and many others, the special effects are great but the plot and the acting make this a \"real life\" comic. There is no effort at all to offer a plausible basis for the plot elements. The entire movie is an insult to the intelligence, but it looks good. I guess that's what it takes to rake in the big money these days.\n\nThe characters are shallow, spoiled, egotists who try to be larger than life heroes but end up looking like reckless children let loose in a toy factory. If these are the best humanity has to put up against its enemies, it makes you want to root for its enemies.",
        "All the time I was watching Pacific Rim, I thought of myself as a little boy playing with my robot & dinosaur toys in the tub. Further proof that men are always boys at heart, no matter how old they get.\n\nIf I wanted to criticize PR, I'm sure I could say that it was a bit cliched or over-the-top, but movies like this are like comfort food: you' know what you're getting and it just feels good.\n\nCook up some popcorn, get in touch with your inner child, and enjoy the ride. :-)",
        "This is exactly what you want in a movie like this. It could have been perfect if they had digged a little deeper into the trauma of the main characters. For those who like the genre, it doesn't disappoint. The sense of epic is there, and the ost is on point with every scene.",
        "I will not waste my time or yours. 10 lines of review is all you'll get from me...\n\nThis is simply one of the worse movie I ever seen and surely the worse I have seen in a long time. Except the CGI, everything feel amateurish at best. Poor plot, poor acting, poor dialog, tons of cliché, literally dozen of basic scientific inaccuracies, predictable end etc.\n\nEvery 5 minutes, I was griding my teeth for one reason or another. This thing is worth a 3 to an ultimate max of 5, how on earth does it currently have a 7.1 rating is beyond me.\n\nIt's sad that nowadays, all it take to make a movie seems to be a pile of cash, a bunch of random actors, pretty CGI and a single idea/concept that you can stretch for 2 hours with an alternate mix of forgettable 100% CGI scene and seriously lacking story and dialog.",
        "Pacific Rim or in my words Pacific sh*t. I mean what happened? Every movie contains the same material. Dark noise sounds which really pisses me of, Citys getting destroyed in Pacific Rim finally not New York, actors who can't act and of course America, America, AMERCIA and a little bit 'MURICA. Only America can safe the world is the subtext of this movie like in Man of Steel and all the other movies lately. My only hope in this year is Only God Forgives.\n\nMy advise: Don't go into this movie and stop helping Hollywood to produce this sort of movies. To conclude, I would like to tell you:\" Amercia, f**k yeah! We have no clue what we do.\"",
        "Mediocre film that did not deserve a sequel. No story. Annoying in your face CGI all the way through",
        "It is simply the best robotic movie after Transformers that i've ever seen!!! The 3D effects were totally cool and the fast paced actions and visuals will keep you on the edge of your seat!!!! It is an wholesome entertainment!! Del Toro has kept the entertainment not just for kids but even for mature audiences too!!! Above all, my final verdict is that if you are a fan of robotic movies and action effects then this movie will surely entertain you!!!! All the cast and crew have done a marvelous job. There might be some glitches but that won't affect anything at all!! It has lived up to my expectations!! Another great work from Warner Bros. after Man of Steel!",
        "This movie is what would happen if you gave an eight-year-old one hundred million dollars and told him to make a film. Nothing makes sense about this movie. The entire thing is ridiculous, from plot holes to simple visual errors. But at the end of this movie, you won't have that feeling of wasted time. It's like watching a Transformers movie that has a purpose. If you ever wanted to witness a life-sized action-figure world with silly robots, impossible technology, watch this movie. All around family fun, one of the few \"silly and pointless\" movies I'd allow my kids to watch. This is just good old fashioned entertainment.",
        "I had a lot of fun at this movie. I think that the special effects were awesome and that the story line was good. Charlie Day was fabulous and hilarious and the other actors were pretty good. Thank you for bringing back the fun and memories of blockbuster monster movies like Godzilla and some of the old time greats!!! Fun for the entire family!! It's been along time since I have seen a movie that was not only visually striking but also made me feel like the admission price was well spent. I look forward to any sequels that this movie will spawn. Hopefully they will find a great storyline to continue the fun and bring another great movie full of fabulous special effects!! Highly recommend!!!",
        "This movie was what you'd get if you had a mentally retarded person directing a film. Throw in a crap ton of special effects and money and what do you have? A sparkling pile feces || For all the hype and anticipation this was a total letdown. What are you trying to cater to 3rd graders? This is the epitome of not knowing your audience. This should have been a serious film not a batman forever knockoff with mecha giant. Was this a stunt to anger people by insulting their maturity. or are you trying to dumb don the populous? I can't believe this is what media had become these days. It's ridiculous and you should be ashamed.",
        "It's fun to watch. As far as this type of movie is considered, giant robots fighting monsters action. It's a ten.",
        "I was looking forward to this, as I don't bother to see many films at the cinema nowadays, but I made a rare effort to see this, particularly as I like Idris Elbra. Now, I don't think I'm going deaf, but when whole conversations are mumbled or unintelligible, or in the case of the two bickering scientist clichés spoken at scatter gun speed then something has gone seriously wrong. I've noticed before that this is gradually creeping into films and television nowadays, but never before have I watched something and been so frustrated as I was when watching Pacific Rim. Whilst the plot on a effects blockbuster is hardly important, or difficult to follow, and call me old fashioned if you like, but I do actually like to be able to make out spoken dialogue. Is it really that difficult nowadays or is nobody bothered about it?",
        "Being a BIG fan of anime, I was saving this movie for a free and relax weekend. From the Trailers, this movie looks like a BAD-ASS fight between giant robots and aliens. But this movie have the potential to disappoint the audience at each aspect. Where to start....story line, casting, acting, science, physics,...every thing was going haywire. I patiently waited, as its just a movie, things might surprisingly align approaching the end, BUT THEY DIDN'T.\n\nIn conclusion this movie might be watched, only if these conditions are met:- (1) if you are hanging out with your friends (2) just want to pass time (3) want to make fun of something\n\nOtherwise don't waste your time on it",
        "Going in this movie had three big pluses: Guillermo del Toro, giant robots, and giant monsters. And oh great Maker what a spectacular mixture they make. There's only a few lulls in the action and just enough about the characters to let you care about them. But the fights. Great Krypton, the fights! The audience I was with was *cheering* in places, and that just never happens. There is awesome piled on top of awesome until you just sit there with a grin plastered to your face and your smile muscles hurt. This movie has bumped Buckaroo Banzai out of the top spot on my list of greatest movies ever made. This will definitely be a blu-ray purchase in four or five months when it comes out. But why are you reading this review when you could be seeing this flick?!? GO NOW!!",
        "Poor script, even poorer acting and no sense of direction throughout! The problem with this film is that the characters just aren't believable and you need some credibility to pull off an action yarn like this. For all its faults, 'Cloverfield' held my attention much more than this tired effort. I watched it with my 17 year old son, who gave up on it about 1/3 of the way through. I must confess that I almost followed him as the first half has very little going for it as it tries desperately to make us care about the characters (and little else). The two scientists are the least believable of all and I got seriously annoyed with the both of them! It picks up a little in the second half but not enough to pull you back in. All in all, a tired, boring, noisy mess. I'm amazed that the film is so highly rated by others here. Oh, I almost forgot; the CGI is passable but only just. It's destined to be forgotten!",
        "I cannot comprehend why anyone liked this piece of dirge. There was little in the way of back story of the characters so I didn't give a jot about any of them, the special effects were abysmal, the acting gives wood a bad name, the plot was ridiculous, the science was berserk and in the end the film... ended. Nothing inspiring or insightful about this $100 million movie and I feel poorer for having sat through it.\n\nIt reminded me of the worst of 80s science fiction pieces where you have to suspend belief entirely to enjoy them. The fact is we're not in the 80s anymore and are tuned in to the speed of advances in technology and what is and is not possible.\n\nOne question I continually asked myself through this was why not use torpedoes, missiles, drones or chemical warfare? Also I asked myself WHY? JUST WHY?!",
        "This is the must see movie of the year. I was a little hesitate to see this movie..but when I did it was worth it. The cast is great a they make the movie come alive. The action was great and did not disappoint. and lastly the cg on this movie is got movie goers heads wanting more.There was one down side in the movie that I didn't like (and I will give it away you have to figure it out ) The actors made the movie believable and it is easy to follow the story because it has a flow that sucks you into the story. So if you like robots, monsters, and a good fight then check this movie out. Worth the money of the movie ticket.",
        "This is my favorite \"Giant monster\" movie. It has a good cast including an exceptional performance from Idris Elba. This is action cheese at its absolute finest. The movie is also chock full of nerd in-jokes. The best way to watch this is to just relax and let yourself have fun. Break out the popcorn, have a few drinks, and completely disregard the sequel.",
        "In a summer that seems to have a sequel-a-week, a remake, a retread or a rip-off, it is kind of surprising fun to watch \"Pacific Rim\" - which in a lot of ways, is all of those.\n\nIt is, at the very least, a mega-million dollar kiddie matinée crossed with an old-school action/adventure movie. It could be a sequel to a Godzilla movie never made (or, at least an ode to \"Destroy All Monsters\"), and it thematically borrows from everything between Thunderbirds-Are-Go, Aliens, Transformers to Starship Troopers.\n\nThe movie is an imaginative rock 'em sock 'em robots-versus-monsters amusement park ride: just enjoyable, dumb fun in an air-conditioned movie theatre for 2 hours - perfect for your inner 10 year-old.\n\nAnd it is pretty cool to see a robot punch a monster in the face.",
        "excellent movie..... a must watch action packed thrilling and definitely a visual eye candy for the young generation............ yeah certain flaws are there and its obvious.....for many this movie isn't perfect and totally respect their opinions... but still can promise a 100% thrilling and action packed experience... individual performances are good enough for the movie but its the battle between the monsters and the hunters that will attract you... expected a bit more battles but still the special effects and story line is strong enough to get your attention........ despite its flaws definitely a 10 on 10 movie for me... don't miss this movie as its worth watching at least once...",
        "Pacific Rim is one of my favorite movies. It has a great value of rewatch ability, and the special effects and music are some of the best of all time. Uprising wasn't the worst movie, but it didn't do the series justice. What Del Toro established was loosely based off of a lot of Japanese's comics and cartoons, but executed in an ultra realistic way. Everything from the water the Jaegers waded through to the epic fight scenes. Ramin Djwadi did an absolutely fantastic job with the ost. You may recognize him from iron man and game of thrones. The actors also did a great job. The lead actor was the weakest in my opinion. All of the supporting actors did a spectacular, though. (Charlie Day, Ron Perlman) I give this movie a 10 out of 10 mainly to balance things out. I believe it should be at least a 7.5 or 8.",
        "Overall a good watch, switch off brain and get the pop corn and the beers in. This is a typical American 'we can save the world don't worry' action film. And yes the effects are spectacular and yes it is 'Godzilla fighting Transformers' so should be every kid born before the 1990s dream film. if you like that sort of thing fill your boots. However there are a few minor niggles that confused me a little, such as why do they stop building these giant machines and then build a wall? You have just seen these alien monsters walk through several very large steel buildings without breaking stride and then someone says lets build a wall to stop them, no weapons are added to this wall its just a big wall..... That seems very stupid if you ask me and I am proved correct when a wall is breached within 2 minutes. Also where do they get all this steel, titanium etc from? And why do the heads of the machines have to drop onto the body in such a spectacular way......",
        "I guess I was just in the mood for a Giant Monsters/Giant Robots movie and didn't even know it. PACIFIC RIM has its faults but overall, it packs a punch! Good fun entertainment. I loved the way the monsters looked and overall, I thought the special effects were excellent. Del Toro is such a talented director - I loved PAN'S LABYRINTH as well his early underrated vampire flick KRONOS. The acting is rather uneven in this film - the lead guy seemed a bit dead eyed and stiff but I loved the Asian actress from BABEL. The wacky scientists seemed to be in a different movie but I loved their story line. I can see how this might not be everyone's cup of tea but I really enjoyed it.",
        "Too many long winded reviews, and too many trolls, so to put it in a simple way. Acting 6.5/10 Story 7/10 Script 6.5/10 Action 9/10 CGI 9.5/10 Sets 9/10 Entertainment 8/10. If it helps the Mrs was really not wanting to see this (she did not like Man Of Steel) but when we left Pacific Rim she said she enjoyed it and would tell friends to see it. It is a big screen film, the bigger the screen the better, and the 3D seemed good on the whole. Its not perfect but a MUST see movie, doing well with fans and even those been dragged along to see it like my wife. Will win no acting Oscars but it does what it needs to, and that's entertain on a massive scale.\n\n:-)",
        "I really don't understand why this movie has such a high rating here on IMDb. I lasted just over an hour watching it, and that's mainly due to the fact I was surfing the Internet at the same time to keep myself amused. There's no story, and the robot vs monster stuff gets old after the first 10 minutes.\n\nOne time when I looked up from my laptop, there was a scene that reminded me so much of a Godzilla movie I saw as a kid, I knew I had to turn it off. I thought this type of drivel was a waste of my time even when I was 12. This is the kind of movie that gave science fiction a bad name in the 60's. Please don't bring that garbage back! I love sci-fi, but this movie is an embarrassment to the genre.",
        "I enjoyed this movie very much.The plot is well done and the acting very convincing. Special effects very well made. 2 hours of action!! I can't wait for the 2nd part! Great work of Charlie and Rinko, I love Rinko! She is beautiful here and personally I would like she to show some more skin, because she has a great Asian body very wheel toned and athletic. For me, it seems like the movie was well think before its release. Each scene has a purpose and is very enjoyable. I was forgetting the great acting of Idris Elba, an English actor that I respect very much due to his performance in police series and in Prometheus. Excellent choice of actor in any case. Even the doctor, scientific, technicians, etc all they were very well chosen for this movie. I recommend you to see it if you are looking for well entertainment. Congratulation to all the people who made possible this action movie!",
        "50 minutes before the actual conflict is established. 50 minutes in with the only snap to the dialog landing like dull thuds in total cliché. Tons of exposition. Ron Perlmanʻs awesomeness totally wasted in this flick.\n\nMoments before the climax, folks have to run in and explain a ton of stuff and introduce a new antagonist to make the stakes high enough since we donʻt have much emotional involvement.\n\nObviously great CG, art direction, music, the actors were decent and tried to make the best of lame lines, editors did a great job too, but the guys who make the big bucks (Directors, Producers, the Studio) shouldnʻt on this, they failed all those talented people working on all the other parts. Another big budget implosion. LAME.",
        "Clearly movie studios have found a way to pay their way to higher IMDb ratings. It is literally the only possible explanation for this turd getting over 2 stars from anybody. The people who claim to love this movie are obviously lying or complete brain-dead morons. I've seen a lot of campy B movies in my day and this one is one of the worst movies I have ever seen. It's the rare triple threat of a high profile movie with a ginormous budget which has a terrible script, is filled with terrible actors, which is also terribly directed. Honestly there is NOTHING redeeming about this movie unless you're the type that enjoys laughing at bad movies. If that is your thing then boy have we found the movie for you!!!!!",
        "This film is the closest thing we'll get to a live action Neon Genesis Evangelion. It has big monsters and big robots, which will satisfy anyone who is looking for that, but it doesn't offer much for everyone else. The characterisation was very flat. The best part of the film was the ability to enter the minds of the monsters and see their home world which raises some questions and opens up the potential for sequels to explore that.",
        "I came into this not expecting anything more than a couple of hours of distraction and I still was disappointed. An old Japanese Godzilla movie would have made as much sense, an actual comic book could have let me see the art design of the Jaegers and the monsters better, their cable TV shows showcase the lead actors' skills better. I didn't expect it to make any scientific or technological sense, but it was like the producers of a bad Adult Swim anime got handed a billion dollars and given too much freedom. And stretching it to over two hours rather than 90 minutes didn't help. I found the Transformers movies more enjoyable, and I'm not at all a Transformers fan.",
        "Saw this in the theater on the last days if the run. I had been seeing ads on TV and watched the trailers. Maybe that's what made me disappointed , watching the trailer. But the movie jumps into the \"people in robot suits\" too soon. I wanted to see more about the Godzilla monster at first. The story is so far from what the trailers show it is pathetic.\n\nSo if you want to see a Japanese transformers meets Godzilla style movie you will like pacific rim. It's about robot suits and robot suit pilots, no more. Not much in the way of scenes showing how it all started, maybe 10 minutes total as part of a narrative.\n\nA little of Del Toros Hellboy look is present, as is a little Pans Labyrinth look, but overall a predictable children's movie with virtually no surprises.",
        "I did not expect too much when I went to see this movie. And it was true, it reminded me of the good old Godzillas from the 70s, with a updated technique and a better sound. Anyway, I was not amazed and I hoped the movie comes to an end after about 1:45, but the finale was just what had to come. The final sequences were something in between Gandalf and Innerspace. At least I did not fall asleep while watching the movie, but I was not very amused. --- While I understand the requirements for a review, I think it is too strict, because some movies don't justify writing a set of ten lines about it. So this review should maybe be seen as a notice to the moderator and a thought about the reviewing rules on this website. Anyway, I regard IMDb as one of the best resources regarding movies, and I want to thank the staff of IMDb for the effort they put in maintaining this site. Keep up the good work, you are doing a fantastic job!\n\nFritz Pinguin",
        "The movie has a lot of interesting technology on the screen but it gets boring fast. In between the big fights there is little to keep your interest and even the fights get repetitive. It's like watching wrestling for 2 hours as the plot and character development do little to make the fight scenes mean much other than showing off CGI skills. Example: The acid spitting monster does a take down on the 3 armed samurai robot but wait the samurai robot gets up and does a arm chop to the neck!! No talent to write this movie just take any wrestling match and add a love interest that never seems real and of course the required we can win speech and the standard geek scientist and you have this movie. The 60 year old Godzilla movie is a far better movie as far as giant monsters from the ocean destroying the city go. Pacific Rim will be forgotten in a couple years.",
        "The only thing about it worth seeing is the special effects, which aren't perfect, but usually OK. The science doesn't add up, the premise is very weak, the acting is bad, there's no suspense to be found at all. It all seems like an excuse for giant robots to fight giant monsters.\n\nWhich would be fine with me, really. I was intrigued at the start, because they've summarized the background in a few minutes and got right into the carnage. But then the movie seems to have run out of steam and tried to be a drama. A rather lengthy, predictable and poorly acted drama.\n\nI was not amused. Perhaps a 14-year old who doesn't mind the boredom outside the battle scenes nor cares about the logic would have been.",
        "Lots of action, well done.\n\nVery entertaining.\n\nUnexpectedly very good.",
        "well, it was a big question for me before watching that film, what should a sci-fi blockbuster looked like to carry this 7,2 rating. If a proper 4,5 or 5 rating was there, its most likely i wouldn't ever watched it. After all, i try it and actually i finished it. Oh my goodness, i watched the entirely film! Something like a miracle. Boring, pure acting, predictable, zero background, a total lie. maybe a \"3\" rating if anyone is willing to watch an unspeakable \"light\" film with super hi tech CG, and nothing more. To eat some pop corns and leave the theater with nothing but almost 2,5 hours without thinking and anxiousness. But if anyone wanna watch serious cinema, even a blockbuster with some decent plot, should never, NEVER, spent a single dollar (or euro) to watch this \"kind of a film\".",
        "This is what we need more of in Hollywood: Fun, well made, creative and original while still wearing its inspiration on it's sleeve.",
        "This is by far the worst movie my husband and I have ever watched. The storyline is awful. The acting is awful. The only reason we saw this movie was because of the reviews. Big mistake...waste of money. I rarely right reviews unless a movie is great or awful, the latter being the case here. My husband and I left the theater wanting to demand a full refund of our money and time. I have no idea how anyone could give this movie any rating higher than one star which is the minimum. The entire movie from beginning to end was just simply boring. Never did it manage to get us engaged. We just waited patiently for it to end, since we had our children next door watching despicable me for the second time. Worst movie ever, I can't say this enough!",
        "It seems that ratings for movies have gone berserk. With action and sci-fi films I check the rating and in case these are too low I do not bother to watch it. With a 7+ rating I expected that Pacific Rim would at least be above mediocre. The acting is at time appalling. The characters are stereotype and most of them are just obnoxious. A story-line is practically non-existing. It seems that an era has begun were special effects get better rating then acting or plots. Pacific Rim is similar to Battleship, lots of action and more action but absolutely no BRAINS at all.\n\nIt is very hard to believe that the man behind \"El laberinto del fauno\" has made such an imbecile movie.",
        "Actually, pretty disappointing. This film was a mix of Godzilla, Real Steele, Transformers and Independence Day...but all those movies did it better. The good stuff: lots of action, special effects, and it does have a plot. The bad stuff: decent actors trying to pull off poor writing and poor directing. The lame writing made for some corny, and some drab dialogue. The actors/characters didn't have any chemistry or depth. They were so bland that you didn't really care about them. I love Charlie Hunnam and Idris Elba, but even their characters were boring, and under developed. The researchers/scientists, played by Gorman & Day were just annoying. They were supposed to add some comic relief, but they were just silly. I think this movie will be mostly enjoyed by kids/YA, especially boys, who will enjoy the robots, aliens and the fighting/action scenes (as far as kids go, the language isn't too bad, the s-word once, lots of God d- mn, and a handful of b--ch, a--, h-ll, etc.; no f-word or nudity) I give this a 5.3 stars. There are much better films out there in my humble opinion.",
        "\"OK\" story, if over the top; good effects; another film in the \"America saves the world\" series.\n\nFeatures the worst \"Australian\" accent of any movie I've seen - Robert Kazinsky should fire his dialect coach and listen to the actors around him - Max Martini had me (an Australian native) fooled - didn't pick Max as a New Yorker. Kazinsky sounded South African, via Europe, via Ireland and somewhat American (or Canadian?) - with a hint of Aussie twang making irregular and obviously intentional appearances. Which wouldn't have been an issue if both father (Martini) and son (Kazinsky) used a similar conglomerate accent.",
        "Giant Tinker-Toys meet Godzilla! Teenage Mutant Turtles Meet Power Rangers! Every cliché every written makes an appearance in this big-budget disaster. I wish I could say something good, but I can't.\n\nThe performances are stilted. You know what the actors are going to say before they say it. The lead actress has two expressions, both require no ability. The males act like teenagers in rut. The fight scenes are reminiscent of fake TV wrestling. This was made for those whose shoe size is bigger than their IQ.\n\nSuch a waste of talent from the director. What could be worse than the Iron Man trilogy? Than the Avengers? Than Captain America? Pacific Rim.\n\nSave your money. This one blows chunks.",
        "The movie is just awesome. There isn't really a lot to say the movie is just awesome. The scenes are shot well and you can see what is actually happening unlike the Transformers movies. The action is over the top and just overwhelming which is a huge plus for an action movie. I hate to dwell on things that don't really matter like the plot or characters and things like that. I liked the characters but they weren't in depth or anything but they had enough detail to elevate them over other. Idris Elba's character was awesome though. The plot does the job it isn't groundbreaking but it is fine. But that isn't the point, we are here to see the battles and they are fantastic. I give it 9 out of 10 and I think that is fair.",
        "A stupid concept and background story. After monsters came out from the ocean, humans decided to build gigantic robots which can only be controlled by exactly 2 people from within. These 2 pilots feel the pain whenever the robot is hit. Really, which 6 years old kid wrote this script? And couldn't you have remote controlled robots? And seriously, just build a bigger bomb.\n\nIf you manage to overcome the stupidity of the plot, than you are faced with the worst actors performance you can ever imagine, a bunch of cliche sentence and dialogues, and a lot of stereotyping.",
        "I am not sure why some people are praising this movie and saying that this is such a great fun. Now don't get me wrong, I love action movies, that kind of movies I mostly watch. But I still think that action movie should have some kind of soul. This movie totally lacks the soul. Acting is horrible and dialogue is even worse, but it doesn't matter here so much because the movie is most of the time like watching an animated movie. The effects are OK but not that great, you will be noticing all the time that you are actually watching CGI animations. Basically every action sequence you will know in advance that what will happen. And even after the first fight I said to myself why the just won't do that what they then eventually did. This is just stupid and boring action movie. Do yourself a favor and watch Fast and furious instead. Its also stupid but at least fun.",
        "Garbage. Mindless crap. This is a bad movie. This movie is not good.",
        "What the title said. The plot of this movie is very much similar to the overly cheesy and terribly goofy 90's Will Smith flick. Aliens invade Earth because they want our land. That is as far as I can go without spoiling much of the plot, and I don't want to; the writing in this one is actually VERY GOOD. Yes, a movie about giant robots fighting giant alien monsters has clever writing. I know, right??\n\nGood writing is not all this brilliant piece of cinema has to offer though. There are the AWESOMETASTIC special effects by Industrial Lights & Magic. There is A+ class acting. The musical score is very impressive. And directing by Guillermo del Toro does not hurt either.\n\nI found nothing wrong with this film. But hey, maybe you will! See it for yourself, and see if this review is trustworthy.",
        "EPIC Battle Scenes, Awesome Graphics, 3D Conversion is little overrated and not up to the mark as i expected, I watched this movie in I-MAX 3D, Images were super Bright... Overall Super fun Movie for this summer and a must watch movie!! sure the story lacks some soul in it but it doesn't fail to Entertain you till the End!!! Guillermo del Toro is surely one of my favourite director and he does best in this movie with lots of Wide angle & Long shots, There are long sequences in this movie that merit that most overused of terms: \"Awesome.\"\n\nIn many ways this is the best giant monster film ever made and probably it could have been made with a strong Screenplay and story. :)\n\nPS: Just Watch it for FUN Sake ;)",
        "Adults will find this movie quite unbearable. There is absolutely no effort put into story or character. Rather, what the film presents is an unrelenting sequence of horrible clichés & embarrassing dialogue...which briefly interrupt one boring robot-fight scene after another. It is absolute torture.\n\nChildren, on the other hand, are inoculated. They don't have the experience or intelligence required to feel the pain this movie insists on bringing. They will be distracted enough by the visual stimulation - & appreciative enough of the strained obviousness of each scene.\n\nIt has been a long time since a movie wilfully refused to bridge the gap between these two audiences.",
        "I am very much a sucker for large robots/mechs, and this was for sure a great watch. Absolutely love the depiction of these giant robots and the movement of them were on point! Fight scenes were pretty solid too!",
        "This movie is just brilliant. Great entertainment, well worth the money on IMAX and 3D. Non stop action, mega sized robots plus enormous monsters make for one huge entertaining flick. It is very different from transformers or real steel or avatar or godzilla or other similar sci-fi movies. The sheer size of the jaegers and kaiju on the big screen just make your jaw drop as you realize the massive scale of the action. Kick-ass special effects.\n\nIt is the best movie I have seen in recent years. Don't miss it on the big screen!\n\n10/10",
        "Looks pretty and that's about it. I felt totally uninvolved throughout, poor acting (Idris Elba's accent seems to change throughout), annoying characters, and it all seems geared to 10 year olds, a robot/monster version of Jurassic Park if you like.\n\nKiddie sci-fi.",
        "Well, This is my first review. I always thought I would write some praising review about some good movie I had watched. Unfortunately, I have to write a warning. As a big fan of Sci Fi and Guillermo del Toro I am sorry to write that this movie was one of the biggest disappointment ever. I have never seen so many bad clichés in my life in just one movie. The dialogs and acting are like in a very, very bad Mexican soap. And the movie is actually completely boring. If they want to make a spectacle they should stick to computer animation and make the video game. There is really nothing to see in this movie except couple of minutes of good computer animation. This is just not watchable. Complete waste time and money!!!",
        "I've been just told this movie had a plot and characters. Well, yes. A stupid plot making no sense on any level, including giant monsters which are nearly invulnerable to projectiles and rockets but vulnerable to giant robots, which come in increasingly stronger versions instead of coming in the strongest version right away, and which are pregnant despite of being reproduced by cloning. And cliché characters including dyed blonde hair Russians like Ivan Drago from Rocky III and a Marshal reproducing the motivational speech from Independence Day.﻿ It's nice to look at, I give it that. And it is not as annoying as the Transfomers sequels or Battleship. But the difference isn't too big. This movie is seriously overrated.",
        "What a stupid movie. The acting! - Actors trying to make their own voices sound cool by lowering the pitch of their voice is pathetic in its own way. This movie tries to be so cool in so many wrong ways. Either your are cool or you are not! And this movie tries to be something its definitely not! Its not only bad acting, its bad leadership on the set!\n\nI cant really figure out if one star is way too much! But let me say that you should only see this movie if you are in the hospital and are already hurt plenty!\n\nThis is the kind of movie that the animation movie \"Team America\" made fun of. May it be forgotten forever.",
        "This is simply the stupidest thing ever made. Ever. In general, ridiculous giant monsters trading punches kind of look stupid no matter how the film is made, but even then there are different levels of stupid. This film hit rock bottom. Just listening to the introduction and the tiresome exposition sent a chill down my spine, as I anticipated the colossal stupidity that was on the way. And then it began... A film with no artistic ambition whatsoever, a retarded video game simulation that the viewers can't play. Anonymous giant monster things facing interchangeable two-dimensional 'characters'. And that's it. If you still find such garbage appealing, you may want to start asking yourself what the hell is wrong with you.",
        "Pacific Rim is a sci-fi, action packed summer blockbuster of 2013. The movies takes place when Earth is being invaded by gigantic aliens that none any already-existed weapons can sufficiently take down, the human creates the Jaegers which are gigantic piloted robots to counter and end the invasion.   To me, this is what summer movies should be. The movie has stunning visual effects. The robots are beautifully crafted and rendered. Action scenes are breath-taking. If you want an all-out, ass-kicking, robot-smashing, explosive goodness, this is the movie.   However, don't expect complex plots, well-developed characters WITH phenomenal action. Characters are predictable and simple. There are no sub-plots in the movie, just saving the Earth and kicking asses.   In my opinion, this is a great movie to watch but it could be better developed, both the fighting and the human characters. Recommended.",
        "Pacific Rim = 2 1/2 hours of my life I'll never get back\n\nUgh, Where do I begin on this crapfest? It was like combining Power Ranger MegaZords with Godzilla, while taking story points from Starship Troopers and Independence Day with the goal of destroying more CGI buildings than The Man Of Steel. In my theater I witnessed 5 people walk out at various points (who never returned) and it took a ton of willpower to continue to punish myself and sit through it till the very end. I have enjoyed every Guillermo Del Toro movie up until this point but everything about it just seemed rushed and sloppy.\n\nI give it 1/5 Voltron Cats (which doesn't really form Voltron now does it)",
        "This is a very stupid movie. Its based on a stupid idea that a stupid director stole and tried to sell to a stupid audience. Thankfully, the majority of the audience is not stupid enough to pay to watch it, so there won't be a sequel.\n\nThis is one of those movies where actors spout garbage while standing in front of green screens. There is no character, no plot, no suspense and no humour.\n\nOf the element that was supposed to sell the movie- the fight scenes- they seem to take place in bad visibility, suggesting that the special effects weren't up to snuff.\n\nthis is a movie for people who thought that the Green Lantern didn't have enough cgi and that the Seth Rogen version of the Green Hornet was too intellectual. Steer well clear.",
        "Cool opening scene tried to make it a more thinker movie with message like alien doesnt come from the star or thats cool twin neural link thing.\n\nHowever, the philosophy scifi stop there. The rest of the movie is all about heroic act and fun action of future robotic guardian the Jaeger VS the Japanese inspired Kaiju monsters. Yes, if you are fan of Anime and Ultraman live action this pacific rim really bring out your childhood imagination at it best. No more comments just enjoy the fight show",
        "Well, the only good thing in this movie is Ron Perlman (one of my favourites), although even his character is deeply out of place. i can't understand why someone would make a monster movie based on an idea, instead of a script. 'cause this is just what it seems here - an idea - wouldn't it be cool to have giant monsters battle giant robots in 3d? Probably it would. But that isn't enough. You have to add more to the idea, and keep things organized and fairly logical - which this movie doesn't. The number of plot holes and inconsistencies is beyond the counting power of any mortal being. As i said, extremely disappointing.\n\nPS: Btw, the special effects leave much to be desired from, for such a movie.",
        "I read the synopsis, and went in spite of the story because I liked the actors. The beginning of the movie IS the synopsis, and it's really cool, so I got excited.\n\nThen the girl enters. Drama starts, action ends. Cheesy scenes, Cheesy lines, and she is an AWFUL actress! Like a statue. I even saw a place where she flubbed her line and they dubbed it later. When she says more than a couple words in a row, they show her from behind, because she obviously doesn't know English and (at least seems to be) speaking her lines phonetically. There's a flashback scene with her as a child, and the LITTLE girl is amazing. The other actors, too. But HUGE lull in the middle with the chick drama.\n\nBy the end of the movie every scene was from either Armageddon, Independence Day, or Top Gun.",
        "I'll keep the review short. This movie has all of the things required to make a big fun summer movie. I can give you two reason why you should watch this movie in the big screen. Robots and monsters. Robots beating the crap out of monsters and vice versa is something you don't see a lot in movies these days. Guillermo Del Toro really did bring the best of both worlds from Japanese monsters and from the robots. Visual effects here are awesome and I recommend seeing it in 3D cause it really shows more depth to the visualization. The only thing that bothered me in the movie is the two scientists. They're pretty annoying and when they need to tell something important and I couldn't really understand what they're saying.\n\nAll in all you need to see this now and this movie has a lot of potential for a trilogy.",
        "The movie is too childish and too much of a cliche. I had to struggle to keep watching after the first half. If you are going for live action anime, then try to pick the good traits, not the bad ones. Cgi is good and the characters are not that bad for the most part, but I don't like the script at all.",
        "This movie is a blend between: Alien, Matrix and Transformers and if you like all of the above you don't have to read my review and just go and watch it, you'll like it. The main story is pretty simple, when aliens start invading earth, all differences are put aside and the whole world joins to build robots to fight these giant aliens. Adding a sad story about the main character Raleigh Becket (Charlie Hunnam) and you have a basic storyline grid used in a lot of movies. But the movie can make it up with an impressive and innovative alien live form. One of the best alien life form since Alien (1979) and Predator in 1987. But what makes this movie really enjoyable are the special effects (2D Version). The animations are perfectly detailed and not too dominant. In my opinion, is the cutting perfect and much better then most other modern Sci-Fi movies. This makes it the best Sci-Fi Human Vs. Aliens Movie in the past few years. This movie is a blend between: Alien, Matrix and Transformers.",
        "A disgraceful film, where cliché appears every time the main characters open their mouths to say bullshit. The plot is one of the weakly I ever saw in a film. The special effects are definitely the high point of the 131 minutes you are going to lose in your life if you decide to watch it. In some parts of the movie it looks like the viewer went back in time and is watching \"Power Rangers\" again. And not to mention the pointless dialog that go along all the scenes. If you are looking for more than special effects I strongly recommend to do not watch this crap, but if you really like this in a film, just watch Transformers or Battleship. At least these other two will not make you sorry to have waste time and money.",
        "Another big budget American summer blockbuster full of grandiose special effects and tedium in equal measures. The film is so achingly predictable that the person I was watching it with was convinced I'd seen it before. Boring. Next...",
        "This film had me flicking through my phone half the time. The pacing is meant to be fast with lots of big CGI action scenes but it just could not keep my interest. The writing is to blame for this one I suspect.",
        "A lot of people might compare this movie with Transformers, not me, I think this movie is a mixture of Mazinger and Godzilla. This movie is very Japaneseish.\n\nDoes it have a good story? Not really, it's a bit mindless. Does it have good visual effects? Definitely! I think it is the best 3D movie this year.\n\nMost alien movies will tell you where the aliens are from, but this movie just gives you a lot of monsters without explanations, kinda sucks.\n\nHow about acting? Charlie Hunnam is good, another young bright star, he reminds me of the late Heath Ledger.\n\nIf you have an HDTV at home, you can wait for the blue ray DVD and save some money!",
        "I have to admit the great excitement I was feeling, when heard that G.del Toro was up to shooting this film. unfortunately after half an hour through the film, all excitement started to go to opposite direction. This could be a short film, the story folds and folds on chilches and doesn't go beyond predictable. I loved the gloomy style and fashion of del Toro's at films like Pan's labyrinth, Hellboy..etc. but it feels like its just one of those annually appearing big film projects which you wont be remembering in the following year. I'd love to see del Toro in more cohesive, and forward thinking sci-fi adaptations. yes all 3d and CGI looks nice and polish and seamlessly. I guess in a way rain make it easier to hide some parts though.",
        "Both my inner 8 year old and Anime Mecha fan fell in love with this movie! It was like watching the plot of every Mecha/monster Anime that was pieced together with good old school Hollywood sci-fi action. The 1st 5 min of the flick is so far the best movie opening of this summer. I would give this movie give this movie a ten, but that's where the Anime fanboy side comes out. I can name at least 6 animes that this takes big bites from. Although the movie makes up for it with a head 1st action approach. Yet I found myself acting like a kid during the fight scenes. Can't wait for this to come out the Blu-ray and will looking out for the video game soon. This will serve as a good blueprint for bringing anime to Hollywood.",
        "Mostly formulaic and predictable, but reasonably entertaining. Plot setup is nothing new: alien monsters attack earth, only a handful of good guys stand in their way, epic CGI-produced battles ensue. This one is sort of Starship Troopers meets Transformers.\n\nThere is the usual token character development, the relationship drama, the fellow good guy who thinks the hero is a loser and hassles him about it, comical side characters, the self-sacrifice for the team and the survival of humanity. We've seen these all before.\n\nHowever, Pacific Rim is quite entertaining. Action scenes are well done and it moves at a good pace. Plot doesn't really let up at any time.\n\nSo, can take it or leave it. Not a must-see, but not all bad either.",
        "The Good: Some of the best special effects in recent memory. CGI effects are beautiful and seamlessly integrated with actual footage. Fight scenes are satisfying. The scale of the battles felt authentic.\n\nThe Bad: Very thin plot elements. Characters are shallow and not developed well (despite the screenwriters obvious efforts). Nothing to make you care about the battles or their outcomes.\n\nConclusion: This movie looks great but is easily forgettable. There is nothing of substance to make you really care about this film. It's worth seeing on the big screen but I would recommend the matinée price if available.",
        "I was literally dragged to the cinema by my closest friends. I kept telling them that this movie will be just like \"Battleship\", but they refused to consider my thoughts, they regretted it later. To sum it up for you - don't waste your time. It's a total crap. The plot is soooo cheesy(actually much stronger words are required here) the plot is ARGH!#!@. What a total nonsense, i cant actually believe that professional writers wrote this ! I really can go in depth here, but my post will be really long and hard to read. So if you like mindless propaganda movies like \"Battleship\" or \"Battle for L.A.\" go on and watch this..Otherways - well u know. As for me - i'll regret watching this for a long time, i felt like my IQ dropped by at least 10%.",
        "NOTE TO PRODUCERS - Surely you could have chosen REAL Aussie actors to portray the Father and Son roles??? It was so embarrassing to hear an American and an Englishman attempt the Aussie accent. Why bother when out of the tens of thousands of quality Australian actors out there you could have found the talent needed.\n\nThe movie itself is way too busy for my liking. At times you just cannot tell what is happening, who is hitting who.\n\nIt also wreaks a bit of Top Gun with the handsome hero and jerk like fellow pilot.\n\nI wasn't impressed with this film at all.",
        "PACIFIC RIM is Guillermo del Toro's tribute to the millions of giant monster fans around the globe. It has appeal for both the modern video game / CGI crowd as well as anyone raised on old school Godzilla, Gamera, Ultra Man, or anything similar.\n\nThe story concerns an invasion by a race of distant beings that have found a portal into our world. They quickly unleash their gargantuan creatures to destroy mankind. Banding together, the humans create a fleet of titanic robots to defend against the alien onslaught.\n\nThe robo-tech is fantastic and the towering monsters are realistic, menacing abominations. The battles between them are intense and satisfying.\n\nThere's also a human story to be told in this film. The characters aren't merely gung-ho TOP GUN-types either. Well, at least not many of them. In short, there's a heart beneath all of the clashing metal and exploding cityscapes. Highly recommended...",
        "It's been three years since I first saw this masterpiece and love it to this day! Both Travis Beacham and GDT have such an eye and vast minds to truly make the whole thing work.\n\nThe casting is phenomenal and diverse, which brings about the realness of \"the world saving the world.\" So many little odds and ends that people really wouldn't think about makes PR a brilliant movie. I'm forever in awe at how del Toro utilizes color and subtlety to really pull everything together; of course, with the glorious work from cast and crew!\n\nSo excited for the next comic, the series, and the sequel!",
        "Guillermo del Toro directed this big-budget CGI Sci-Fi tale that starts off explaining how the world became under attack by giant monsters called Kaiju, who invade the Earth from a breach from beneath the sea, in a plan to invade the Earth and destroy the humans, who retaliate by building equally gigantic robots called Jaegers piloted by two people linked as one mind to carry the psychic load. Nearly defeated by years of escalating assaults, the humans launch one last, desperate assault on the breach itself, to end this war once and for all.\n\nEntertaining film with lots of action and impressive F/X, and clever touches and nods to other films, is still pretty far-fetched stuff, but handled with reasonable intelligence and care. Not particularly original in any way, but still fun to watch, with Idris Elba and Ron Perlman in particular standing out with effective performances.",
        "Its been a long time since I've seen a bigger disappointment than Pacific Rim, this Avatar wannabe, second rate Japanese Robot parody reject is just simply not worth watching past the first 4 minutes, which I kept missing (until just recently) in part out of pure bad luck. I'm sick of catching the ass end of that bridge scene with that 1st big monster, which is the unfortunate promise unkept in this movie, one of the grandest and richest unrealized promises, I think, in the history of motion pictures, especially when you factor in gems like the War of the Worlds, King Kong and Godzilla franchises, even the Roland Emmerich Godzilla. Del Toro really needs to try another version of this concept and get it right this time, with the big, scary simplicity that bridge scene promised the first time, but this time delivering us a movie worth watching, with some Joy Luck Club heat in the apocalyptic backdrop of those monsters taking over the world, with not one of those stupid assed robots in sight.",
        "The premise of the movie is fairly simple; giant monsters fight giant robots. Yet this concept is used to its full potential in Pacific Rim. The vfx are absolutely stunning, and the camerawork is used to show just how massive these fights are. What the sequel missed was the action; the slow movement of the Jaegers grounds the fights and makes them realistic. The characters are rather forgettable, but they are not the focus of the movie: the giant robot fights are. They didn't need to put so much work into this movie, but they did. It's a ridiculous concept, but executed brilliantly to produce an amazing film.",
        "In short: i saw the trailer on TV and it looked terrible, now after watching the movie on the small screen, i wish i had paid to watch it at the cinema. It was a thoroughly entertaining movie.\n\nIn (slight) detail: Firstly, what were they thinking when they made the trailer? It makes the movie look thoughtless, stupid and worse than transformers (which i hate). It didn't appear to be the type of movie i would enjoy, i would sit there laughing at the cliché acting and unoriginal story. HOWEVER, after borrowing the bluray from a friend, i decided to watch it (mainly to please my girlfriend, who likes these kinda things). I usually prefer pretentious thought provoking films (i know). I put this movie on with low expectations, and somehow from start to finish it kept me highly entertained. Although it was in parts very chiche, it didn't matter. The acting was decent (Idris Elba stole the show). The special effects were mind blowing and i was never bored. Bravo Guillermo Del Torro!!!",
        "There's this niggling yet unshakeable sense that 'Pacific Rim (2013)' shouldn't be as enjoyable as it ultimately is, seeing as though the dialogue (along with most acting) is eye-rollingly ham-fisted, in a corny kind of way, and the set-up itself is cringe-inducingly clichéd. Yet the picture picks itself up around half-way through and comes barrelling in to be an ultimate guilty-pleasure. The expertly rendered robot-suits battle it out in the cities and seas to usually eye-pleasing results, and it's actually a pretty fun ride even though you know it's stupid, and perhaps it even knows it itself. Not quite 'turn your brain off', but definitely 'ignore that whiny voice of cinematic reason'. 7/10.",
        "Fun mindless action movie. the non-action scenes are kind of useless, cheesy, and sometimes pretty dumb. but still enjoyable overall. was in awe of the epicness the first time i watched it. the fight scenes are easily the best part of the movie. in the future i wouldn't mind just watching the action scenes.\n\ni wish i remembered that last sentence before i randomly watched it a fifth time. the action parts are still awesome, but not enough to carry the human parts. i've liked this movie less and less every time i've watched it, i had it at 8/10 the first time i watched it. the human parts suck as bad as in transformers 4 and 5. (5 viewings, 12/5/2020)",
        "Pacific Rim was surprisingly one of the best movies I've seen this year. I expected an entertaining action movie with mechs fighting monsters, but a movie void of any quality acting or plot. Boy was I wrong. While it was a very entertaining action movie with mechs fighting monsters, it had a very interesting storyline with solid plot development, granted a little brief. The acting was also up to par and the character development was fantastic, giving life and depth to characters that seem at first to be a bit superficial. There were also some nice cameos by actors like Charlie Day and Ron Perlman, who though I don't like, had a cool role. Overall, this movie takes a substantial amount of suspended disbelief but I think most people who like cool action movies will really enjoy it.",
        "The little boy in me loved Pacific Rim! Seeing giant robots battle giant aliens is simply pure entertainment. However, the adult in me noticed that this film's strengths are the fight scenes and the comedic relief of the scientists - the rest of the movie is a clichéd dramatic bore. Still, I was impressed with how much story they were able to cram into a relatively short amount of time. Guillermo del Toro once again proves that he is one of the most creative directors of our time.",
        "This movie was the worst movie. I have ever seen stone. I hated it so much that I'm going to write the worst review for it ever. It is not even worth mentioning. I'm just trying to write enough lines here now. I don't even care anymore. I hope this is enough. For f's sake. I wish I could just go on forever and ever. I wonder how much more long now, I really don't feel like doing this anymore at all. Taking way too long now. I wonder can. I speed this up anyhow. Oh my god, you are f with me ain't ya? I need to write like this ten f lines, what a f bull s is this, this movie doesn't deserve more than one line if even that. Could you please just let me go already, I want to go back home. Please, I promise I won't tell anyone, I just really want to go now, I promise. I, I'll do anything, just please can I go, it's hurting me, please, let me just go now.",
        "I have never commented on IDMB, but I feel obliged to warn everyone about this movie, Pacific Rims. Even though I watched this movie mostly because of the CG, it was very difficult to maintain focus since the robots only fight intermittently and you have to put up with the kind of acting these actors pull - cheesy lines throughout the whole film as well as below-average acting especially by the Japanese girl with terrible English. There is some storyline to this film, which makes things even more difficult for viewers to relate to the characters because it tries too hard to bring out empathy. This movie is comparable to Transformers 3, but much worse. I'd rather watch Transformers since it doesn't try to force you to feel for the characters and it also has better CG. ONLY WATCH TO KILL TIME.",
        "An adrenaline-pumping, full-throttled & action-packed premise charged to full capacity, Guillermo del Toro's Pacific Rim is a fresh, invigorating & endlessly entertaining blockbuster that's filled with sumptuously designed machines & monsters, and delivers plenty of large-scale mayhem between the two behemoths with its exquisitely choreographed & thoroughly compelling battles but is also held back by its formulaic plot & poor characterisation.",
        "Took my grandson to see this movie because I thought he would like it and I saw that the critics thought it was worth seeing. It started out right, character back story, monsters, robots etc. But about halfway through it deteriorated into this muttled, mindless, silly movie with two of the most annoying characters since Transformers Revenge of the Fallen silly robot cars. They were so annoying that I wanted both of them to die. I also really hated the ending I really thought that the people they let die were arbitrary and a little stupid. The movie also didn't leave itself anywhere to go if the studio (like most of them) was looking toward a sequel.",
        "I have no idea what kind of drugs people must have been taking to enjoy this film. I mean there is nothing good about the movie even the action scenes are slow and boring. The worst part of this movie was the terrible acting. The acting in this film was so over the top every word that Becket character said sounded forced and something action man might say, even in the dramatic scenes he would not alter his voice he showed no emotion during the whole film he just sounded like action man or something. It was just him every actor spoke like this and even the speech was ridiculous and had no soul or meaning to it everyone in this movie is bloody action man. I found myself constantly checking the time hoping this piece of dribble would end. I didn't even stay for the ending it was that cliché and obvious. This has to be the worst movie I have ever seen.\n\nI give this film a 1 out of 10 Maybe it's better in 3D?",
        "\"Pacific Rim\" is a movie which has to do with the protection of Earth under threat of monstrous sea creatures (derived from the dinosaurs). I was not excited about this movie because the plot it was not so good and the cast performing below average.\n\nThe only thing that I really liked in this movie was the visual effects. It was great because of their presentation at the audience. I also enjoyed this movie because of an another reason and that's it the interpretation of Charlie Hunnam played as Raleigh Becket a soldier and a pilot of Jaeger and the interpretation of Idris Elba played as Stacker Pentecost a field marshal. If you want to see a Sci-Fi movie with monsters of the sea which are threaten Earth and robots controlled by humans to defend it, then this is your movie...",
        "I saw this Trailer 2 or 3 times at the IMAX this summer. So I made sure to watch this film at the IMAX because the trailer seemed bigger than life on the IMAX and not so much on other screens. That being said this film's technical aspects are perfect in every way. While watching I felt myself gripping my seat as the Jaegers fought the Kaiju. Everything is bigger than life for 2+ hours from the mechs to the actors. The story was more in depth then what I anticipated but still nothing to write home about. The acting, while over the top was superb because it fits with the overall premise of the film... Plus Charlie Day, Idris Elba, and Ron Perlman were perfect for these caricatures. If you want to see this movie spend the extra money and see it in the IMAX it's worth every extra cent.",
        "This movie was so bad that I couldn't finish it, despite that I really wanted to see the end. I also challenged a friend to watch it - he made it through it (he claims), and I somewhat believe him, but I know he was in pain.. such a terrible movie.. bad, BAD acting, ridiculous story line (even for a scifi fan)... I want the 50min of my life back (as I said I couldn't finish it, it was that bad)This movie was so bad that I couldn't finish it, despite that I really wanted to see the end. I also challenged a friend to watch it - he made it through it (he claims), and I somewhat believe him, but I know he was in pain.. such a terrible movie.. bad, BAD acting, ridiculous story line (even for a scifi fan)... I want the 50min of my life back (as I said I couldn't finish it, it was that bad)",
        "I must be honest.. After watching this movie I felt bad for not watching it on the big screen! Simply put this movie is filled with action packed awesomeness!! If you're a sci-fi buff or anime buff or even a rpg buff you'll love this movie even more! Don't want to spoil the movie for anyone so I won't go into details but from beginning to end this movie had me in the edge of my seat! I'm not one to buy hard copies of movies because I don't like rewatching them since I already know what's going to happen. Lets just say I'll be ordering a blueray copy. Plus I want to help support movies like this! Oh forgot to mention if you like any of the mech assault games or even have interest in the upcoming titanfall game you'll love this movie!!! But also if you like no bullshit action packed movies. ;)",
        "Pacific Rim begins in 2020 Alaska, seven years into the war against the Kaiju, the giant sea monsters out to destroy the world if not for the man made hunting machines that face off against their foes in crude hand-to-claw combat. While looking impressive, with their flexible bodies, honed skills and built-in destructive weapons, the machines highlight the film's most laughable inanity.\n\nSince monsters vs. man made-machines is virtually all that Pacific Rim is about, the human element lags behind . Charlie Hunnam plays Raleigh Becket, trained to take control of one of the two-person hunters. Having previously lost his partner-brother during combat, he comes equipped with a built-in backstory to want redemption. Fans will be then anticipating it's sequel in several years and many can hope it is a well deserved wait.",
        "This film is very simple minded. Don't expect anything and you will not be disappointed. Unless you paid for tickets, in which case it might be a bit of a let down.\n\nShame is that it is becoming a new film genre - huge budget, a lot of cgi with no story, no tension and poor actor performance. and sometimes it would be better off as a silent movie too.\n\nI will not add anything from the plot, but I am sure you will know the what will happen at least one minute in advance. The biggest mystery is the score here at IMDb.\n\nIt is watchable, but it's a typical watch & bin it movie.",
        "As we know, Guillermo del Toro is fond of fantasy and visual effects, and state-of-the-art technology enables him to provide more flashing scenes and fights - regretfully at the expense of pithiness and novelty. Similar monsters, equipment, fights, reasonings, types of characters (politically correct approach of different races and ages) etc. have been visible in dozens of movies - so is the ending, typical to Hollywood blockbusters. Bearing in mind the development of technology in recent decades, it is still odd why there are still so many Godzilla and transformer figures in movies! And you can easily guess which characters survive and who lose their lives... As for the cast, only Idris Elba and Ron Perlman give decent performances, the rest is gray zone, no catchy moments, just trivial solutions of trivial types...\n\nA kind of entertainment appraised likely by video gamers, but without offering new elements to the history of cinema.",
        "This was an overall great action sci-fi flick. I absolutely loved the CGI and fight scenes, especially those underwater! Highly recommended to anyone who likes a decent story line with mediocre character development. Very little sexual nature to this film, but loads of violence. My concern with the film and story, is that there wasn't much detail spent in the early days of the Jaegers, or better yet the full stages of the kaiju. I believe that if Pacific Rim had been made into a television show (perhaps even better if it happened now!) showcasing each kaiju battle and follow around the crews of each Jaeger, that a lot more people could enjoy the wonderful idea behind the film and story itself. But hey, it's just an idea",
        "I will keep this review simple, in fact my summary says it all really. This film may have some good CGI effects, it may be fast action and lots of it. It may even be better than the Transformers 2 and 3 movies. But it is not, I repeat not a good film. Not even one that is an easy and fun film to see. I was amazed at the reviews given to this film on IMDb, the sheer number of them that were praising the film, is what let me give it a chance and fork out the price of the ticket. Usually, IMDb is the place to get a fairly good idea if a film is worth the $$$ or £££ but quite frankly they were all wrong and not even by a little bit. If I was 10 I probably would have loved it, but I am not, so the unless you are or that you enjoy films like Fast and Furious or Battlefield Earth (okay I may be going to far here) then don't bother. Remember you will never be able to get those two hours back!",
        "It was a nice touch of Del Toro to add a dedication at the end of the movie Pacific Rim for the 2 master monster makers RAY HARRYHAUSEN (BEAST FROM THE 20,000 FATHOMS 1953) & INOSHIRO HONDA (GODZILLA KING OF THE MONSTERS 1954)the start of the kaiju movies, It would be much better if you added some picture's from those 2 movies (with studio permission of course) and put them on the DVD or Blu-ray disk as extras when the movie PACIFIC RIM comes out to the public. Many people were not born during the 1950's and have no idea who those 2 people that are called master monster makers are, but are known to all science fiction film buffs.",
        "With its neon cityscapes and giant robot battles, 'Pacific Rim' really does evoke the mecha genre of anime while also calling to mind every Godzilla movie you've ever seen to the tenth power. It's filled to bursting with great ideas, concepts and images, but a rather weak cast (besides Idris Elba, who owns in everything he's in) and poorly fleshed out characters didn't allow it to resonate like I hoped it would.\n\nCharacters died, I shrugged. Cities were leveled, I shrugged. It's a dazzling film, but I never once laughed or teared up. It never made the hair on the back of my neck stand up or quicken my pulse. In short; I wasn't moved. For much of its 130 minute running time it felt like watching someone else playing a video game (though certainly playing it well). There's simply too much here that's good not to recommend, but for me the whole was less than the sum of its parts.",
        "If you walk into this movie expecting little plot and huge amounts of CGI action, you're going to love it.\n\nIf you're expecting a complected plot with hard sci-fi explanations, you'll be disappointed.\n\nThis movie attempts to modernize the classic Godzilla style monster movie, and succeeds in every way. The old Godzilla movies were just some guy in a suit trashing a model city. Now, we get to have giant robots fighting the monsters instead! A great homage to old classics",
        "Giant robots engaging in fisticuffs with giant monsters is a joy to behold that I doubt will ever grow old, but the other elements in Pacific Rim are greatly lacking.\n\nIt goes without saying that the basic premise is pants on head retarded, I just wish basic things such as characterisation was handled more effectively. It doesn't help either when Pacific Rim contradicts itself by one moment speaking of the need for efficiency over showing off and in the next scene (literally) pulling its punches.\n\nBad writing is an forever will be bad writing, and Pacific Rim is rife with it. It's a fun ride though if you are willing to overlook such faults and the momentarily atrocious CGI.",
        "I personally found this to be a dull experience. Some of the action and visuals are quite impressive, but there isn't as much action as some may want out of this sort of movie, and the characters are very uninteresting, resulting in a film that feels rather empty.",
        "If compare \"Pacific Rim\" with other films about struggle with monstrous invaders, i would describe it in just few words: Godzilla meets transformers. As this movie about REAL-BIG-THINGS (i mean, things are really big when you see these on a screen first time), Del Toro focusing exactly on them, unlike other directors of such films. No unnecessary dialogues, only clear and simple plot. In contrast to the similar sci-fi action films, where there is tedious break between a beginning and final scene,Del Toro doesn't allow himself such. You will no doubt have fun and don't notice how time flew. So, if you don't wanna miss the great battle between human beings and most vile creatures who ever attacked our planet, you definitely should see this film.",
        "Movies with huge robots killing huge monsters, it cannot be anything more than that and therefore one has to accept it for what it is, no plot but a lot of action and even some deep parts, really a nice movie that entertains in all its duration.",
        "This movie is absolute nonsense, full of clichees and bad acting. Those 2 scientists made me so nervous...",
        "There's not much to say, this movie is exactly what it poses for. Ol'timers that grew up watching mecha animes (like me) will love it. Kids are just kids and will adore the fabulous action sequences. Btw if you did not know what 'mecha' is,you probably won't enjoy it as much. Lots and lots of nerdy details that will get your attention-if you are a nerd of course; something that essentially caught mine is that the romantic element in this flick is completely non-formulaic for Hollywood but just makes perfect sense for animes. Technically speaking: acting/directing=quite good, sfx/music=up to industry standards, CGI=very good, plot/story=entertainingly silly. There is a 15-30-min period in the middle of the film that drags a bit, but that's OK. Enjoy!",
        "When Pacific Rim first came out nearly 5 years ago, it didn't make an impact in the US and Canada but overseas it was a huge hit. It was so huge, that a sequel was greenlit featuring two different characters in lead roles. I rented this on Bluray and enjoyed it for what it was...a popcorn movie. It's also very original yet borrows ideas from other action films from this decade and before. The CGI is pretty good and the way the monsters move is pretty good.",
        "So much has been written, said and uttered about this mammoth production of a blockbuster. Pacific Rim seems to be a very promising try, as it starts where Godzilla or even Independence Day have stopped. With better funds, greater video effects, bigger sound, decent actors, huge soundtrack, excellent funny parts of two zany professors, this movie could have achieved a real great point. In some ways, it did. In many, it failed. With all the efforts, there are still may open questions dangling in the air. I will not ask them to create Spoilers, so still, some plot holes remain. The formulaic performance of several actors add to a weaker impression, and rather predictable twists of plot make it duller thing to peruse. There is much of a clichéd pathetic speaking, much of predictable development, and still, some questions were never answered. One can watch this movie once, just to get to know this one, but then luckily forget and never come back to this at all.",
        "When we talk about sci-fi movie then we generally talk about 2012, day after tomorrow, transformer, terminator and others. Above all Pacific Rim has proved that only technology doesn't works. It's research on scripting,use of technology and the ideas on future was superb. Outstanding visual effects. The movie has fantastical imagery and an irresistible sense of fun.Pacific Rim is a solid modern creature feature bolstered . For adults its a fantastic creation and for small children I don't think there will be any other fantasy movie option other than this.\n\nBRILLIANT MASTERPIECE. MUST WATCH IT",
        "This is by far (in my opinion) dell toros greatest film. Yes, you may say El Laberinto Del Fauno or Hellboy rival it, but in my opinion this is brilliant. To start off the visual effects in this are one of a kind and although people say the storyline is unoriginal, the way it's executed is still bloody awesome. If I had to sum up this movie in three words, I would say. Badass, beautiful and uplifting, and to be completely honest what more does a film need?",
        "This one is action on top of more action!! Monsters vs giant robots!! From the mind of Guillermo Del Toro,,, what more do you need to know?!? I'd give it a 7.5!!\n\nGo watch it!!",
        "This is a movie about robots fighting lizards. It is good at being that. Don't overcomplicate things.",
        "No matter how thin (dumb?) the plot may be, it is to date the most visually impressive cinematographic entertainment ever made. If there is one movie to see in Digital IMAX 3D and all that, that's the one! I love action and special effects but there is so much here that at times it's almost too much. Still, I grew up reading manga and watching anime and I'd say Del Toro made the first ever manga/anime live action movie; nothing that has been done before can compare. So yeah, if that's not your thing, skip it.",
        "Great movie, first installment of hopefully more movies in the future.refreshing different science fiction movie from the same old rewritten stories that seem to come every few years.Looking forward to a series in these films to support and growth from this first installment.Recomend to any that like sci-fi.",
        "i wont take up much space or time of anyone.i'll be brief in my review,but i wanna assure all who r reading my review that you wouldn't want to miss watching this film. This summer has given us quite a number of blockbusters.Best one for me was Iron man 3,till i watched this movie.It blows you away with the awesome VFX,brilliant direction and deep imagination of the master director Guillermo del Toro.The action sequences pack a punch,and u literally scream out in joy when a jaeger kicks a kaiju a**!!You feel like you have been thrown back to your childhood.thank you sir del Toro. Acting-wise,there isn't much to say,expect that Idris Elba,as usual,impresses one and all with his tough act.However,the real heroes here are the jaegers. I would suggest anyone who's reading my review : go to d nearest theater,and catch this action spectacle!!",
        "The narrative is not procrastinating and the action is awesome, a bit like eva.TThe authentic action special effect blockbuster, the narrative is not procrastinating, the action is awesome, a bit like eva.Of course, there are some problems. The plot is a bit weak, but does not affect the overall perception. The Hong Kong war was so brilliant that the final battle was a bit boring.",
        "I've decided to write this review because this movie has the same rating as World War Z, and a better rating than Elysium....how?! I am an absolute junkie for sci-fi films and enjoy visual effects...I attempted to watch this movie twice, and fell asleep both times. I have not fallen asleep in a movie for years! So, if the rating of this movie pertains to its ability to make you sleep, then yes, seven stars is accurate. However, if it is supposed to reflect your level of enjoyment, then something has gone horribly wrong with the reviewing of this movie. Save yourself the time and effort, and avoid this like the plague.",
        "Good if you like giant robots battling giant aliens. Good plot, continues in the sequel.",
        "Weak story but action-packed plot. The movie is visually appealing and colorful.",
        "Long, drawn-out and insubstantial. A kind of Transformers for a more intelligent audience, but that really isn't saying much at all. There is some semblance of a story, but you don't care a fig for anyone and there's absolutely no sense of jeopardy. Overall, almost pointless.",
        "As a child of the 90s I loved TMNT, robots, ninjas, and more. Seeing a well funded and crafted film with giant robots fighting monsters is great. Had I been born 15-20 years later this film would be the greatest thing I'd have seen.\n\nAs an adult I still enjoyed watching this. It did take me back, but it's difficult to enjoy it entirely without noticing it's flaws. It has a few but it doesn't stop one enjoyment. They just make you want to question the crew, e.g. why not use swords straight away. Forget the blood theories, the ease of using a sword makes complete sense when punching and pummelling a kaiju causes property destruction and increased chances of death for pilots.\n\nAside from that and some ordinary acting in parts it's a fun film. See it if you have the chance but don't go out of your way.",
        "I thought it was actually a pretty cool movie. Robots fighting sea monsters may seem like a stupid concept but if you keep an open mind and use your imagination then you might just enjoy it too. I wouldn't personally classify it as a blockbuster as it needs more than just a big budget to grant that title but it's a good sci-fi action movie.\n\nThe character development seems a little weak though. And some of the characters are just plain annoying. Also what's the point of the two pilots. It seems like an odd plot point. But that's probably my biggest issue with the movie.\n\nDon't go in with high expectations and you won't be disappointed.",
        "I think this movie was a a good success. It involves different feelings, different concepts.\n\nOverall film has a flowing, easy to watch, easy to enjoy feel to it. Character dialogues are fun, simple and have a sensible feeling to them. Visuals of the epic monsters and the power concept is also smooth. I also liked the touch of dual piloting to introduce a so called 'deeper' layer to the film. It was cheesy but it fit! Knowing its place and not being an assertive film, it still is able to back itself and ensures a satisfying time.",
        "You have to think hard to find a bad Guillermo del Toro film. I can't think of any, and this one won't be one either. It is a clear winner. To me, I think it is the best monster movie since Jurassic Park, and the best sci-fi invasion movie since Independence Day! Look, there is no need to discuss the movie in detail. Just go see it. You'll enjoy the fun. It is quite original in many ways despite the large monsters and giant robots. Trailers, while good, simply cannot do justice to the brilliance of the movie. If you liked Hellboy, you'll like this movie. If you liked Pan's Labyrinth, you'll like this movie. If you liked Mimic, you'll like this movie. It's got everything. The whole plot and story works hand in glove! The production quality is superior!",
        "First off, Del Toro is a visual director,that is fact.In this movie he steps into a level all his own. At face level this movie was a Mech versus monster movie and that's what it is. The underlying stories are not bad,they aren't done as well as they perhaps should have. The underlying story may not come out as effectively as some people may expect but that does not distract from the overall fun factor. This movie has a good level of comic relief especially from Ron Perlmans' character. There are some pretty strong characters too, Idis Elba for example is his usual brilliant self as stacker and Ron Perlman as Hannibal Chow is genuinely funny. Overall this is a very good action film, if you appreciate action, give up an hour and a half or so of your time and you won't be disappointed.",
        "Pacific Rim has to be one of the best Robots vs Aliens movies I've seen in a long time! It reminded of the classic Power Rangers in how they form into their ultimate suit to beat the bad guys! Well, the aliens in Pacific Rim are colossal size as well for the robots! Seeing this movie in theaters is a must, especially in D-box because those fights scenes are so intense you feel the punches, the sound of the robots clanking and the aliens screaming is magnificent, the quality is superb even if your not Imax screen, you still get the same feeling.\n\nPacific Rim is win for me!\n\n8.5/10",
        "What can I say about Pacific Rim? It is everything that a Sci/fi-Action Film fan could ask for. Even fans of the classic Godzilla VS. Films will be beyond satisfied. The CGI is fantastic, The Plot (Yes there is quite an intricate one) is methodical, The homage to every part of so called nerd culture is there for the taking, but most importantly...it is director Guillermo Del Toro's best work to date..along with being a master class in making the perfect summer blockbuster.\n\nIt is so hard to talk about without giving spoilers so..i'll just say this...No matter if you are a casual or hardcore film fan..Don't miss Pacific Rim! Films like this do not come along very often!!",
        "I had heard really good things about this film. I had pretty high expectations, especially because I really like the director but this movie just turned out to have all the negative things that Del Toro has. There was nothing believable about it and the fighting scenes just seemed too power rangers. It was a very bad mix of Transformers and the first version of American Power Rangers. I clearly remember at moments thinking, \"I saw this scene in Power Rangers when I was in 5th grade.\" WTF I think there wasn't much salvageable about the movie. The acting was pretty standard and overdone which is common for this type of movie. The special effects weren't anything impressive. I didn't see the movie in 3D so maybe I miss some of the point of it but in a standard quality, the effects just liked average. At some point I was expecting Godzilla to pop out.",
        "Del Toro is disgusting as ever. The design of the monster is awful. The visual effects look utterly fake. The action sequences, plot and setup are all unconvincing. The storytelling is a mess.",
        "A well made movie with a respectable plot and good characterization. Tbh there is nothing special or particularly anything too interesting in this movie but still a good movie for you to waste your time on\n\nSolid story though too linear. Very good visuals and sound effects. The kaijus and jaegars looked awesome. Good characterization, though nothing brilliant but still well written and unique nonetheless. And good acting and writing.\n\nOverall an enjoyable movie.\n\nMemorable: No. Rewatchable: Unlikely..",
        "This movie was outstanding i loved everything about especially the fighting scenes between the the Kaju and Jaegers were so intense and unpredictable. I was so in to this movie I was on the edge of my seat. The special effects were probably the best I've ever seen in a movie. To me story doesn't really matter i just like lots of action and explosions and this movie had exactly that! Just the idea of robots fighting aliens was what made me want to see this movie and it delivered everything I expected. I still don't get how they make the action scenes so real with special effects. It just baffles me how real they look. This is definitely a must-see movie anyone who loves Sci-Fi movies would love this movie. Give this me a 10 out of 10!",
        "I once found this film mesmerising and magical however there's no rewatch value. The characters are poor and at points things become a bit of a mess story wise. One of Del Toro's weaker films but not all bad, a true passion project with a good sequel it's worth a watch just for the sake of it",
        "Pacific Rim is a movie that knows exactly what it wants to be and delivers because everything put to screen is executed wonderfully. The performances are spot on and the actors really do make you care for the characters even with very little development or exposition. I liked the fact that the movie is its own sequel. Meaning, they cut through all the origin and set up of this world in the first 15 minutes. It's like a built in fast forward button. As it was unfolding, I kept thinking to myself that they are skipping over some pretty big and important stuff. Stuff we'd like to see and maybe should have seen. Yet, that wasn't really the case because what was left perfectly fit the story and certainly delivered the monster VS giant robot action everyone paid to see. The monsters are truly frightening and the CGI very well done. This film's budget has made news but at least it felt like they spent everything on screen.\n\nOverall, this was a very fun trip to the cinema.",
        "Take Independence day, add Transformers (the first, good one) and blend together through the striking style of Guillermo Del Toro, and you have a triumph. This kept me enthralled from opening to sneaky post credits bonus. As someone who has become very disillusioned with CGI driven, plot and character empty titles such as all the Iron man films, this is in a totally different league. Proves that massive monsters and destruction on a global scale can be awesome when done by a film maker of Del Toros skill and vision. Fun, nail biting, dazzling, great characters and performances. There's not much else needs to be said, just see it. I can't comment on the 3D, I gave up on it some time ago, but in 2D it rocks!",
        "Giant, multi piloted robots fighting giant monsters? Sounds like power rangers.  This is an old idea.  I think the movie was OK, but the anime theme was distracting, unnecessary and alienated the bulk of the target market.  *NEWS FLASH* More people DON'T watch anime than do.  \n\nFor all it's special effects budget, the robots were slow, clumsy, fought mostly with ineffective punching, and towards the end, began wielding swords that they had all along, but just never thought to use.  Fun for the kids, but the glaring plot holes, anime clothing/haircuts, & the unimpressive acting will leave serious movie-goers wanting.  Subpar work, Mr. Del Toro.",
        "I'm usually the one defending the blockbusters, I even liked Green Lantern (kind of) but man this film is a pile of crap. I was going into this having watched The Man of Steel and was thinking with lots of money you can make a good film out of anything these days. Well, I was wrong. Almost every scene with no kaiju in it is painfully bad. No characters, no dialogs, no ideas. Everything is so corny it's just pure irritation to watch. The characters are so unrelatable I could not care less for what was going on. A suicide to save the world? Whatever... And that part with a sword in space just blew my mind. They are fighting kaijus for 7 years now and haven't figured out by now how to use a sword which just slashes the poor beast in two? Oh go to hell. So overall unless you bet you life that you'll watch every blockbuster ever made, stay away from this.",
        "I had no expectations while watching Pacific Rim, even I saw the massive 7.6 rating here at IMDb. I didn't look for a realistic masterpiece. I just wanted to be entertained for two hours, like I was entertained by Hellboy.\n\nWell, I was not at all disappointed. There were some excellent special effects and fights. Especially Gypsy danger kicking ass of every Kaiju she encounters. The story was decent, and if you look for plot holes in an action movie, you cannot enjoy it, ever.\n\nOne thing I didn't like was some cliché situations, such as Raleigh's escape from his past, a 'only you can do it' re-call by the chief, and some buddy pair scenes. Rest was awesome.\n\nGo for it if u want some mind blowing robots vs alien action.",
        "Not very bright screenplay. Pathetic in places. I think it was really a plot to get people to buy tickets to a dinosaur film. I was rooting for the dinosaurs. However, the pea-brain sized dinosaurs were smart. They had high SAT scores. This was a sad disappointment. Thankfully, I did NOT see it in 3D. They wanted another $4.50 to see it in 3D. Also, you could not discern the robots from the dinosaurs in combat thanks to the terrible cinematography. You can't see who's winning the fight. It is schmaltz to the 10th degree. Save your money. See it on TV in ten years. Oh, and one more thing. You need sub-titles to understand the Australian. gidday.",
        "not sure how to fill ten lines with this review. I mean it's a film with giant robots.. fighting giant monsters...\n\nthe fact they try to add some sort of story gets in the way. Not much though, as it's pretty much fight scene after fight scene. Which is great.\n\nThis film is ALL about special effects, if your looking for anything else don't bother\n\nNot sure how this will look on a small screen, it's more of a 'cinema film'. So if you can't get to see it in the cinema, watch it round the house of which ever friend has the biggest TV.",
        "One of the first things the film said really spoke to me: many looked to the sky to find aliens, but what they didn't know was that it was below them all along. With many films taking the overly engineered aliens with ultra advanced tech, this one worked backwards, looking at something virtually no one looks at (basically sea monsters). With the classic 'pin 2 cool creatures to fight with each other' trope known all too well, this was a promising film. But alas, my expectations were too high. Though good, this show was not a standout by any means. And though its tolerable, the plot holes in the film (where suddenly the issues talked about in the first half of the films were suddenly solved without explanation? Just seems ludicrous to me. Either way, if you were to look at this at the shallow surface level as a film that would do nothing more than to just entertain, it has done its job. And a good one at that.",
        "I had high expectations for Pacific Rim, probably because I considered Guillermo del Toro a competent director and I thought that this movie would have a little bit of the Portal vibe (in the trailer they made us believe that the voice of GlaDOS would be more prominent in the movie, but no, it was plain white noise). This movie is a waist of time and money. If you believe that this will be a serious movie, your are wrong. It is a movie for 13 year olds that liked to play with Beyblades and watched Digimon, it is just a display of cgi abilities. The script is bad, the acting is bad, the clichés are terrible. Do yourself a favor and don't waist money on this movie.",
        "This movie does not claim to be high art or professes any values or deep though experiments. This is a movie about giant robots fighting giant monsters.\n\nAs far as giant robot movies go, this one is infinitely better than the dilapidated Michael Bay mess he polluted the universe with. This is competently shot, the story is coherent and easy to follow and it is well structured and decently acted.\n\nIf you do want to turn off your brain and enjoy some nonsensical action entertainment. I'd suggest you choose this over that other giant robot franchise which is so utterly bad that it is not even worth giving 1 star and a review. Those movies do not exist for me.\n\nThis however is allowed and has some merit.",
        "This movie was absolutely amazing! The visual effects were out of this world and the soundtrack composed by Ramin Djawadi was just downright epic! The story line was good as well as the directing. Exceptional acting by Charlie Hunnam and Rinko Kikuchi. Del Toro out-proved everybody with the amazing sets as well as the realistic Kaiju's. The \"drift\" story was original and interesting just like this movie. It is actually amazing how these sets were made in real life including the huge head of the Jaeger. Charlie Day's character got a bit annoying but Ron Perlman definitely handled his part like a legend. Without doubt, this movie is worth a watch, and most probably a second! Hopefully there is a sequel in the works, so we can enjoy another original masterpiece!",
        "The action was good. obviously right? that's why you paid to see this movie. However, judging by the ratings of this movie, i was expected more than just action, but actually a decent movie... boy was i wrong, my friend and i both walked out of this movie saying god that was just a horrendous mess. There was almost no plot in this entire movie, and the plot it did have was corny and highly predictable. Several touchy scenes designed to provoke emotion were incredibly obvious before they happened, as virtually everything was. There wasn't a single twist or anything that caught me off-guard.\n\nThat aside, it was visually appealing and the action was good, which is why i generously give it a 4. Also, Ron Perlman was on point.\n\nCGI - 9/10, Acting - 4/10, Plot - 2/10",
        "Speaking from adult's point of view, this must be the most complete idiotic POS movie ever filmed by Hollywood - it just can't get worse, can it... for cinematography educational purposes, just watch older Japanese Godzilla films - at least, those don't pretend to be something they are not. Good children's waste timer... er, entertainment - doesn't deserve any grown person's look, whatsoever. I just had to watch some of it, as a part of a whole party - but, it wasn't nearly worth that great food that I had there... Now, there are some ridiculous guidelines to these reviews, that require me to put at least 10 lines of text here - but, what, if there is nothing to say about this film, but a few curse words?!",
        "Pacific Rim sets a standard for 21st century movie production. It deals with an international struggle between the forces of good versus evil. The force of good is represented by the Jaegers. Jaegers are giant robotic machines\u0085 visual binary intelligence piloted by \"drift- compatible\" human pilots. In the struggle against evil monstrous alien creatures, Jaegers must fight the hard game and win. The joint visual binary intelligence must defeat the draconian beast. Together\u0085 we find that we are the last hope for the force of good within humanity. You are either with us or you are against us. There is a struggle for the force of good that unites peoples. And there is a cause of light within us\u0085 really a cause of light and order and unity that facilitates our own personal and collective evolution. We are looking forward to the joint-intelligence magic, media, merchandise, and movement from great movies like \"Pacific Rim\" that inspire the youth of our generation.",
        "The story is so predictable and common. It's like \"I've already seen this. This is what's gonna happen next\" - and it's frustrating that I'm always right. The acting is bad. The lead actors have only one expression on their faces. It doesn't help that the lead actor looks really alike his rival. The effects are decent. The fight scenes at really boring... The other one would just stand there waiting for a punch to hit him. Are we back in the 70's? After seeing movies like transformers where the fight scenes are fast and realistic, this movie really makes a really sleep-inducing fight scenes. The scientists and hellboy's characters here makes me feel that I'm watching an 80's movies, which is most of the time good. But here, it's annoying! I'm not really sure why so many people like this movie. I hope I can see what they see in this cause I am really looking up for this movie to be a great one before seeing it.",
        "Pacific Rim is a movie best enjoyed by fans of Science Fiction and action packed movies. The movie best reminds me of those rock 'em,, sock 'em video games -- monsters and robots. The movie is colorful and holds your attention. However, to me, the story gets old fast. I really don't think that there were any acting challenges, except for the wildly creative monsters and their movements. The monsters remind me of the ever-ready battery commercials -- they keep coming and coming and don't stop. Overkill is the act of the day. This movie is great for a party or having a bunch of friends get together. I give it three thumbs up for its colorful action.",
        "This movie is the most boring movie i have ever watched as at 3pm i fell asleep watching this in a car and i had forgotten that i had watched the movie until i saw something about it.",
        "This is a fun mech vs monster movie that did not disappoint me. I think it could have been better but I'm honestly not sure how. It's a fun watch that really deserved a good sequel, which it most definitely did not get. However, the recent anime on Netflix is a worthy successor",
        "Pacific Rim is basically what the previews have shown. Nothing beyond that. It's a combination of Colonel Shikishima of 'Akira', the technology and look from 'XCOM Enemy Unknown', with the gritty set designs of 'Martix Revolutions'...and the bad acting of 'Starship Troopers'. I found myself yawning, a lot. If you want a sense numbing sci-fi depiction of robots vs monsters, go ahead and pay the money, don't forget a pillow for the other 80% of the movie with boring human interaction and uninteresting back-story. So now that I have done my little criticism, I just hit preview and IMDb wants at least 10 lines to finish my thoughts on this film. There. There now is my 10 lines. Buy!",
        "I don't care what anyone else says, this movie is the epitome of entertainment. The clearest proof of that is that it withstands the passing of time. Over the years, I watched \"Pacific Rim\" 3 times, and every time I enjoyed it greatly. Its weakest link is the silly performance of Charlie Day, impersonating an implausible scientist. He is supposed to be funny, but instead is just obnoxious.\n\nBurn Gorman is also a bad choice. Together, the 2 annoying \"scientists\" are the worst flaws of this otherwise great movie. Fortunately, the story, and especially the music, make up for the casting flaws.\n\nThe story and the soundtrack flow together at a perfect, upbeat pace that holds you glued to the screen for the entire duration. This movie gets your adrenaline rushing, and provides great entertainment.",
        "The 1 star rating applies to the writing and directing of the movie. Sure, I didn't expect Shakespeare. Movies like The Rock, or 007 I find entertaining.\n\nHowever, PR went above and beyond to provide a shitty experience. The writers should be barred from any movie writing. Even 2 year olds shouldn't be exposed to this drivel.\n\nIf you want to make a movie about \"big robots\" there is plenty of good stuff around to license. I understand the cash grab mentality to create your own IP, but this stinker should have been sunk to the bottom of the Pacific ocean, nuking optional.\n\nIf you enjoyed The Phantom Menace I'm sure you liked this one, too. The rest of us will be busy scouring our souls from this taint. The only positive thought is that I didn't drop $20 to see this in the theater.",
        "With Pan's Labyrith Del Torro gave us an amazing fairytale, With Hellboy we were amused by the fatalistic/sarcastic main character. But with Pacific Rim del Torro completely lost it. I guess that is what you get when Hollywood pumps in too much money. It was so predictable that I could only laugh, and I also laughed at the stupid dialogs, and I laughed at the stupid explanation of where the monsters came from. And the funny twists were not funny at all, a toilet being at the right place and a monster comes to live once more to...OK no spoilers. The characters were thin and sometimes even ridiculous. Why did Del Torro let himself in with a script like this, he showed he can make fantastic movies?\n\nI'm wondering where to put this movie on the 21st century low list, between 2012 and Avatar I guess, at the bottom of this list",
        "First off i am a huge fan of this genre/type of film so may be slightly biased.\n\nI recently got pacific rim on 3d Blu-ray and i have to say the 3d is probably the best i have seen in a movie to date outside of the cinema, its not pop out the screen type 3d but more depth, like looking through a window. No its not the most original story, no the acting isn't the best, but the fight scenes are epic the monsters (kaiju) look fantastic, the jaegers are amazing and the actors appear to be having a cracking time of it (Charlie Hunnman has the biggest school boy grin in the beginning scene when first in the jaeger syncing up with his brother).\n\nOverall as long as you go in to this and can level with the fact that the dialogue isn't going to be hugely important and yes the acting is a bit wooden, basically turn off your brain and you should thoroughly enjoy yourself.",
        "This movie does nothing more than to entertain, no serious overarching narrative, no dramatic character deaths, just pure monster smashin' fun. Get over it that's the point, the VFX are amazing and the mech and monster designs are all unique and really original. My only gripe is that the characters are all pretty forgetful. (I do like that scientist guy tho.) great movie to turn your brain off at and have some action packed fun.",
        "This film may be a stupid, illogical mess from start to finish, but through great direction, set design, soundtrack, acting and special effects, it remains one of my favourites of all time and an absolute must watch for anyone who wants to kick back, turn their brain off and have a laugh.",
        "I have to admit that I was a bit skeptical at first but cant help to get excited upon seeing the first trailer. I have always been fan of Ultraman,Gundam,Kaiju movies and mecha animes.Non of it ever make it in a big screen but this is as close as it gets.Big big nasty monster..all of different kinds..one can fly like a bat..another like a crab..shark etc..the action is superb in my opinion..actions are raw as i like it..I like the scene where 3 jaeger vs 2 Kaiju in HK..sooo awesome.The acting is OK..the mind drif neuron connection was an interesting concept that added depth into the struggle..I will watch this again with no doubt..So far this is the only movie that didn't let me down after all the anticipation of a big summer blockbuster..iron man 3 was a meh for me..man of steel is just OK..but not this one..all the action n scenes..intact in my head..so much of boom boom pawww!!",
        "For 2013, this movie was really good. Even comparing to 2021 movie styles. Even though there were few lakings in storyline. But it was okey. Not worth watching but you will not regret after watching it. Good one.",
        "The story is very interesting. The characters were enjoyable and were good acted. It has some good twist, but it wasn't that mind-blowing. The action were well-made, and it had some very good CGI.",
        "Colourful, loud (Lots of actors shout a lot)boring, not engaging, over- long or so it seemed and frankly a huge waste of money and talent. I expected so much more from Guillermo del Toro but this film spectacularly under-delivers on virtually every aspect. Some of the acting is atrocious, the characters cliché and the story almost non-existent. Idris Elba looks like a man who got a nice pay packet but almost instantly regretted signing up for the movie, almost as much as I regretted watching it. How it rates over 7 on IMDb is a real puzzle. It is a shocking film, shockingly bad that is. For an idea on how to create a great creature feature watch Cloverfield.",
        "Guillermo del Toro is a master. He's a great director and his eye for the visual is unmatched. (Hear that Michael Bay). This is the Japanese mecha tribute movie that fans of the genre have been waiting on for years. Del Toro convey's the weight and heft of these massive robots and creatures to perfection. The fight scenes are not lost in a dizzying array of CGI. They are focused and matrix-esque fun to watch. Moreover this is just a fantastic fun popcorn flick that has some great messages about team work. The pace of the movie never really gets boring and the nice little tidbits that pay homage to classics like Ultraman (The creature style and markings) shine through without being overly corny. Go grab the kids, get your popcorn on and enjoy this roller-coaster ride for the senses.",
        "The movie is for children ( and those that are not fans of science fiction). I would say Star Wars with it's sound effects in space makes less daft mistakes. And if you don't see the end of the film coming, you probably didn't know what was going to happen at the end of the titanic or the passion of Christ. This is worst than the last Indy movie.\n\nIt tries to be a Japanese film but is nowhere near the standard, it's embarrassing. It should have been re-written by Japanese writers & made in japan, then it probably would have been quite a decent story and script. Guillermo has disappointed.",
        "I must say that with the lack of major promotional support (i mean a lot of people i talked to did not even know about this movie)i did not have very high expectations for this movie. I just figured that the studio figured it was going to be a bust but they would release it anyway but decided to save a few advertising dollars.\n\nBut i was so wrong. This has got to be one of the best action movies to come out this year. The CGI is almost flawless, the action sequences are great. The first 90 minutes are just pure movie gold. The last 30 are not as good. But boy is this movie one hell of a thrill ride of a movie. I highly recommend it, and do not listen to the critics make your own decision and my bet is that you will thoroughly enjoy it too",
        "Del Torro hits it out of the ball park with this flick. The Controlled balance between story and action is perfect. A solid movie in all fronts. If you like robots, monsters and mix of good drama (no matter how superficial it my be) then this is a movie is for you. The little ones will not like it so much and the movie is very loud and there is a lot going on the movie that they will easily get lost. The older children it is fine and may appreciate more the movie that the little ones. How I know this? Standing in line and see what type of people are in line helps, and while the movie is playing you can hear the little fuss during the quiet scenes and the cry during the loud. While the family behind me the boys said \"wow! awesome!\" a couple of time. GO and see it! Can't wait for Hellboy 3!",
        "This is my first time to watch Guillermo del Torro's directions experience on high-digital movies. Watching Pacific Rim is like watching Japanese's robotic movies, despite of its technical performances. The origin story is quite original, coming from ideas of monsters coming under our world, human world and the emergence of a hero, very big hero, to destroy them. On the view of technical performances, nothing but big, huge, and robotics. I can't imagine how genius is Guillermo del Torro to manage his art team. But that's great job! Viewers can feel the feel of being a monster itself, being a big creature. That's why I can't recommend this film on DVD. My last review touches the story and actors. The story is smooth-shocking viewers, but the ending is romantic, as always :) On this movie, we find some new coming actors, but within them, there are several action actors, so we can also watch some actions as defined on our imagination. Thank you Guillermo del Torro!",
        "Just had the misfortune to watch this again. It was irresistable to see if it was really as bad as I remembered. Why oh why did they not make this as a cartoon ? Sometimes really awful films can be watchable for the wrong reasons but this one just begggars belief that any actor/actress would have their name sullied by this piece of unadulterated trash",
        "This is the first review I have ever written even though I've been on IMDb for years. I loved this movie so much that I had to tell people to go see it. This movie is a masterful blend of bad ass action, drama, emotion, and everything in between. Del Toro has outdone himself and I sincerely hope there is a sequel in the works. The effects were realistic, never overworked. I found myself gritting my teeth and squinting my eyes as they fought and cheering them on in my head. I never do that. The whole premise felt new but plausible and the creatures were a perfect blend of otherworldly and unexpected. They actually surprised me more than once. In conclusion, this movie is for everyone. I plan on seeing it again in theaters before buying it. Please do not deny yourself this film. I even felt the inflated price of 3D was so worth it.",
        "What more could you want/expect? It's got good action scenes, great CGI for the times (I'm sure the graphics will date themselves eventually) Don't overthink or overanalyze and just enjoy the movie.",
        "\"To fight monsters we created monsters\", is the tagline of this movie. Where humanity is threatened by giant monsters, who can only be fought by Jaegers, gigantic humanoid mechas controlled by two pilots in a hive mind. Leveling skyscrapers, destroying entire cities and killing thousands of people as collateral damage, in the process.\n\nBut the people are just cheering them on, and behave like sheep.\n\nThe message is clear: the individual human is small and insignificant, and just a cog in the state machine. Civilization and human rights be damned.\n\nHave there been made any more Fascist movie than this, in recent times?",
        "Basically what more can you want in film? Robots, monsters, all as big as skyscrapers, punishing each other. It's basically a child's day dream after buying a new toy at the toy store. And that epic soundtrack to boot.\n\nAs a film, couldn't fault it on cheesy one liners and simple plot, but I came for robots smashing monsters with a boat, and they delivered.\n\nIf you can't make a great story, make a good ish one, BUT WITH EPIC BATTLES WITH MONSTERS.",
        "I think it is a challenge to make a good movie using the classic Japanese clash of giant monsters vs. giant robots. Just reading the story, you probably would think that this movie is utter garbage. And you would be right if Guillermo del Toro were not the director. Adding the right dose of humor, his imagination, good rhythm and action scenes, nice CGI, Idris Elba, and a pinch of del Toro universe (there are moments in which you are expecting Hellboy or some trolls will appear), the result is not that bad. The movie is not a great movie and will not be in the hall of fame of the cinematic art, but it is enjoyable and fun.",
        "Only today i watch the film and.....the only thing worthy are the special effects. The acting is lame. A movie full of classics clichés. Not funny at all. A bad blockbuster in my opinion. A script made apparently by a child. Similar to transformers 2. I prefer Hell Boy 1 and 2 that this. The CGI is OK.\n\nWhat happened with Idris Elba in this movie? I suppose is a script fault. And the two \"genious\" are pathetic, characters full of overacting.\n\nThis movie with out CGI was like Dragon Ball Evolution or The last Airbender.\n\nSorry if there's some mistakes in my review. I'm not very good with the English.",
        "Amazing & Tremendous Alien Contact Sc-fi and Philosophical Film, Also VFX,cast etc everything is just excellent Not just a robot film but Must Watch Movie for Allien Contact Genre Lovers, I really liked the film Best Regards",
        "Bombastic and ridiculous, Pacific Rim is a silly and glorious monster romp with stunning special effects and real passion behind the filmmaking.",
        "I didn't like it. The woman in the movie was a bitch and a even bigger drama queen... THIS IS NOT WORTH YOUR TIME. When you're drunk this movie actually only suck big time. I didn't like it. The woman in the movie was a bitch and a even bigger drama queen... THIS IS NOT WORTH YOUR TIME. When you're drunk this movie actually only suck big time. I didn't like it. The woman in the movie was a bitch and a even bigger drama queen... THIS IS NOT WORTH YOUR TIME. When you're drunk this movie actually only suck big time. I didn't like it. The woman in the movie was a bitch and a even bigger drama queen... THIS IS NOT WORTH YOUR TIME. When you're drunk this movie actually only suck big time.",
        "This movie is simply mind blowing, it makes you feel like you are actually part of the action. And come on who doesn't want to see huge freaking robots collide with colossal Kaiju. The fights are nothing exciting the collision between the Jaegers and the Kaiju are awesome. The story is nothing short of brilliant. The carefully thought out names and backgrounds of the Jaegers and even their powers adds a another dimension of awesome. The movie brings out the inner nerd in most The others who would disagree all I have to say is This movie is boss END OF STORY. This is a must watch.Even though it is a happy ending. A sequel would be pure epicness.",
        "It's a larger than life movie. If you like watching big robots it's the movie for you.\n\nStory isn't that great. Alien invasion. point. I like transformers for huge robots, style. The same thing happens with Pacific Rim as well.\n\nForget about the story. Action is more on style, at some point you may think how could it be possible. Ohh there is a mistake, but still you get entertained.\n\nThat's the specialty of the movie.\n\nWatch for fun. Don't be serious. Watch like a grown up kid who still likes Cartoon... !\n\nMy ratings 8/10",
        "The movie is solid and a very entertaining action flick. But it falls short on characters, not because there is too little plot but because there is too much cramped into the whole thing. And considering they are planning a sequel, I question why they didn't go for a trilogy in the first place. The story arc is compelling and the character development could be intriguing if it got some room to play out. But like it is, everything feels rushed and half baked. It's pretty much like Ender's Game. For me a great movie has time to show action, tell a good story and let characters engage the viewers thru the relationships between them - if they can't do it in 1 movie than go ahead and make it 2 or 3 movies. But when you go for such a first part and then try to sell me a sequel, I feel short changed.",
        "My summary says it all. This movie is basically just like the 1989 movie \"robotjox\", but instead of the robots fighting each other, they fight giant aliens. The acting is just as cheesy and the overall feel to the movie feels just as unprofessional as Robotjox as well.\n\nThe plot and the characters are a little cliché, but I have to admit, the special effects and action were very, very good. The movie wasn't a total bust. But this is coming from someone who even liked Robotjox just because it was so painfully bad, it somehow made it seem good to me, as if it was a parody of itself. Pacific rims doesn't quite do that for me, but it wasn't a TOTAL waste of time. I had fun, and I suspect anyone under the age of 14 will love it.",
        "Terrible movie in every sense. Of course it looks great, but even if you take this as a purely entertaining action-movie it fails on every other level than expensive CGI, and there is nothing new at all in this movie.\n\nStory? - Aliens fight vs. Machines piloted by humans + the usually lame romance and some characters you don't care about dying + the usually lame crazy scientists helping the military guys. Characters? none interesting Action? - The same fights over and over again, only the monsters get bigger over time. Music? - disgusting Also it wounds me every time to see Stringer Bell playing the same stupid military role again and again.\n\nIf you want to watch a good entertaining action flick go watch the new Dredd, Ironman or even some xmen movie but not this crap.",
        "Well, storywise there's plenty of reviews about this, so my beef is going to be about the noise levels. This movie seems to struggle with being too darned quiet when you want to hear what people are saying and too darned noisy when it gets to intense moments. I could hear it from 2 rooms away as if I was in the same room. My ears were ringing from the bass. The floor was vibrating, even the radiators were vibrating and buzzing, but as soon as the intense part was over it was too quiet to hear anything again. I was having to constantly adjust the volume control.\n\nYou really don't have to deafen your viewers to pump up the intensity levels you know.",
        "Good movie, which kind I like. It had a great idea to develop, but I think the action had to be more intence. I mean all the parts had to be more focused and sharing more of awaiting for the audience and making them wait enjoying. The plot seemed good, but with more potential. Now I see that I used more about 5 times here. And I am using last time, the movie could've been more...",
        "I'm a horrible reviewer, writer and expresser of thoughts, but I love monster movies. So why on earth would you go to a giant robots vs. giant monsters movie expecting Hamlet? While the plot is razor thin the monsters and battles are beyond incredible! There is enough plot to move the story along, the characters are likable and, while there is certainly campiness, it does not take the movie to stupidity. (I'm thinking Transformers 2) I will watch a movie simply for atmosphere and FX. That being said, Battleship was completely awful. Del Toro does not take us to absurd, certainly suspension of belief is required, but not to a point of eye-rolling, more like a huge grin because of the enormity of the monsters, robots, and positive energy in this film. Walk into this ready to pick apart every minor detail, plot hole, or sub-standard acting and you will have a bad movie experience. Put your beliefs on hold, enjoy what Hollywood has created and watch some great Monster vs. Robot action and you'll have a great day!",
        "This is my opinion and not a review. This is a great movie and a great story. The story makes the movie. Imagine there is a global conflict that only a few have the skills to attempt to solve it. These few, while they have proved skills (have solved this problem previously), have no authority to solve the problem and go rouge. There are so many additional movies here (training, discovery, the aliens, genetics, etc.) that this movie could span many hours to tell the story. Instead, the story, told in excellent fashion, provides the detail we need to cheer for our heroes. If you disagree, post here to tell me what I missed. Enjoy this one!!",
        "I was always a big Godzilla fan, and enjoyed \"Pacific Rim.\" It's the most mindlessly-fun movie I've seen in several years. I'm tempted to go again just because there was so much going on at the start and end of the movie that I feel like I missed some things.\n\nDon't go expecting Shakespearean character development or a deep philosophical message. It was a little like Avatar in that it's all about the visuals. Very little effort seems to have gone into the script and acting. In fact, the best acting in the movie was done by the little Japanese girl who showed genuine terror as she was being chased down by one of the Kaiju.\n\nI watched in 3D, and thought it detracted from the movie. Everything outside the very center of the glasses was blurry as hell.",
        "Well, there is no story-line in this movie. I watched in IMAX 3d. You can never see the full shape of the creatures. It will fully disappoint you, if you are expecting to watch out the battle between machines and the creatures. The glow inside mouth and the body of the creatures make the movie more childish. This movie is not even a combat movie. There are nearly five combats in which none of them are even good. The only thing which just makes you sit in the theater is climax. After climax, you will get highly disappointed. There will be two doctors in the movie whose role is almost nothing than one minute of explanation where he will discover how to destroy those dinosaurs. The massiveness of the creatures is too high such that you will feel like two planets fighting. You cannot see the combat clearly. One cannot understand who is getting the punch in the combat. No combat is in daylight. All combats are at night in the dark so you could rarely see the creatures.",
        "PACIFIC RIM isn't original; it got ideas from Robot Jox (1989). If you want a review of Pacific Rim, there are plenty; what can I add, apart from my five cents worth that Pacific Rim got ideas from a low budget, fairly unknown, sci-fi, mechanical monster film called: Robot Jox.",
        "It's about time to have a strong female role model in one of the new action hero movies. And one of the main roles here is definitely a strong, smart woman, fully clad, was not repeatedly \"helplessly saved\" by a man, simply a cool role model for girls and a cool independent female for the boys t admire :) Yes there were strong guys there too, but we need more good female role models for girls and boys that are watching movies today :) Thank you. Kudos to the makers of this film :) I did not go happily to this film, I was dragged by my sons and a film about robots fighting monsters sounded very dull. But I thought at least I might get a nap during the film. But this film is fun, very well made, good action scenes, not too disgusting so my blood and gore-hating 7 yo son could enjoy it totally, I loved it :) And, oh, yes, I'm a middle aged lady :)",
        "No one should go into this movie expecting a flawless story with an Oscar-worthy script and character development because that's not what you will get from this movie. This movie is about MONSTERS versus ROBOTS, enough said. Apart from the breathe-taking CGI and action scenes, this movie does surprise with some great characters that actually have depth and a story, especially Mako and the commanding officer, Stacker. Idris Elba delivers a brilliant performance, making the viewing of Pacific Rim a better than expected movie. As long as you know what you're getting into, Pacific Rim should satisfy and even surprise.",
        "Pacific rim introduces one of the coolest concepts ever!! SO how was the movie? Positives first: Good cast, great action sequences ,good visual effects , good mythology . Negatives - bland characters{except for a couple} and overall not a very memorable flick. I enjoyed te movie while watching it but have forgotten about it after .",
        "If you want to see an entertaining story and top notch acting you will be terribly disappointed. The story is as basic as it gets with tons of clichés and the acting is just plain horrible.\n\nBUT if you want to see huge amazing robots fighting huge amazing monsters this movie is just perfect. Colourful and clean imagery and entertaining badass fights. There are plenty of jaw dropping visual effects and I really liked how easy was to identify the robots and monsters (nulike in transformers).\n\nThe whole thing just sucked me in and I never had the feeling I was watching a two hours long movie. The movie knows what it wants to be and is a refreshing addition to the robot/mecha genre.",
        "OK so let's get straight to the point here. why do we all see movies? TO BE ENTERTAINED! Pacific Rim does just that. From the beginning to end the movie starts off explosively, throwing you right into the fight. The Plot is fresh the characters are well thought out, i loved Raleigh and Mako's chemistry it was well paced. The action was intense, come on, giant robots vs big monsters? how is that not cool? the CGI is gorgeous, very well done and realistic. Bottom line Pacific Rim grips you and makes you want more more. It is fun, entertaining and deep enough to enjoy, literally it's deep, there is actually and underwater scene at the end which is pretty cool and you don't expect the end. Pacific Rim based on entertainment alone 9/10",
        "At the time of this review, people rated it a 7.8 overall. That's what made me go to this movie along with some positive commercial reviews. WOW! What were they thinking!?! CGI was fine. If only humans would have been excluded from this movie. The leader of the Kaijus was the only one with decent acting skills. Otherwise, I would put this a notch above Skyline and you know how bad that movie was. Tried too hard at humor and hand-to-hand fighting / training scenes. Both were unconvincing to put it mildly. YOu take a risk with unknown actors/actresses and it showed. Remember Starship Troopers? They had unknown actors at the time, but at least the director made the movie flow. There was no continuity in this one, much less acting. Save your money. Wish I did.",
        "This movie had it all. Fresh faces, bleeping awesome cast, bleeping awesome effects, giant bleeping monsters, bleeping big a** robots, Ron BLEEPING Perlman and almost no cheese. It grabbed my attention all the way from start to finish. All cast members played their parts very well and I don't ever recall hearing any cheesy one liners at any point during the movie, which is a bonus.\n\nI only give it a 9 as I don't believe in perfection and the end left me wanting more. More robots, more monsters, more action and what comes next? It does, however, have everything needed to make a great bleeping movie.",
        "This movie may have a 6.9/10 rating but it's a 9/10 for me.\n\nIt isn't one of the more \"Iconic\" Kaiju series out there, but this is overall the best structured giant monster movie made so far. Everything in this movie just spells out Awesome. The action, the balance between human characters and the Kaiju, the story, the coloration and CGI, and the Soundtrack. Del Toro really outdone himself with this one. One of the only issues I have with this film is one character shouts another's characters name every 5 minutes.",
        "Giant monster vs giant robot blockbuster movie? sounds that it will be somekind of a transformers movie. Wait... it's directed by Guillermo Del Toro? I should consider to watch this because this could be AWESOME. And my decision was right to watch this, money and time well spent, this movie is a lot of fun. The characters were good, the acting was also quite well done, and don't even ask about the action? It's Spectacular! Well actually to be honest some of the actors were kind of over the top, but that's actually quite make sense. The action was not like transformers, it's very much better. This comes from a director can actually frame the action up, unlike Michael Bay that just puts action and action and explosions and we don't even know what's happening in the movie because it's not well done. Don't even dare to compare this to Transformers, because comparing Pacific Rim to Transformers is like comparing Jurassic Park to Theodore Rex. One of the best things about the movie is it's not just action, the characters are also important and interesting in this movie. We do care about the characters. Only very few directors that can pull this kind of movie off, this just proves how good Guillermo Del Toro is, as a director.",
        "I went in expecting eye candy and that's what I got. The SFX were enough to pull you into this alternate reality. However; the actors were limited by the dialog and the dialog was limited by the story limitations. The two scientist were the wrong actors for those roles and pulls my score down. In fact all of the characters were either miss- cast or poor generalizations of stereo types; even the bad guy wasn't that good at being bad.\n\nIn any case, pick any a disaster flick, rename the characters and add some giant robots fighting Godzilla sized monsters. There ya go. Not much more too it. It's not on my top 100, but it's not in the bottom 100 either. When it shows up on Amazon Prime or Netflix, I'll watch it again to see what I missed the first time; but I won't be buying it a full price, or even half price.",
        "I was really excited to watch this movie because the previews looked great, and Charlie Day is one of my favorite comedic actors. It was really disappointing, mainly because of the blatant sexism. I understand that Hollywood has to cater to the Eastern market because it is broke, but I don't think that is any excuse to assimilate Eastern outdated views on women into our movies. The (only) main female character in this movie is a tiny little Asian woman with a tiny little voice and she just needs big strong men to allow her to do things and save her. It is just over the top sexist. I stopped watching after a while. :(",
        "The CGI was really good, and action scenes were mostly entertaining. But the plot was really weak, the acting was plain terrible, and character development was non-existent. One scientist character is clearly meant to be comic relief but is Just So Bad. It was like watching a middle school play, instead of seasoned actors in the hands of an accomplished director. None of the characters were developed or endearing enough for me to care if they sacrificed themselves to save the world, or be happy if they survived.\n\nUltimately, why would humanity spend months and billions of dollars building giant punch-bots (with swords!) when they could equip planes with the same plasma cannons that seemed to always do the trick?\n\nDumb. I'm mad about the time I wasted watching this movie.",
        "The film begins with the introduction of a species of monstrous creatures from another universal dimension which did not really feel like a proper background introduction to the plot which basically is the fact that the origin of the story is quite messy. As the film flows in front of your eyes you get fascinated and excited because of the absolutely visually stunning CGI sequences. But apart from the several inconsistencies in the plot this film is hugely entertaining to science fiction movie lovers like me. This film has enough to keep you invested in its story which is why YOU MUST SEE IT....",
        "Pacific rim is a movie with some bad dialogue, easy solutions (human part) and some overacting. It's dark and when tries comedy is horrible and unnecessary because seeing giants robots showing up is already an entertainment. But knows what it is and the characters are interesting for the most part, the action is beatiful, the cgi perfect and the tension is wonderful. The colors and camera angles are beatiful and put an unique vision to a solid movie well put together.",
        "Ok, I get it... it's a movie about giant robots. That doesn't mean you can skip the plot, character development, or logic...",
        "I honestly feel kinda let down by Pacific Rim. However in some aspects I do regarded it as decently made film, stunning looking at times, with a great use of lighting for monsters and battle sequences making them work perfectly In this world. created by Travis Beacham and Guillermo Del Toro. However I feel most of characters are weakly written and not really that interesting as the film thinks they are. Pacing and exposition are occasionally on rapid fire, going from line the next line to the next without really understanding or setting stone what was just explained seconds ago. Overall I'm giving this film a 6/10. Its fine in some regards, but lame in others, but I can say this film would be a lot worse if it didn't as strong as a director as Del Toro.",
        "I came into this movie wanting to see big ass robots fighting big ass monsters from the sea and the movie completely delivered on it and it was bad ass. If you're looking for action you'll get it here. And the acting is OK I guess. Story was mediocre but it didn't try to be something it was not, IT'S ROBOTS FIGHTING ALIENS AND IT LOOKS COOL THAT'S ALL YOU NEED TO KNOW.",
        "It is similar to the first Transformer movies but with more adrenalin and less finesse, humor & interesting actors. I just barely managed to get through it, with the help of the FF butoon at times. Do watch the sequel from 2018 though, it is much better.",
        "Impressive special effects and visualizations. Storyline is far fetched with quite some gaps.",
        "On the special effects side this film truly deserves a 10/10. Some of the fight/battle scenes are absolutely brilliant and they do make watching the film in a cinema worthwhile. The plot, however, is not that far from what you would expect from watching an episode of Power Rangers. The bad guys are coming; lets morph into some big ass robots and kick their asses. Not a *single* part of the plot surprised me a bit and I can truly say that this has to be one of the most predictable movies I've seen in quite some time. The acting isn't that great either but my girlfriend was quite pleased with two hours of Elba and Hunnam.\n\nTo summarize: only watch this movie if you can be entertained by the special effects alone.",
        "Channel some transformers, Godzilla, aliens, a little of The Core, or Journey to the Center of the Earth ... you're going to please a certain audience. Add really good production values and Idris Elba, you please some more. Charlie Hunnam ... 'nouf said. Oh, girls ... Charlie goes shirtless; go get 'im. Oh, the review wasn't long enough; I'm supposed to say some more. Okay, I mean, kind of a spoiler if you're like me and like to go into a movie completely sight-unseen: we're dealing with huge creatures from under the sea who are essentially aliens. Oh, and we're going to do it with what are essentially robots that are about the same size and don't get all seized up when you drop 'em in water. Plus, when they walk in the water, there never seems to be a sudden drop-off that means the bottom drops out from under them. You just have to accept all that. But, a testament to the effectiveness of the movie ... you will. Oh, object lesson: don't be cocky.",
        "The reason i go to the movies is to enter, just for a few minutes, in a world that we cannot see in real life. The giant monsters seen in the Sinbad movies, Godzilla, Gamera and other movies made my youth so much better. Years later the world became more cynic, and the cinema followed the same. Lost were the fun of yesterday and only the original Jurassic Park kept the spirit of the genre alive. Fast forward 20 years later, and Guillermo del Toro made a film almost impossible: a giant monsters vs giant robots with a heart (i.e.: not Transformers). I hope it inspire the same level of awe to a new generation of children, and ignite a wave of quality monster movies. With Godzilla just a year away, Pacific Rim is the best entertaining you can get until the king of the monsters movie next year. Not perfect but close enough, a sequel could only be better.",
        "If you like action on a big screen with a good storyline, this movie is real good. The graphics were excellent. The details of the creatures were amazing. When I did see these Robots, they do resemble a lot like same solder in a game called Halo. I like how it started right into action. I like the story lines with a father and son and a father and daughter. Then at the end there was more than just one fight. I want to see this again in 3-D! If you can go see this in 3D, its worth your money. I hope there is another one.\n\nMy son and I enjoyed this movie! I'm a mom and loved it too! This is a great boy's movie.\n\nThis was much better than world world Z. That movie was not that good or even much action as I hoped. The gory scenes was missing also.",
        "If you like Anime and Manga then this is your ultimate movie if not, you still might be happy with the special effects and the the unintended laughs. In all the fairness most SF movies show disrespect for the laws of physics, however the worth-watching ones provide us with either a decent explanation (e.g. Matrix)or they just keep it simple in order to avoid potentially embarrassing details (e.g Kryptonite powers). Pacific Rim's director has chosen the nonsensical approach (e.g. Giant robots weighing thousands of tons are lifted by helicopters). It is not the abundance of plot holes that surprised me but the fact that many of them could have been easily avoided with minimal effort. It seems that the director was concerned only to deliver CGIs and clichés. Have fun.",
        "9.4 will be my score. Its hard to describe how much I was waiting for a movie like this. Probably more than 30 years when I first sat down and watched Mazinger Z on my TV. Loved it! The plot is predictable because of course it has the typical characters from an anime series. But still a great and fun ride. The Special Effects are spectacular and the Robots vs. Monsters fight are great. We have three big fights, one at the beginning, one at the middle and at the end leaving some room for some human drama and some silly sci-fi stuff. The acting was good but I felt the main actor of the movie could be a little more or show a little more charisma. Was so-so in times but besides that it was a blast!",
        "Are we smart?, just because we make a \"critic\" of a movie, that it should have deep trama and drama, amazing actors, and so other clichés of a \"good movie\"? Guys, for me, a good movie, is the one that makes u smile as a kid, makes u laugh, makes you say \"OUCH\", or \"Yehaaa!!\", or whisper \"OMG...AMAZING...\", Pacific Rim made me do all that, without much complication, the movie was amazing for me, just because it made me pass an amazing time, and that's almost the only duty for a movie, that's it.\n\nOf course there are clichés like the \"Super American\" characters, rips of looks of the characters and the robots, and so on, many other stuff that could make some \"professional at home movie critic\" jump out and say: MOVIE SUCKED!!! cuz i say!! and i feel like a smart guy\", bleh what the hell, it was amazing, for us the one that could get to enjoy that amazing 2 hour of FUN!.",
        "The previews for this film, frankly, had pretty much turned me off. I expected more over the top CGI effects with dreary dialog and a forgettable cast. Thank goodness my AC went out and I chose to seek refuge at the air conditioned cinema. The film's pace was quick and the story line tantalizing enough to hook me. The CGI effects were, of course, there in robust abundance, but - and this was what won my heart - they didn't steal the show from the human drama in the film. The characters are likable and even inspirational. No, these are not vastly deep characters a la Ingmar Bergman; they're more like the characters one used to find in the westerns by directors like John Ford and Howard Hawks. The heroes are archetypes, and the film takes on the qualities of a modern age myth. And to top it off, the film is a lot of fun, too. My hat's off to Guillermo del Toro.",
        "This film is amazing! It is a must see for everyone one, no matter if you are a girl girl or a Goth, this is the most amazing film of all time. I really want to see this film again, and it is even better in 3D. The technology used to create this film is incredible. It is definitely worth every penny. It isn't like normal films, it doesn't take forever to get to the action, in fact the first few scenes are action, so for all you action lovers out there, this is the film to see. I'm not usually into films like this one but I would definitely see this film over and over again, and it has some great actors starring in it. Overall, if you haven't seen the film already, then what are you waiting for?! Go see it NOW! xx",
        "What a movie! I had already planned to see it, and after seeing the largely favorable reviews from IMDb I was very excited to get to watch it. Definitely the best movie I have seen so far this summer, and probably the best one I've seen in 2013. (I know Django Unchained came out in 2012, but I saw it a second time in theaters in 2013.) Regardless, fantastic movie. I felt just the introduction to the movie with the battle with Kaiju off the Alaskan Coast was movie-ending battle good, and that was just the beginning! The movie's plot was good but not great, but really I wasn't there to see amazing plot. Taking it for a straight action movie this was possibly the best one I've seen. Enough Kaiju battles to keep me completely interested through the entire movie, and the bright spots of the plot were able to take up time in between Kaiju attacks. Not once did I feel bored or that the movie was dragging. Del Toro outdid himself with this one. 9 out 10, and only because I have to leave a little bit of headroom for the best of the best. With time maybe it will earn that last star. Go see this movie!",
        "There is bad acting in many places and the script is poor. It is over rated.",
        "A fun modern giant robot and monster movie. Not smart of groundbreaking but it had robots that punch monsters.",
        "To be honest, this film is about on par with the Sci-Fi channel's movies. The acting is awful, the plot is weak, and the explanations are just ridiculous. The characters are so cliché, it's rage-inducing; nobody is likable, and nobody is detestable.\n\nThere is a reasonable amount of action, although it's not particularly good action.\n\nI struggle to think of a redeeming quality, but suspect that young children and people who are happy with pure CGI action will enjoy it.\n\nI have no idea how this film scored so highly, and have never felt so old.",
        "My movie review of Pacific Rim: 1. It is all that is right with CGI and special effects.\n\n2. The movie can be summarized thusly: Monsters go \"aaaaarrrrrrrghhhhhhhhh\" and smash stuff and stomp and stomp and smash tall buildings.\n\nThen people in robots go \"pew, pew, pew\" with guns and stuff fighting monsters and AWESOME HAPPENS! If you've ever liked Johny Soko and his Giant Robot, Ultra Man, Toho Godzilla movies, Robotech, Gundam, Blue Gender, etc.\n\nThis movie is for you.\n\nYou inner six-year old (or five year old) will thank you.",
        "This is one of the outstanding movies of this year. You must see it on IMAX or some special 3D projection. On imax this was mind blowing... everything in this movie is huge. Each element is huge, that is why you must see it on a very very large screen. Enjoy it... it is completely worth it. Also the plot of the movie is interesting and they are approching a new idea in terms of aliens attacking the earth. They build the story of the movie with care and patience, in this way you are connected all time to the movie action. The characters are very well chosend and they do a really good job. This is a movie that must see at cinema.",
        "I didn't go into this movie expecting much.\n\nI was not disappointed.\n\nI was entertained, I felt it was worth the price of a matinée ticket, but aside from that, it was really nothing more than an FX movie. It was all eye candy and no substance.\n\nThe fighting scenes were pretty entertaining, but again, aside from some good action, they could have just blotted out all of the dialog. I mean, all that movie really needed was the ambient noise and explosions. It was kinda like Aliens vs Predator in that regard, the humans really just took away from the movie.",
        "This film was a breath of fresh air. It has been so long since I've seen a film that was about entertaining the audience I had almost forgotten what it was like. For 2 hours I was told a story- I wasn't bombarded with product ads, lame pop-culture jokes or \"tested well\" extra plot lines that muddy a film. At no point did Rihanna or JT appear. The plot is simple, clean and precise. Even the tangents and science fiction suspensions that get overly complex are tightly controlled and reigned in well. The narration is effectively used to quickly set up the film without bogging us down in needless back story. The characters are simple & effective. Nobody is complex just for the sake of being complex. The writing is also very simple- but again, it really works. I didn't have to make an effort to enjoy this movie. I didn't try to figure out what vapid point the director was trying to force down our throats- instead I watched robots smash monsters, the good guys being good and the bad guys being evil and scary. Thank you so much Mr. Del Torro for remembering why we go to the movies in the first place.",
        "Obvious and boring film.....like all of this type......waste of money Horrible I don't understand the vote of 7.9. There is no pathos, no idea, and full of yankee humorism. It has no action and there is nothing interesting. If you want to see it it's enough if you just watch the trailer and don't waste your time. It seems a low quality movie and it seems to be a parody of Transformers with all the big robots and aliens. Why would anyone rate this movie with a 7.9 Everything is predictable and as always the good guy wins and keeps the girl .Cliché.... It will only let you down and i would like to know why somebody thought of even producing something like this.",
        "What an excellent movie. Not to say that this was the best movie ever, but it's like Godzilla meet King Kong or something like that, but the concept is good, the graphics is good, i will watch this again. Hopefully they make a sequel, this movie needs one. Was very entertaining, like ROBOTECH.\n\nThe only thing that doesn't make sense in these movies is that appearance of huge creatures like these is a great change in the course of life on this planet, how can people shown, maintain their lifestyles as they were pre-creatures. And how can they easily deal with the creatures around them as if nothing is wrong. I'd be heading for the mountains and staying there.",
        "Excellent, definitely one of the best movies I've seen this year, for me I like the robot battles, I've seen in other films and series, well, I loved this. The effects were amazing, the story I liked a lot. Epic scenes had time no see, great speeches, those who are in the great movies. A film something different, which I think, was excellent, I recommend it without hesitation.\n\nWorth going to the cinema to see films like this. A shame I could not see it in 3D.\n\nBest quote: \"To fight monsters, we created monsters\".\n\nGypsy Ranger, what a warrior!\n\nWhat are you waiting for? Go see this movie now!",
        "This movie is deliciously cheesy, beautifully filmed, well-acted, .exciting as all get out, and an absolute blast. Very original and amazing in scope, with jaw-dropping visuals. Giant machines and monsters battling each other and destroying cities in the classic Japanese style. That said, the movie is NOT Japanese, but Master Director Guillermo del Toro's work. You feel the enormity of the giant war machines, the Jaegers. You feel their incredible size, and the earth-shaking vibration of every foot step. You feel the terror unleashed by the monstrous Kaiju from the depths of the Pacific. And you revel in the incredible technological wizardry of the battle scenes. It is awesome! And in classic del Toro style, he actually slows it down every so often so we get a glimpse into some very interesting characters. You are witnessing a master filmmaker at work. Go have fun and watch this film.",
        "Clearly not a masterpiece for 'giant robots vs. Monsters' genre, but it is surely an entertaining movie and fun to watch if you dont have anything to do. There are some nonsensical and cliche things but honestly I don't care that much.\n\nBut here is the thing, if you are someone who likes to see huge robots and monsters fighting each other or basically Mecha, Godzilla fans, this is definitely for you and you will love this movie as soon as you watch it.",
        "This is a a typical \"you don't need to think\" movie, I was hoping for more considering I like Guillermo del Toro's previous films. Unfortunately, it was a rather boring story, predictable and full of testosterone (in a bad way)... In lack of imagination they wrote a typical corny love story that you've seen a thousand times before. The character played by Charlie Hunnam sounded tired and bored, on the other hand, Idris Elba did a brilliant job as well as Rinko Kikuchi, which brings me to another bad thing about this movie namely that it is only one woman among the main characters, tiresome and old-fashioned, would love to have seen it a bit more up to date. The good thing about this movie was the special effects, they were actually quite powerful and impressive and that's why it's getting a 4 and not less.",
        "When all is quiet and peaceful, it just takes 1 second for everything to be turned upside down. Amazed at how quickly the world turned, made me think an apocalypse was gonna start; get ready to have your mind blown!\n\nThe spectacular visualisation of the unexpected come to life, it had me on the edge of the seat; eyes wide open and jaw dropped at what brilliant engineers can do with a touch of science behind it!!\n\nWill all be lost or will humanity be saved with bonds of a badass team against the beast!\n\nGo and find out! You'll not regret it!",
        "This kind of movie usually wouldn't catch my interest but I'm a huge Del Toro fan so I knew I'd have to check it out.\n\nAnd I'm glad I did as it was surprisingly good. Of course it's not a deep film but if you go into it to get swept along in the ride you'll have a lot of fun with it. The story premise is interesting, the action great, the art design of the Jaegers (the giant robots) and the Kaijus (the giant monsters) were fantastic and I might actually look into getting a Pacific Rim art book, the acting was good all round but Idris Ebla steals the show and there was enough human moments to keep you invested in the film without slowing it down.\n\nSo overall good fast paced fun just don't go over thinking it. I would recommend it if this isn't your normal type of film but are a Del Toro fan or if you're the type of person whose inner child would get a kick out of seeing giant robots fight giant monsters! 7/10",
        "Well, that was an experience.\n\nPacific Rim is a very good film with a powerful performance from Idris Elba at it's heart. It is an original story with original characters, which is refreshing in this age of comic book franchises and \"re- imaginings\". The fact the film has no big \"bankable\" star makes the film a risk in the eyes of the studio, but they overcome this with great performances all round, especially behind the camera. My problem is not with the filmmaking or the acting, it's the story. I think the story has some big leaps, some serious plot holes and a predictability that is unsatisfactory. Having said that, go see it, it's a refreshing change to all the other summer blockbuster action films.",
        "Pacific grim was OK.... If you ignore the worst script and acting I've ever seen, id even go as far to say that the movie \"the happening\" was better scripted/acted than pacific rim and thats saying something seen as though \"the happening\" is the worst movie of all time!\n\npacific gimp has amazing CGI going for it and It's almost the exact same film as Independence Day except with no A listers. So I suggest you go watch that instead. Just shake your head in the action scenes and you'll get the gist.\n\nIt was also so predictable that I could have written the story... On the toilet in between wipes.",
        "WTF is with the pretend Australians? There are so many talented Australian actors out there... why not engage one to play one of the Aussies?!\n\nUnless they tried that and couldn't get one because they could tell the storyline was bllsht? Perhaps. Yeah. That's probably it.",
        "I will say this for Pacific Rim; it has been the strongest and best Summer, \"popcorn\" movie thus far. The supposed $180,000,000 budget hasn't paid of yet, which is a shame (possibly because of the lack of star factor or franchise, advertisement effect?)because, as mentioned before; yes the clichés are there and it's rather unoriginal story-wise etc. though I couldn't escape the fact that Pacific Rim was ambitious and if your a fan of \"creature features\" this ambition was realised, kudo's Del Toro, who better to design creatures to attack a city than the creative mind behind Pans Labyrinth. Not to mention the fact that not only the robots packed a punch but this film also pacts an emotional punch....",
        "The universe is captivating and the soundtrack is extraordinary, a pure joy to listen to, the special effects may age badly but it's the same for all films of this genre.",
        "I know, I know, its got almost rave reviews from most people here but I beg to disagree. I am really surprised that they saw anything of significance in the movie and it's a total cop out from the Mr. Shyamalan we have come to experience so far. Sorry, I just returned from the movie before it finished, yes before it finished, and it's a total washout, if you ask me. I am not going to reveal the storyline but its a plot which is not uncommon, humanity threatened by alien powers in brief. The special effects don't come into the movie until late and am sorry it come out crap. It might have some subtleness in its scope but it stands no way in comparison to the much simplistic but brilliantly devised Transformers. It just misses the point of marriage of visual effects with cause and chronology. There are advance robots which can work with a drivers mind but limited by the actions of human physiology, how lame can it get. It's like a mega version of Real steel but without the character and emotion of that movie. Waste of time more than money, if I have to be frank.",
        "Pacific Rim is a must see for all fans of action. From the first frame to the last the action only ever stops for a short period of time. When the action does slow down it is for back story which was perfectly timed and placed throughout the movie. The visuals never disappoint and the acting was spot on. There was drama when there needed to be, comedy when there needed to be and intensity that only made it better. I give the cast and crew a big hand for their work making this movie what it came to be. My only complaint is that it wasn't longer. Some movie-goers might say that 2 hours and 11 minutes is more than enough time. However, this movie grabs you and brings you into the world of monsters and machines and makes you want to stay. This movie truly is the first blockbuster of the summer and is deserving of the title.",
        "I didn't bored even a minute while i was watching it.A combination of Quality images and good actors.Not so perfect but good a story.I believe that you can spend good time when you watch it",
        "Animation is good, but I guess the storyline is just okay, a tad bit boring, I mean I wouldn't say to never watch it, if you wanna watch a film that has a boring storyline then watch this one.",
        "I'll start with the positives, I think this was a fantastic looking movie, the 3D was awesome. The detail on the Kaiju and Jaeger's was excellent and the action scenes were fantastic.\n\nUnfortunately despite the positives i couldn't say was this anything more than an average movie for me.\n\nI found the acting to be pretty bad to the point it was borderline corny and this really spoiled the film for me.\n\nI wouldn't discourage anyone from going to see this you just have to know what you are getting so you won't be disappointed. If you want a film with lots of excellent action without too much thinking to be done then Pacific Rim is perfect for you.",
        "I didn't think that this was my kind of movie. To many machines and fighting. But it is very well made!\n\nI was complete into the movie. It was a very exciting one. Although you know the end when the movie starts.... I recommend this movie!",
        "Del Toro knows how to turn campy genres into meaningful stories - Pan's Labyrinth, Shape of Water - and Pacific Rim takes steps in that direction. It doesn't fully achieve it - the action is expected, you care less about the characters - but it's still enjoyable and exceeded my expectations.\n\nExcited for Pacific Rim: Uprising!",
        "I call this one hell of a movie. The action scenes were well made, the story was not really having a good effect. The actors were good. What I can say is that it is perfect, with the robots well designed. This is all I can say for now. Onto the next.",
        "I made myself sit this one out, hoping the story would come alive. But it is shallow, 1 dimensional and bluntly cliché. Unbelievable that actors were willing to put up with this. Total disappointment.",
        "I first, i want to say that this movie is really good, and worth to watch. They have done a very good job. The acting, the story, the emotion are good. The only thing i think it missing are the fighting scenes. The jaggers are destroyed so easily, there are only 4 jaggers, and indeed, only 2 can fight.\n\nMost of the fights are just hand-to-hand combat. The 2 jaggers have little time to show their ability. They even cant fire any missile or use any special weapon. They have a lot of heave weapons, but i wonder why they did not use them ( the weapons) in the beginning. Overall, i enjoyed this movie, and some scenes are really moving.",
        "Sometimes the fight scenes look really stupid. You find yourself wondering why you're watching it.",
        "I adored some of Del Toros more intellectual movies such as the Devils Backbone but this is just a romp and it is so much fun. It is really very well done with actors sneaking in some really good scenes and a lot of humour in between the monsters and robots. I also love that the giant robots have names like pole dancers.",
        "Okay if you are a mark like me for a movie about Giant Robots battling Monsters from another Dimension, then you will love this movie. The number one thing you have to know is that this is a B movie. Its meant to be goofy, implausible, fun. Besides all that, though is that it tries to deliver those qualities in the best possible way. It fully owns up to what it is and delivers those qualities 100%. Cool looking monsters and Robots, definitely. Bad ass action scenes, check. A somewhat hokey plot that still sounds cool, double check. Basically you either buy into the concept and enjoy a well made movie or go watch something else.",
        "This is an absolutely magnificent movie! I have seen hundreds of films and this movie is only the 6th that I have awarded a 10/10 to. All this year, I had been anticipating the release of Snyder's Man of Steel, with Pacific Rim coming in at a distant 2nd for my \"Most Anticipated of 2013\" list. Not only was this movie better than Man of Steel, but I am now prepared to say it is one of my favourite movies of all time! Not being impressed by Del Toro's Hellboy, I was a bit anxious when he was directing a movie about giant robots fighting aliens, but my fears were aside with an impressive first trailer. Ever since its release, I have always considered Transformers: Dark of the Moon to contain the best action in any movie (say what you will about Michael Bay), but that has now been figuratively shat on by Del Toro proving that there is a healthy middle- ground between heart-pumping \"mindless\" action and the making of a great movie. Giant robots fighting enormous aliens - it's not just for meth-heads anymore... Incredible film!",
        "My Son and I just went and saw PR in 3D and it was so hard to follow in 3D that we took the glasses off. I would recommend if you go see it, go see it in 2D. Not a bad movie but aside from the beginning which was short and the ending their was not much action in the middle of the movie. It began to drag on and the Character development was lacking and the plot was laughable. The beginning of the movie was where all the meat was contained as far as having a rich story, but Del Toro choose instead to skip over the most important part of the money as if it was just a side note. My Son became bored and dosed off in the middle of the movie as it became hard to follow. Hard to believe they would drop 185K and not have more to the movie. The best scenes were in the previews. If you do go, do yourself a favor and skip going 3D, you will be glad.",
        "The movie is a commercial movie to the fullest, with a lot of holes in the plot of the movie, but this does not negate that the visual effects were wonderful. It is a popcorn movie par excellence.",
        "A movie best appreciated by 11-year-olds but succeeds in drawing in the adults. The characters, as you would expect, are stolen from the comic-book warehouse of predictable heroes--which is great at this level of comic-book fandom. It doesn't attempt to reach the emotional apex of 'Aliens' or 'Invasion of the Body Snatchers'--which is a difficult route for sci-fi and horror movie makers due to the limited time or inadequate scripts; it's meant for unbridled fun and thrills. Creepy-creature-based sci-fi exists only for escapists and children; a well-made production which keeps you glued to your chair in this sub-genre succeeds in this manner, and Pacific Rim is that production.",
        "Let's get this straight: You're gonna like this if 1) you liked transformers or/and 2) you're under 15. And I'm not so sure about the under 15 group. To the rest of us Pacific Rim is a super shallow action movie with sci-fi elements, more American-action-movies clichés that I could count of, a 100% predictable plot, really bad CGI, plot holes and 2 hours of our life that we'll never get back. And in top of that, Pacific Rim is not even enjoyable in a \"guilty pleasure\" kind of enjoyable. It's plain boring from the first moment till the last one and other than the first couple of minutes where some interesting backstory is explained, I couldn't find anything else to hold on to. Just think of the Prometheus movie, only worse. Far worse.",
        "HOLY GUACAMOLE! Del Toro offers a Battle Royale between a group of super machines and alien beasts from beneath the ocean floor; more appropriately named Jaegers versus Kaiju. At the world's end, the only decisions to be made are those that make man more machine. Pacific Rim shows us that the human race can easily become the ants we so unconsciously step on. Did this movie have superb acting? No. Was the plot air tight? No. Were the special effects out of this world? Yes. Was this movie worth my $8.50? Heck Yes!! I also give the production team 2 thumbs up just for not casting Channing Tatum as the lead like every other dimwit in Hollywood. http://themovie-geist.blogspot.com/",
        "I was completely sucked-in to this movie. The fiction that was created for the movie was so awesome and believable, it was amazing! The story was brilliant and the ending was perfect. The characters where so likable and believable and the plot twists where so effective. Oh and the visual effects...wow. One of the best visual effects movies I've ever seen. The pacing was perfect. It could have gone wrong if directed by someone else but Guillermo del Toro did it perfectly. There were some unrealistic points in the film but the film makers know this and you just need to embrace that. The film has a consistent feeling which is really cool and whenever you think about the movie, you have the same feeling. I was so taken into the world of the movie, I felt it was real...and this was in 2D, on my computer screen. I can't wait for the sequel and hope it doesn't go in a bad way!",
        "I thought this would be another bad cgi, bad acted film, but to my surprise it was awesome! The other reviews saying this movie sucks are wrong on so many levels. It delivered badassery man/woman manned robots against monsters in a futuristic setting with apocalyptic tones. A must see for scifi fans!\n\nGodzilla would cringe",
        "Considering that I turned it off after 20 minutes, I can't really give a full review. However, I feel compelled to warn others, who don't particularly enjoy mindless, illogical story lines, coupled with acting which rivals what one sees in a WWE commercial. If that sounds like you, don't waste your time on this movie. On the other hand, if you enjoy WWE, over the top special effects, and can overlook 2nd grade level concepts of science and engineering, you may actually enjoy this film. In short, I suspect it polarizes most people. You will either love it or hate it...there's no room for middle ground with this one.",
        "I found Raleigh's character pretty boring. Robots versus monsters though, you gotta love that. The child actress was great but I feel like none of the adults really.... had... depth",
        "Like many other recent movies I've seen, I came out of the teather with a feeling that this movie had allot of potential, but got messed up in editing. Or maybe the recent growth is TV/streaming-series has make me more picky on character building.\n\nIn summary, Pasific Rim has great concept, excellent effects, decent action, decent pacing, lack of character building and horrible acting by Rinko Kikuchi. Her character could have been good, but it fails to deliver and is simply poorly executed.\n\nIt's a good action movie overall, but severely dragged down by bad acting and not taking enough time to get to know the characters involved.",
        "Pacific Rim is simply one of the best 'blockbuster' film of the year. It is always difficult to make a film like this, which is not based on comic books, novels or an established fan base. The film is mammoth in terms of production evident by the large scale design. The film pitches the massive Jaegers against the mighty Kaijus in an last ditch effort to save humanity. Rarely there comes a film that hits all the right nodes, be it action, direction, acting, story or visual effects. It has stunning action sequences and when not in action mode, the story keeps viewers interested. The film should get an Oscar for best visual effects! Guillermo del toro and his team of designers have so lovingly created every kaiju and jaeger that they deserve a standing ovation for their brilliant work. Charlie hunnam is a likable lead and Idris Elba has a commanding screen presence. The whole cast delivers and Ron perlman and Charlie day are hilarious!!!. All in all its a must watch for everybody. It appeals to the 12 year old inside all of us!!!!",
        "The Movie completely relies on Visual Effects. This movie could have meant better if the title was \"Godzilla V Transformers\". Storyline is poor. Story development looked as if they had the core and then fitted the character for movie. I guess Director tried to compete with Man of Steel, Marvel's Avengers in terms of scale of destruction. the movie is half baked. Background music is not impressive. This is one of the Movie where IMDb rating 7 above doesn't feel worthy. I Felt like a B-grade movie with sophisticated VFX. The Movie initially looked as if its being rushed for the climax and then in the middle you feel as if story is being dragged for the eventual climax. Highly disappointing.",
        "Wow.... I have no words, just wow.. Truly a movie that stands between an 8 and a 3, and I'm still not sure were to put it. It's sort of a movie you can't rate. There so much freaking awesomeness in it and so much epic things going on, and then you get the worst script, worst acting, worst characters to mix it together to a mushy, thick goo of delicious awesome! There are just so many things to say about this movie. Huge plot holes and just ridiculousness that keeps building and building. wow. A film I would love to sit down with my friends and talk about all the things happening on screen. But this has one of THEEE most EPIC fight scenes I have ever seen!! HOLY SH*T! It really is a movie you have to see to understand. Just wow. But my god that was one hell of a cinema experience! GOOD GAWWWD! Simply put; wow, what, I loved it!",
        "We have all seen too many awful monster movies, but Pacific Rim marries the world of the massive Kaiju and the world of the human pilots for the Jaegars (massive mechs) really well. This isn't just a monster movie. It's a movie where people from whatever background come together to fight together against aliens who are trying to take what it ours. This movie is so uplifting and positive. There is no evil exec who is trying to hurt the heroes for no reason at all. There are just brave men and women fighting against an impossible foe and winning. This movie shows the best in human nature, They fight and spoiler ......win despite some pretty bad odds, without it ever feeling cheesy or forced. Can't wait for Pacific RIm 2.",
        "I don't know how people can NOT like this. This was one of the best, maybe the best SCI-FI/action movie I've seen in a while. Worth every euro I paid.\n\nThe plot is great, very thought about. The details in the movie are quite great too, they left nothing out of it. It actually made me more interested in the movie and I hope they will make a few more. A 7 for this is just an insult to this movie. I saw the movie in iMax 3D and this will stick with me. Can't wait for the second part. Really enjoyed the first one, saw the movie like four times already. Most of the reviews I see here are a minimum of 8 stars, says enough right?",
        "This movie is just a mess !\n\nI never saw such a pity since dozens of years ! The screenplay is dull, the concept of the robots is stupid. Just noise and flames.\n\nNormally, with Science Fiction, anything is possible... With Pacific Rim, I could not believe it since the first minutes to the last seconds... The Kaijus and the robots are ridiculous. Even Godzilla of 1954 is more creative and exciting. I can't understand how so much money can be put in a so poor movie. I staid to the end just to see if there could be a better time. No, definitively not.\n\nMy English is not good enough to find the correct words to describe what I feel...",
        "I have never had more fun during a big screen experience than during this film. It doesn't get any better than this. The heart and soul of the film is as warm, charming, and lighthearted as it needs to be given its subject matter. Perhaps the most important aspect of this film, which is something that many 21st century blockbusters have forgotten, is that it doesn't take itself too seriously. This film exists to entertain its audience and give them the thrill of a lifetime. It certainly doesn't disappoint. Sit back, relax, open your heart, and have a great time with this treasure of a film.",
        "Entering this movie after seeing how people really liked it, I thought it would be top notch. No, it wasn't. It was just an okay summer movie with cool action scenes that are very hard to see because they're in the dark plus in the frigging sea. Acting was just okay. Idris Elba was amazing though. Plus Box Office fail really sad thing to say but this failed hard in the box office. Not one of the 10 best summer movies sadly. I would definitely put Iron Man 3, Man Of Steel in front of this , as I said not what I hoped for. Also my friend really hated the first 1,5 hours of the movie. But as the ending was great I would give it 7/10(Hoping there will be no Pacific Rim 2 because that would be just plain stupid)",
        "Wow, this movie just blows me away. Really it does. There are a few plot holes that can be easily looked over, but all in all its a must watch.\n\nFrom the opening scene it has you at the edge of your seat. I literally sat at the edge lol. The visual effects are just stunning. Blu-Ray this movie with a 240hz TV or higher and it will feel like you are standing right next to action.\n\nCharlie Hunnam did a great job in this movie. I love his character in The Sons of Anarchy and he may seem a little like that character but he pulls it off well.\n\nYou will be happy you watched this movie.",
        "Interesting story. Good CG. However, personally I found that a lot more could have been done to make it better. I won't discredit it. A lot of hard work has gone in. One can tell. Personally I feel a lot more could have been done. Definitely worth watching once. Interesting story, idea and delivered pretty neatly.\n\nMy biggest dislike, as I have with many Hollywood movies, is that whenever they talk about 'International' endeavor, for some reason, they don't include characters from South Asia, namely India, Pakistan and the rest of the subcontinent. I find it disturbingly biased. Just saying.",
        "It's not the worst movie ever, but after watching it based on an IMDb 7/10 it feels like the worst movie ever. Aside from the IMDb 7/10, I gave this a shot because I enjoyed Del Toro's \"Pan's Labyrinth\" (http://www.imdb.com/title/tt0457430/). Again, sorely disappointed and cannot imagine how the two films share a writer and/or director. If you start this film and think, this storytelling and acting is not great, but I'm sure the plot will make it all worthwhile, you'll be disappointed. Aside from a lack of worthwhile dialogue and acting, there is nothing interesting in the plot and there is nothing interesting about the storytelling. Skip it.",
        "I had no expectations before and after watching this my no expectations were confirmed. If you're into Godzilla movies, then you'll like this. If you are into Transformers, then you'll like this. And finally, if you like seeing giant Ironmen, then you might like this. The creatures are hard to figure out and like Man of Steel, Avengers, and others seeking for special effects, we get to see how cities crumble to rubble. As for the story, basically, the ocean floor has awoken creatures hiding for centuries. Blamed on our environmental failures, these creature have risen up and simply attack us to (of course), wipe us out. This movie had its moments, but to pay for it, there are better movies out there to see at the theater. This one, its best to wait till its on cable or satellite.",
        "Movie started a little slow but I thought OK. Then there was a scene with the little Japanese girl which was amazing. I truly give that Scene 11/10 just mesmerize me. Seriously it was that great in all aspects. The colors looked great the acting was incredible and the scenery was well done. Then there was the other characters the 2 scientists can make anyone uncomfortable they lack charm. They were just not there (not connected to the movie at all). Another thing I noticed is that it is too long. The Movie is just too long and began getting more and more less interesting. I fell asleep twice watching it (didn't want to say it but had to). Overall the Movie is a 7.5 out of 10. I have to give it a 7.5 for that scene alone but it then started to loose depth. Guillermo del Toro could've done a better job in giving more depth to the movie and to the characters. The special effects were out of this world but like I said it lacks charm, that warmth.",
        "This movie is much more intelligent than most users and critics. The movie is much more intelligent than most users and critics. This film is much more intelligent than most users and critics. The screenplay is fantastic in nature, but nevertheless as scientifically accurate as the pioneers of futurology, of artificial living and thinking organisms, of neurosocial informatics, of rapid learning epigenetics could have imagined it. And del Toro demonstrates that he's a genius, one of the three most creative cineasts in Hollywood's history. This movie is much more intelligent than most users and critics :-) Really, really, really: This movie is much more intelligent than most users and critics :-)",
        "This is not the movie to look into plot holes, script awesomeness etc. Just dive in and have fun.",
        "A movie of this nature would be regarded as a \"cheesy, plot less flick\" filled with just clumsy action scenes that really have no basis. However, after I got out of the cinema I could not get over how pumped I felt.\n\nIn all honesty this movie makes for an action packed summer blockbuster that deserves appraisal and excels in an intricate plot line as well as pure fist-pumping thrill when it comes to Monsters vs. Machines. After all the majority of us miss out on movies that are on such a high scale proportion such as Godzilla and Jurassic Park and it seems that directors and producers shun these movies due to the fear that they may not achieve success. Big props to Guillermo del Toro for making the movie come to life as well as solid performances from the lead cast such as Idris Elba as well as Charlie Hunnam which really puts together a solid blockbuster that is worthwhile to watch.",
        "There's not much else that I can say other than giant robots punching kaijus (Giant monsters). I've watched kaiju films since I was a kid, and really, all pacific rim is, is a special effects leap. A very large one. Though other than that, don't expect to actually take anything away from the plot, we're just here to watch giant things punch each other. However, none of the chars were un-like able to the point where they were annoying, and even though there was close to no development, it sort of felt like there was something to lose if some of the pilots died. My final point is the soundtrack, which just makes everything feel more massive, from the guitar to the sirens of the jaeger. Over all, not much plot or characters, but this movie, was probably one of the coolest things I've seen.",
        "I really like Guillermo del Toro. I think Pan's Labyrinth and Devil's Backbone are great movies with substance although lots of blood and violence. Then, came fame, Hollywood, big money and probably pressure from the big studio \"not to screw this up\". So, here we have a talented director with big budget, big effects, big action and b-movie cast. Yup, you heard it. This is the main flaw of this movie, aside from the fact that we have usual stereotypes seen in action movies such as \"Armaggeddon\" or \"Independence Day\". You can throw this movie to the same bag with aforementioned titles. I'm actually surprised that Michael Bay didn't make this movie, it would fit him well. Charlie Hunnam, Robert Kazinsky and Idris Elba? C'mon man! I like Idris but he plays horribly in his role. Where is Christian Bale, Matt Damon or Tom Cruise when you need them? Give me Eric Bana or Ben Foster. The focus was put on big time special effects over script and acting. What a waste...",
        "This was an outstanding fantasy ... actually marrying two genres into one epic-scale story line. The special effects were completely original, as was the plot. Character development is thorough, even with a lot to absorb in a two-hour time frame. CAN'T WAIT FOR THE SEQUEL coming out in 2018!!!!",
        "Great CGI and action scenes. Elba and Martini are great. But who the hell thinks scientists are like this. Especially the maths scientist is so fake and annoying. I would have given it a 7 or 8 otherwise.",
        "Too long and soporific movie. I don't like much the acting of Charlie Day. He is slightly annoying.",
        "In all, I liked this movie very well, the effects were good. But I think the story should be made better. You can also see if you want.",
        "Guillermo del Toro, the visionary director of Blade2, Pan's Labrinth and Hellboy has done the impossible. Large Robots...Large Monsters...and I COULD NOT WAIT FOR THIS FILM TO END SO I COULD LEAVE!. How do you screw up a movie with Charlie Hunnan, Charlie Day and Idris Elba? The answer is very simple: You make the movie for you, and not for the audience. This is Del Toro's guilty pleasure...like Tarantino's \"Sukyaki Western Django\"...this is merely a collection of images and activities that Del Toro put to screen to entertain himself and himself alone. I am sure his preoccupation with Manga (http://en.wikipedia.org/wiki/Manga) fueled this masturbatory CGI exercise. I actually felt as if i'd lost a few I.Q. points after sitting through what could only be referred to as the \"Battlefield Earth\" of the millennial generation. In closing, let me say that i'd rather do yard work, than sit through this film again.",
        "It's just excellent and moving. The sentence that really moves me in this is \"people are afraid of storm. but in Jaeger, we can just face ahead\" in the first scenes",
        "When Japanese Gundam meet Hollywood for a perfect mix, this is what you get!\n\nLike many, Gundam or mechas movies were far from being my favourites, but here we have a movie made by someone who obviously knew and liked what he was doing, and the result is an entertaining and catching movie you will want to see more than once, weither you liked the style before or not. What are you waiting for? :)",
        "I went to the cinema expecting literally nothing special but this movie took me by surprise. Action packed and entertaining. Can't wait for the next part",
        "When I first saw the trailers for Pacific Rim I thought that the story was going to be complete garbage but that the action scenes were going to be pretty cool. Well I was wrong, the story was actually somewhat interesting and I walked out of the movie theater impressed by the plot, along with the action. If you think that this movie is only made to impress your eyes, you are kind of right, but there is a lot more to the movie than that. This is a guy movie hands down, but it is actually worth the movie going experience. The acting can get bad in some spots but I thought that Charlie Day, Charlie Hunham, and Ron Perlman carried this pretty well. If you are going to see this movie because of the awesome giant robots vs giant aliens scenes, you will not be disappointed. One of the best movies of the summer in my opinion",
        "This movie is exactly what it was billed to be: giant robots vs. giant monsters. Pacific Rim is a great mindless action/ sci-fi movie. The action scenes depict wanton destruction of large cities, but it didn't have fortuitous gore and there was no nudity.\n\nThe special effects were great, the plot was easy to follow, and the storyline was believable within its own context. There were also no underlying artistic statements, nothing that made you think intensely or introspectively, and no deeply emotional moments. Essentially this is an outstanding man movie. If you are looking for a robots vs. monsters movie, this movie won't disappoint.",
        "My girlfriend and I watched this movie at the cinemas. We paid a few extra bucks to watch it in 3D. That didn't change the fact that this movie was average. Idris Elba didn't fit quite well in his role, and the storyline is outdated and boring. A couple of sea monsters rising from the ocean now and then for no apparent reason. Then getting their buts kicked by two men in a giant robot. Great plot right? But don't get me wrong though, as n sci- fi, its average,but as something new that you've never seen before, then its fantastic. This isn't a movie for every alien movie lover, but it should suit most of you guys. If this movie was to be compared to let's say Battle L.A.and Battleship, pacific Rim will not fit those standards. Perhaps the lack of a couple of great and noticeable actors is to be blamed. But, a lot of action and a fun movie to watch with your friends.",
        "While I will start out by saying it was not as bad as it could have been. Needless to say the special effects were a high note, the robots were kind of bland, but the monsters were very convincing. Also the some of the story was interesting, specifically the original Gotham-like gangster setup. The supporting cast was to be commended, specifically Charlie Day and Idris Elba were very good in their roles.\n\nThe Bad Part, the lead! Seriously, it seems like it is so hard to get a decent leading role in action films these days! Charlie Hunnam was pretty much terrible. What is wrong with directors these days who can't see that putting several 100's of millions of dollars into a move, and getting a crappy lead is a bad thing? Especially from the likes of Del Toro. Plus the story itself, while starting strong, was way to unoriginal and slow for my liking! An average film at best.",
        "I wanted to like this movie but couldn't. How it rates a 7.0 I do not know. Even the worst Godzilla movie is better than this one. This movie is good for a one time rental but I would not want to own it. The acting is terrible, the CG monster action is too much in your face and not very realistic. This movie was made for teenage boys and nothing else. Everything is macho. Macho actors, macho monsters, macho robots. The only thing not macho was the script. Sorry, the new Godzilla 2014 movie is 100 times better. I'm glad the director did not have the time to direct the Godzilla movie. I am a life long monster movie fan from back in the 30's until present time and so I know what makes a good monster movie and Pacific Rim is not it. When Pacific Rim 2 comes out I will not be lining up to see it at the movies and will not be renting it on DVD.",
        "I was really looking forward to this movie especially after seeing this 7.7 rating. Really baffled by this high rating, I think it will be mostly kids voting it that high. The storyline is terrible and the acting is substandard. There are also a lot of cheesy scenes which are hard to watch at times. Lots of this movie doesn't make sense for example why did the world stop funding the Jager defense? and that's just one example. The good point of this movie is the action. It is amazing, the CGI is awesome and the first hour of the movie is good. Don't go into this movie expecting a good story, its all about the action scenes, it seems that movies no longer need substance to have a good rating.",
        "I watched a kaiju movie after a long time. The visual effects were very good, I also liked the robot and kaiju designs, the action was also good, but it could have been a little better. It's a good Story, although the story had a glitch in some places. The characters are of above average quality. 8/10.",
        "Where this movie gets a 7.4/10 I honestly don't know. The acting (ahem) is so wooden it is on the point of being classed as a forest all on its own. This movie is a rip off of so many classic movies I am honestly surprised they haven't been sued. The script is so cheesy even dairy farmers are complaining. The special effects are very good though, so I am going to give this thing 2 stars. 1 for the effects and 1 for the producers and directors for having the courage to put their names to it.\n\nI think I would rather watch \"Killer clowns from outer space\" again and I can't even begin to describe how bad that is.",
        "Thoroughly bored the entire length of the movie as I grew up watching anime. There's nothing new, everything is recycled ideas Japanese already used 20years ago.",
        "Watched Pacific Rim last night and to be honest I only wanted to see it because I think Idris Elba is class. Although I think he has went down in my estimations getting on board with this tripe!\n\nWhat was up with the acting? Honestly, it felt like Del Toro asked everyone when he was filming to pretend they were doing an episode on Nickelodeon! I mean the 2 scientists, they could have been played by Kenan & Kel and it wouldn't have been more over the top!\n\nI guess it is a saving grace though that this film was made, as it meant a certain director didn't get to see through one of my all time favourite fantasy stories. Don't get me wrong, The Hobbit wasn't without its faults but I reckon it would have been massacred under Del Toro!",
        "Had my reservations going to see this as i wanted it to be good and had high hopes from reading the initial story outline months ago, to viewing the trailer when it first came out.\n\nThis film didn't disappoint on any level and surpassed my expectations, truly a brilliant summer blockbuster. Loved trek 2 and iron man three but this bested both.\n\nEven if your not a sci-fi fan and the idea of a robots fighting alien godzillas doesn't sound immense (it should!), this film works and entertains without slowing the pace for the full 2 hours. Brilliant story, superbly acted and the world it takes place in feels real. The effects are simply amazing, and you'll be rooting for every jaeger and its pilots.\n\nShame on you if you go see any other movie this week!",
        "Nostalgic. This film really brings back memories of those old Japanese monster films (Godzilla, Mothra, Rodan, Gorosaurus, Anguirus, Kumonga, Manda, Baragon, and Varan) and not to mention those Japanese robot anime's like Gigantor or Voltes V. Even the background music was similar and probably re-scored from those films. The monsters maybe and are actually digitized but I can't help thinking that these are actually played by human actors in monsters suit like they used to do back then. Really neat! Gypsy Danger really reminds of the remade 80's Gigantor and the other robots is kinda similar to those robots found in that anime cartoons Voltes V. I hope they make sequel to this film.",
        "I just saw this film in IMAX 3D and was glad to have done so. That is not to say that the film is amazing, because it is in fact riddled with flaws. The dialogue is wooden at best, and cheesy on more than one occasion. The relationships between the main characters were not developed well, and apart from the jaegar/kaiju fight scenes and the adventures of the mad scientist in Hong Kong, there wasn't much else that made the film stand out.\n\nHowever, the fight scenes were great, and it's worthy of being a summer blockbuster when compared to some of the other disasters that I've seen recently in theatres. The IMAX 3D experience complimented this aspect of the film.\n\nOverall, it deserves an 8/10 for the cinematography alone, but drops to a 7/10 because of the less-than-impressive dialogue and acting.",
        "for pacific rim i had great expectations, the budget was big the marketing was big everything was big.\n\nright from the start of this movie it contains annoying cheesy moments which didn't made sense at all. They completely make the movie unbelievable. the fights were awesome but that is all this movie offers, it has a bad story and uninteresting characters who fail to tell the already bad story. halfway down the movie all expectations are failed to live up to and i couldn't wait for the inevitable big fight at the end. When watching this movie everything is predictable: the lines of the characters, the little mid movie plots , the close escapes and even the end is to easy. The best thing about this movie are the special effects it looks amazing and astonishingly real.\n\nPacific Rim was a movie with great potential but failed to be good.",
        "Rarely does a movie surprise me from my expectations, this movie definitely did. I am no fan of fantasy, epic-proportioned, futuristic films and honestly it was not in my watch-list ever. I expected a senseless, plot missing movie like transformers (which I hate) or any other high CG film with lots of fighting. But the plot is just great, what can one expect from a movie directed by Guillermo del Toro. I can't put in words how surprised I was when I left the theater. Definitely you should watch it (a recommendation from someone who hates this kind of films). Don't underestimate it trailers are nothing compared with the real deal.",
        "the best fight scene ever, kaiju's are hard to kill, formidable and menacingly evil, even 1 of them is a handful. These monsters even have powers like electromagnetic storm & acid spores -that's crazy!. The kid inside you leap with spirit seeing ginormous robot walking into deep blue sea and then choking, hammering, shooting monsters in order to save mankind from extinction. The fight scenes are not blurred , you can see them clearly which is a plus sign. if only Michael Bay did this to Transformers... . comparing them with Transformers where you have millions of useless pixel transforming which in the end you can't make sense of them transforming or even the fight scene in short it sucks . MB should learn from movie because 1. It sets a whole new standard that anything below is rubbish",
        "Well i read no reviews before entering the cinema so had no expectations, within 5 minutes the dialog was highly annoying and the poor Australian accents, then came along the robots and i thought okay i can deal with this. Enter 2 new characters- supposed to be funny but try hards and it really didn't work with a mash of bad accents, big egos and badly played 'geeks'. My way of describing this film is transformers meets power rangers with a stereotypical cast and cliché script. It had the potential for so much, and i found myself willing it do so much better but i found myself being annoyed by so much! I just have no idea how it has managed such a high score on IMDb?!",
        "What can I say? This movie was, at the very least, a helluva good time. It did have it's issues; the biggest of which was some dialog that was less the amazing. The delivery and the writing prevented it from being something truly spectacular. That being said, this movie provides endless amounts of visual stimulation. The fight scenes were well choreographed and well shot. Guillermo Navarro outdid himself with this visual gem; it's easy to understand why Guillermo Del Toro has used him on most of his films. The story allows for a lot of imagination and doesn't feel the need to address all of the points of the world it created. I appreciate that in a film. The other portion of this film that I love is the ending. It lets the climax taper of naturally, a rare thing in modern cinema. Too many movies have to answer so many questions at the end that it gets drug out far too long. Not Pacific Rim, it wraps everything up in a neat package and sends us on our way. Will this movie be a historical masterpiece? Hell no, but what it will do is remind you of how to have fun at the movies.",
        "Best movie ever. Everyone Who thinks this movie is worse than a 6 is mental",
        "One of the best SF movies! I really like it. Recommend",
        "I though I should rate Pacific Rim 2013 because this one could be the one and probably the only Pacific Rim that can be called Pacific Rim... because the focus of this one indeed is Jaeger/Monster instead of bunch unprofessional actors/actresses...",
        "According to the title Pacific Rim, movie does not distract from the original story. Although there were some flaws, but still movie does earn some credits. Watch this movie if you any preferences of big machines, robots and yes the 'Team Work'.\n\nDo not avoid this amazing, action packed film, unless you are seeking a flawless story.",
        "Well, that film is good enough for 5 but it is action film and plot isn't as good as I expected, so I can give only 6",
        "When the trailer relased I was so hyped for this movie ,because most of the scenes were spectecular. This is a movie from 2013. Director is Guillermo del Toro also I want say thank you to director for giving us an incredible movie Movie setted in lots of locations like Canada,Toronto and more.Casting did pretty good job.Main role was given to Charlie Hunnam\n\nLets talk about storyline film is about giant monsters called Kaijus they are coming from a portal.I mean another dimension.Kaijus cause massive destruction so humans build robots called Jeagers to figth with them ,as they say ''Figth fire with fire. ''.I cant keep going because it could be spoiler\n\nI highly-reccomend this movie if you really like destruction and some kinde things like that.It has better visual effects than movies in 2013 Go and watch you will not regret",
        "It was a cool film for it's time the soundtrack was good but giant robots fighting big monsters was new for it's time but now it's meh. It was an entertaining film though so it might as well deserve a 7/10 on imdb anyways.",
        "Its insanely good if you ask me, the story is well written I love alien films. It's a\n\nnew concept for me with the robots fighting and such, its well executed and and really thrilling. So for me is a clear 9/10.",
        "Hoooyaaa! Brace yourselves for a spectacular adventure! I am a big fan o SF movies with impressive special effects and this was just my cup of tea. I give it a 10 for special effects, a 10 for the story and maybe a 9 for the actors, but in this case, they don't really matter, do they? Great movie, the action is continuous, and you never get the chance to get bored or escape the plot grip. The effects are top quality and I am so very sorry that I misses the chance to see it in 3D, I guess it was wonderful. Recommended for SF and adventure fans, interesting plot and idea: robots, monsters and everything that matters, big lack of romance (which I find useful in this kind of movies) so everything is in place. Thumbs up!",
        "Acting: Really bad acting. The worst of the lot being Idris Elba (Stacker Pentecost) and Rinko Kikuchi (Mako Mori). Even with low expectations from the acting department in action movies, you will often one at least one actor who would make up for the lack of acting skills of the rest of the cast. But unfortunately, there is no such actor in this one.\n\nStory: Started with an interesting concept of how these mystical creatures originate but unfortunately thereafter the there was literally no plot at all. The movie is filled with the usual \"alien attack\" clichés thus making it very predictable\n\nVisuals: The robots that fight these mystical sea creatures are visually stunning and massive. Sadly, thats the only thing good in the movie.",
        "After seeing pacific rim I have to say the visual effects were stunning, Idris Elba was awesome as he portrayed the steel plated commander 'Staker Pentecost' and was as strong and temperamental as he is in 'Luther'. The acting overall was up to scratch from the whole cast in particular Charlie Day as 'Dr. Newton Geiszler certainly offered the audience some comic relief from all the action. The Plot was of course was ridiculous but the visual effects and action throughout more than compensates. overall a fun action-packed movie for enjoyable watching.\n\n7.5",
        "Powers Rangers meets Godzilla, with moderate better acting. Does what it says on the tin!",
        "Power Rangers.....This movie is something that you would have thought the super powers of the 90s Power Rangers would have evolved into. I do like the fact that the this being one of the hits for summer blockbuster that instead of the aliens coming from in the middle of the space they come from the pacific rim (hence the title) because this gives an alternate and more pressing need for the world to unite against a common enemy than other movies. I think this element gives the movie some credibility into how the world would actually revolve when something this disastrous would happen. All in all, if you liked power rangers back in the day, then you will like this movie!",
        "Those who think that Transformers movies are awful will most likely praise Pacific Rim as being better in every single way, because it is. The film is directed by Guillermo Del Toro, who is one of the most consistent directors working today, and has cast full of perfectly capable actors/actresses. It is obvious that Del Toro was making this film for fun, and not for the awards season, since Pacific Rim does not have the overall tightness and quality that some of his other films have. Some of the acting is a bit questionable, and the script is far from special, which is especially apparent when Idris Elba gets some screen time. He is meant to be an military leader type character, and is the most generic one sided version of that character. Overall, the film is okay, but an excellent addition to the monster movie genre.",
        "I am voting 3 because the action scenes are worth a good credit but the rest of the movie drags the overall rating down. And that is it. The action scenes are very well made, high tech, amazing effects, looks great.\n\nIt's pity that the technical knowledge and money put in this movie was wasted with bad writing and very very very very bad acting. Just bad. I like Ron Perlman which is why I watched the movie but I think he could have done much better job too.\n\nIf you want nothing but a brainless action movie then you might enjoy this one.",
        "I really like this movie Good cgi Good fighting Actually i have to admit that i feel so dump to watch this movie in 2019 I came late 6 years But i'm glad to watch this finally I will watch the next part which called uprising But i'm concern",
        "I have to start off by saying the movie is very unique, good story, fun characters and so on, but my grade is still 7, why is that? Well i have to say first of all, the movie is extremely predictable. You know whats going to happened about 5 minutes before it does. Don't WORRY NO SPOILERS: There's a scene where someone gets mad at someone and wont let them go in combat, but due to lack of soldiers/offenders (whatever they are called) the person has to go with another soldier. I can go on like this for a distinctive amount of time, but i will be spoiling and that's what i don't want. But overall, other then that, the movie was great. Each character has a unique and different personality, good story, very enjoyable, definitely recommended",
        "I really enjoyed this movie, it's pretty much all you could ask for from a movie like this. Cool action scenes, great robots and special effects and excellent monsters. When you're watching a movie like this... You don't really expect a deep story with really complex characters, right? This movie is just great at what it's trying to do, I watched it years ago in cinema on release but it was pretty memorable. One of the stupid things about this movie is that the robots have this bad*ss chain sword that can literally cut a monster in half with one slice but they could have used it more often, right? It makes the huge guns on the robots look like peashooters compared to it and it has perfect close-quarters capability against a similar monster. Otherwise it's a great movie and I would recommend it to anyone who likes great high budget action movies, it reminds me of the Michael Bay Transformers movie but better. Which I like, yeah, I really enjoyed the first three movies, fight me. 7/10!",
        "It does what it sets out to do make big robots fight stuff and does it really well! Turn off mind and enjoy 😉",
        "Pretty cool film great effects I dont know who created more damage the machines or the monsters and also instead of giants caught in an epic first fight/ wrestling match why not use the sword from the get go",
        "If you are considering watching this movie you should really know what you are going to watch. I, on the other hand had way too high expectations and ended up very disappointed.\n\nThis movie is kind of a hybrid of Transformers, Independence Day, and Armageddon. In this film you will get to see all clichés ever used in either a straight up action movie or in a \"end of the world\"-movie. The script of Pacific Rim could just as well have been a parody of the above mentioned films. On the other hand, the production and acting is good. But it almost seems to be a waste to spend so much time, effort and money on such a bad script. However, the movie is loaded with special effects, and exciting action scenes. This makes it an entertaining movie if that is what you are looking for.",
        "You like big robots and/or big monsters? Watch this.",
        "If your going to see one movie this weekend it's Pacific Rim without a doubt! It has everything you want in a blockbuster, action, drama, suspense, comedy, and story! This movie is the avengers of 2013! I was jaw-dropped at the action sequences that left me feeling like I was there! Everything about it is perfect! Honestly I loved the movie and feel so good about it Pacific Rim is the perfect movie of the summer, I wish people can also see it so that way we get a sequel! Please guys support the movie for a sequel! Because who doesn't like skyscraper mechs versus skyscraper monsters! Best movie ever without a about its the avengers of 2013 with great team-up!",
        "Humanity faces the threat of extinction and the most intelligent people on earth decide to built huge robotic humans that will punch huge monster aliens in the face. Only problem is that the alien monster don't get injured by being punched in the face. Anyways what I am trying to say is that humans in this movie created the most ineffective and inefficient weapons requiring the highest maintenance and wasting most resources. But these Human Robots do have secret weapons, (sword) which they use 1 second before being completely destroyed. The defense plating on them is as thick as a coca-cola can and their god damn weapons are so damn slow like in this one scene where it took the robot 20 seconds to charge its damn laser weapon but then could fire it because the alien ripped of the arm holding the laser. FFS This movie makes all humans look like morons. Anyway i could go on but i give 4/10: 3 points for amazing realistic effects and 1 extra point because i thought the Asian girl was hot.",
        "You get what you expect. Robots vs Godzillas. Yes, the movie does not have a strong plot and I do not really care. I still had fun and even was emotionally involved at some points. I don't really understand how some people expect some Oscar worthy plot or something like that. Yes, people are free to criticize. For me as a movie lover it matters if I had fun or not and let me tell you: the action and CGI delivers the fun I wanted from this movie. Acting wasn't that bad at all and I actually liked it. Don't have super high hopes and you will not get disappointed. It is that simple.\n\nThe CGI in this movie is top notch and the movie is worth the time. Don't let the negative reviews get to you and see it for yourself. ;)",
        "For the fans of these kind of movies (sci-fi + transformers + godzilla + king kong + mechanical giants) this is the best movie yet. The effects are very very impressive, state of the art, there are well known actors and \"new\" actors, but all them do their role great, that surprised me. The argument is nothing complicated to understand, no complicated puzzles or enigmas, fits very well in an pure adventure/action movie, personal drama is served in small amounts as well as \"love\" scenes, since everything seems to be focused only in action, that fits very well in this kind of movie. Has lots of action scenes from the start to the end, won't let you sleep. Its very very entertaining and very balanced movie indeed. To finish, even I'm not a fan of these kind of movies, it is fair to say, this one is a must see!",
        "Finding words to describe the awfulness of this movie is not easy but let's give it a shot: awful, absurd, childish, shallow, superficial, infantile, predictable, silly macho-man fantasy, for macho-man wanna-bes to live out their macho-man fantasies for things they can't accomplish in real life complete with phoney heroics, and stereotypes galore. Women are allocated one tear; men, none. It makes Fast and Furious look like Shakespeare. The usual Hollywood \"blockbuster\", no thinking required: too much unintelligible, contrived blabbering, cardboard cartoon characters, long on eye candy; short on unimportant things like plot and character development. Those who like bright flashing lights, explosions, bang bang, woosh woosh, boom boom cartoons will love it. Two stars for the CGI. Those who prefer something within a few light years of reality land should look elsewhere.",
        "I think they got the idea from an old movie calld \"Robot Jox\".Iam not telling that it is a bad thing.",
        "Pacific Rim has its heart at the right place though there are some areas where it falls behind. But great story, back story and arousing soundtrack make this a great big screen experience. The CGI work on Kaiju and Jaeger is convincing. Gypsy Danger actually makes you root for it as it fights back. Superb action scenes. Thumbs up Guillermo del Toro!",
        "I'm not one to spoil movies because as a movie fan I hate that myself so if you are wanting to know what happens, then you are reading the wrong review. Overall a good concept and a good movie that deserved a 6/10. The biggest thing that annoyed me was that if you are going to have a part in the movie where you want an Australian accent (and being an Australian this is something that really bugs me) get someone who is actually from Australia, as I'm sure you are aware of all the actors/actresses that have come from down under. Its not that the acting was bad although it wouldn't win an Oscar, but the put on Australian accent was awful, it just doesn't sound natural, and that is part of being able to act and make it believable. The Idea of aliens invading earth was not a new idea but the way they went about it was and thats the main reason I gave it more than a 5 because they took an old idea and breathed some new life into it, the special effects were done well although will all Sci-Fi's any movie buff will pick it apart. So over all a good movie with a good idea but one that I will probably only watch once.",
        "Although i have to admit that Sci-Fi is my favorite genre, i feel disappointed by the logic of this movie. I think the time when humans were building big things to fight is history. I don't think that future would bring huge machines to fight huge reptiles.... we would use missiles, lasers, ultrasound etc.. Of course if you fan of such mega-fights its your game. But honestly, a robot that walks & looks like human with a technology that enables the two pilots to see their minds but still fights with a sword? Its like aliens visit earth on a donkey. The characters in the movie also remind me on 90' sci-fi movies where they were patriotic screaming and synchronized walking. You also find the great guy who was once fighting but now cant anymore, but once again he has to...What i have to admire are the visuals effects.",
        "As they say in then beginning of the movie, they are using in 2020 the most powerful technology that they have. Although they insist in use physical combat to beat the monsters. Among other weakness in the plot, this is my main point here. The moments where the big robots were more successful were when they shot or explode the monster. From distance. Why not just trow nuclear bombs on the beasts? The visual effects are really amazing, even for me - i watched this movie in 2D. The cast was just OK. I like the scientist and his loud and weird voice. Actually, the one who caught my eye was that little hong-Kong girl trying to hide from the monster. She seems extremely afraid and I really believed her =) I would not recommend this movie for anyone, but if you like movies with lots of visual effects and loud sounds, that's the one. But prepare yourself to snort and almost laugh in disappointment at really stupid and overly-dramatic lines.",
        "Yes, giant robots are great. Yes, maybe someday they'll take their places in the army. And yes, maybe someday they'll fight for us.\n\nBut, when it comes to a science-fiction movie you make comparisons. And when you make these comparisons with Transformers sequels; they are far better than this one. The robots are too slow to handle a giant lizard. As they are too slow; they are always beaten to death most of the time. And if they would not be able to use all of the martial techniques; why is the training done? A game player would do a lot better than this.\n\nAnyway, there was a little excitement though; i don't know why. Better do not see it...\n\nUAR",
        "I love this movie. It was all made really well, other than some errors in terms of size differences and stuff like that, it was a great movie. My biggest problem with this movie was the chick. She felt like the worst part of the movie in my opinion. She was terrible at acting and her character seemed like more of a problem than a solution. Other than that I thought the characters in this movie were awesome. I'm excited for the next one!",
        "It begins amazingly and ends amazingly I love this film and can wait for the next",
        "This movie was lot of fun! Most aspects of this film were executed extremely well, as you would expect form a Del Toro film. Visually, this is one of the best movies you will see for a while. Despite the huge scale of the fights and the scenes, it is very easy to keep up with the action, and follow what's happening, a testament to how well the movie was directed, shot and edited.\n\nIt is very over the top, and cliché'd in places, but it's all the better for it. This is essentially a modern day B-movie, just with big budget, good screenplay and good directing.\n\nI found it very refreshing to watch a movie that for once, wasn't trying to be gritty and gloomy, and also wasn't just a re-hash of tired old ideas. New IPs and ideas like this need to be supported, rather than flocking to see yet another Spiderman or Superman film.",
        "I went into this movie thinking \"meh\" and I came out thinking the same thing. Not good, not terrible, just \"meh\". The big selling point in the trailer, epic fight scenes between robots and monsters really fell through. The fights were very paced and generic, not causing the audience to really care what happened to the main characters in the least. The battle scenes were also really dragged out, and became boring after the first five minutes. The characters were generic and shallow. My recommendation: if there's nothing else you desire to see in the theaters, go see this movie, but don't go in expecting much. I give this movie a five out of ten for effort, AKA: meh.",
        "The plot is absolutely shallow, the jokes aren't funny at all and the characters (exception made to the scientists) have absolutely no charisma. If I could summarize this movie in one sentence, it'd be \"Independence Day meets Ultraman\". You can change Ultraman for any other Japanese superhero who pilots giant robots, if you please.\n\nOn the bright side, the technical part is flawless. Very nice sound editing and great looking visual effects. Thus the title of this review: if you don't have the chance to watch this movie in a theater that offers the best in sound and image, avoid it and go watch something worth your while.",
        "old story,all fights,remained of me Ultraman but i like the music. in a Chiese's eyes, the hero is so not handsome. on the contrary, i like Mako Morithe. She is a highlight, typical fool for love. the plot what happened in her childhood touched me. it made her image more vivid, and add some warmth in to this movie. Box office in China is over 600 million, compare to America, seems that this movie is not so welcomed in there. if there is a Follow-up Sequel, and better story, it could be a classical movie series, It's my first time to use IMDb, i don't expect that i should type 10 line. That's so different in China. i can type how many i want in Douban—— a website uses to comment movies.",
        "People complain about anything i swear cant please anyone Don't believe all the others. This movie is really good even with the basic story. I didn't come into this movie looking for amazing plot twists and brilliant storytelling. I came looking for great action scenes with giant robots fighting giant monsters that's what I got although i wanted more fighting but it was brilliant how this got no Oscar nods for the visual effects is ridiculous. Sometimes it amazes me what they can do in movies you should definitely watch this If you like amazing action sequences watch this I wish they would've done something else to make the plot a little better but still a good movie A lot better than I expected",
        "Pacific Rim has been on my eye from the moment the trailer first came out, although the effects really didn't disappoint the overall storyline could use more original ideas. After seeing so many positive reviews of Pacific Rim form around the web and close friends it was clear I would have to see it, having known that Del Toro has directed Pacific Rim my expectations were already much higher due to his previous amazing movies(e.g. Pan's Labyrinth, the Devils Backbone, Hellboy). The general concept isn't in anyway bad that has to be stated straight off, but the same repetitive ideas that can be seen in Pacific Rim have previously appeared in the movie industry over and over again. I would still highly recommend this movie. It is a great movie to own and a brilliant movie to watch and add to your collection although perhaps it's not something I would watch consistently once in a while its a great movie to re-watch. Just a shame such a great director didn't see the repetitive features in this movie compared to others, yet still. Its a must see. Great effects, and with a far eye the storyline isn't too bad either with quite a few twists.",
        "Bad story, no acting. For me, Ron Perlman saved the Film. (\"after credit scene\")",
        "I have rarely watched a film with as poor a script as this. Charlie Hunnam can not carry a film no matter how good or poor a script is ( I refer you to 'Arthur' ) The special effects go some way to helping relieve the pain, but ultimately this film fails to deliver a plot or any emotional engagement. Best approached as a parody, laughing at it helps get you through it ."
    ]
}