{
    "reviews": [
        "This is the show that puts a smile on your face as you watch it. You get in love with each and every character of the show. At the end, I felt eight episode were not enough. Will wait for season 2.",
        "I've been such a huge fan of their writing and again with Panchayat they've nailed it.",
        "I was wondering from the very first episode who's Rinky... And damn...... Well done...",
        "Excellent writing make this series real and authentic ..all actors did splendid job. i higly recommend this series to everyone because every episode is written in a splendid way",
        "The Jitendra is the amitabh bachan of web series...really awesome series and must watch.",
        "Nobody understands Indian viewers better than TVF. This very beautiful & light-hearted series brings smiles to your face connecting you to rural India. So insightful, simple and viewer-friendly. People who want to take a break from dark, crime, suspense, thriller, patriotism genres...this one is for you. Right now. The casting couldn't have been more perfect.Jeetu bhaiyya,Raghubir Yadav sir and all the supporting cast.Bravo👍",
        "Just saw all 8 episodes (+bonus episode) in a go. It was just amazing. All characters did justice to their role; I will be a bit biased for Jeetu Sir. He is awesome in this series as well. New guy Faisal (Vikas) did a phenomenal job as well. The episodes are beautifully executed n brilliantly intertwined.\n\nLoved loved loved it. Highly recommend. 10 stars",
        "Beautifully made, Almost felt like i was living in that moment. The most appreciating thing is the content is presented with such a grace , and acting is simply awesome, this is perfect example when a good acting skills are mixed with an superb story and mind blowing direction.",
        "This unique swades prototype is brilliant at every scene. Every frame is made hilariously realistic. Totally real",
        "Its makes you positive..such a great story..fell good.thanks tvf and all the cast",
        "As expected, again brilliant work by TVF. Awasom performance by Jitendra and Raghubir yadav. Very realistic story with nice humour. Highly recommended.",
        "The story line, the simplicity of characters, the visualization of everything is just pure gold. Loved every character's..After kota factory, this won't disappoint you..Go for it!",
        "The series is really telling village life and The perks in a very comedy way",
        "Not much of suspense, nothing to laugh my lungs out, yet I finished in one go. Nothing of sort didactic, yet meaningful. That is something called classic. Jitu and all other characters are truly awesome.",
        "I've laughed genuinely in a series after a very long time. What an earthly touch! In love with the music, cinematography & all characters, especially Jeetu & Pradhaan. Waiting for next season like anything. 10/10 definitely.",
        "Panchayat is a very carefully crafted piece of work. For someone who has been in touch with the rural life, I can vouch that the whole setup seems quite natural and not at all forced. The gradually evolving chemistry between the characters lays out in front of you a beautifully woven & intricate fabric of the society, where you see the vulnerability of a common man. The occasional emotional outburst, disappointment, standing up for the other fellow and that innate innocence of every character doesn't stop short to bring out a smile on your face. On the other hand it brings to surface the subjects like class divide, dowry, gender inequality, population control, flexible morality and many such aspects. The makers looked conscious of keeping the plot and the story line tight and avoided needless stretching of subplots. One of the best webseries' produced in recent times. A must watch.",
        "This web series is unique in every way. It accurately tells the story of an average middle class engineering student who not only has to struggle for his career aspiration but also needs to support himself in the process by taking up any Job. In this case, ' secretary of a Village Panchayat '. TVF is realistic and funny in storytelling as always. People who grew up in villages will relate more to the story others will sure enjoy the village setup of the story.",
        "What a perfect combination of brilliant acting,good plot and awesome direction with hitting all the right notes,also showing all the day to day problems of real india. Well done TVF!!",
        "Amazing web series with loads of humor wrapped up in a good story and amazing performances.",
        "I'll just start with.. it's an amazing series and I am a fan now! The casting is so well done you don't think for a second ..anyone is acting. If you've ever stayed in a village you would so relate to it..better if you have attended any wedding there you'll die laughing in episode 3. The subtle portrayal of emotion and no drama throughout. I was in tears in 5th episode. Jeetu and raghuvir yadav We already love but the role of Up Pradhan and vikas is portrayed so well ..they reminded me of so many people from my village. And I can not end this review without talking about the background score ..it's so beautiful and goes amazingly well with the storyline. For me this series an absolute gem..do not skip it! Definitely a must watch!",
        "One word just awesome!!! This is what I expect from indian cinema ..but web series are doing it..",
        "Beautiful acting... Amazing story line, very well stitched together... It keeps you hooked... Cannot wait for another season... Love the actors and a fabulous direction too.... (Y)",
        "What an unique direction.great Casting.every single character minor or lead plays their role like they are not infront of camera.Full refreshment of mind.already watched two times.and keep it saved for further mood boost.deserves a full 10 on 10.",
        "This is quite a generic concept but the way TVF has presented it is outstanding. The scenario is too close to reality and jeetu adds the final touch to it. I binge watched it with my family and no one got bored even once. All the characters were chosen well and no one seems odd. It has comedy , emotions, struggle and everything that majority of youngsters go through. I recommend this to everyone, just go and watch this.",
        "One of the most realistic and grounded series. So proud of TVF",
        "Humble setting, loveable characters, creative writing and great acting. What's not to love about this show?! Veteran Raghuvir Yadav deserves more recognition in the industry. Brings back memories of watching great shows as Malgudi days and mungerilal ke haseen sapne.",
        "TVF doesn't disappoint. Period! Each and every episode is amazing. Makes you fall in love with the village life virtually.",
        "It's awesome . ...bway better than Mirzapur and sacred games..",
        "The show riminds you of the movie Swades, ( infact there is a reference to the same when Abhishek's friend calls him Mohan Bhargava(Shahrukh Khan's charector in Swades). However it shows the the village life and its contrast with what people in urban India feel about it. Even after 16 years of Swades releasing, nothing has changed much in Rural India. Makers have shown this well bybcertain examples like the power cuts, No television being shown anywhere, people don't know what's the difference between monitor and computer and the best - no idea about the concept of Weekend . Lead characters have done a wonderful job although some of the supporting charecters could have been better. Similarly photography could have been better considering the background that was available. Waiting for the season 2",
        "Produced by TVF (Permanent Roommates, Tripling). Set in a rural area. Slow but interesting. I was able to predict the ending after watching the 1st episode. Looking forward to another season. Overall=average++",
        "A light hearted and a family web series, it showcase village in an incredible way/ the way it is. Really loved the show, would recommend everyone to watch it.",
        "Every actor, every aspect of this series is simply awesome. My teenage daughter, who doesn't watch any hindi series or movie, also loved it. Already waiting for season 2",
        "Simple story, simple characters, beautiful presentation. I loved it.",
        "Wonderful and unexpected ending...just loved it... awesome story line",
        "The series is really excilent and mainly focus on what actual things that happens in small rural villages. For instance gender equality, cast discrimination and all. We all know that this series is directed by TVF and they always do their job from their heart. Panchayat is streaming on Prime Video. Series of Prime Video like Mirzapur shows dark sides of rural India but this series politely shows that how and actually what happen in rural villages. One can connect this story to themselves who lives or seen rural villages.",
        "So good that it was suggested by my teacher to watch it. Especially if you get stressed, depressed or jammed after studies.\n\nA sweet warm story and you'll love every part of it.\n\nOh! I just wish it does get a season 2.",
        "Now thats what an intellectual program is. such a beautiful classy and elegant yet simple story!",
        "A perfect series in this time of distress. Talks and shows what is the ground root of India.",
        "This web series is just awesome.It seems like a real life story running in front of you.Really too good content TVF!",
        "Panchayat is very refreshing story, light hearted comedy and have authentic setting. The series has a social message without being preachy.\n\nWell generally people say do what you love but Panchayat also focuses on the point that love what you do. Its very practical and never gets boring.\n\nThe casting is great and Jitendra as always fits in perfectly. Neena Gupta has a very solid personality. Raghuvir Yadav wins heart by soothing personality. Chandan and Faisal did great job.\n\nGood work TVF.",
        "Top class acting and direction 👌 The lead and the support team was simple spot on",
        "What a beautiful story with drama and humour at the same time....Kudos to all the team members of TVF for making this.... Jeetu Bhaiya rocked again..",
        "Jeetu bhaiya is next big thing , he is one of the finest actor.....",
        "Enjoyed every episode, clean entertainer you can watch it with your family perfect for this quarantine 👌",
        "'Panchayat' is what 'Swades' should have been - realistic, relatable, self-assured. It's not 'Newton' either - it's light, mirthful and feel-good. Couldn't help falling in love with the characters.",
        "If maximum rating is 10 its deserve 10+ its better than secret games and mirzapur.. super acting done by Jitendar kumar, Raghuvir yadav, Faisal malik, Chandan roy and Neena malik... specialy Chandan roy you deserve more brother.... I don't understand why people review it less than 9 star I feel every thing is perfect in content.... jin logo ki favourite movie HAPPY NEW YEAR hai please yha review na de..",
        "The story, logical decision, acting among many other things its one of the best...... The real drama....one of the best drama web series I watch in Indian plot... chef d'oeuvre",
        "It may not be the usual webseries kind that we are used to, but it's definitely a different one which you can sit and enjoy with your family and friends. You would definitely have one avisek sir/vikas and definitely a prahlad in your life, but the undercurrent is definitely the Mrs.Pradhan. and spl performance by Mr.Lauki for playing an important part in some episodes. It's a cool evening breeze which you can sit and enjoy with a cuppa chai. #ottplatforms-a golden phase for script writers.",
        "This web series is very amazing I really loved it, i recommended to all that they have to see it the rural inda ♥",
        "This series is full of real India village story.Those who live in city they should must watch it.After KOTA FACTORY, this is the best.....",
        "Simple & subtle series with running time of just 4hours showcasing the simple yet fun presentation & realistic characterizations. Young man from city going to the small village for sole purpose of job having no option left, finding everything irritable there which was indeed relatable. The village life, love hate relationships, politics and money everything was happening in a small village& were depicted in its simplest way yet in an engaging manner which holds you till it ends making sure you're binge watching it. Strong cast in leads featuring Jitendra Kumar, Raghubir Yadav & Neena Gupta were in total grip of their characters and were spot on. Also, here I would like to praise the supporting cast including Chandan Roy & Faisal Malik as they were equally good & delivered a watch worthy performance.",
        "Brilliant series by TVF , best screenplay , direction & acting. I can't wait for season 2 , eagerly waiting to see how the story move forward with Abhishek & Rinki",
        "It's great to see such a piece of art showing true Indian flavours in term of culture and everything with humour feel as if watching unstoppable. it should be continued with season 2 and should not be discontinued.",
        "It is a nice movie.....every incident, shown here is very practical....gives a good lesson at the end....an ideal movie for this generation students....overall awesome.",
        "The plot is simple, truthful and will be relatable to most of the audience which TVF has been doing for a very long time. No need to mention about the acting of Jeetu and Raghubir Yadav which has been exceptional, but not to forget about Chandan Roy who has done a phenomenal job of playing the character of Vikas.",
        "It is a series right from the heart of India. Production design and cinematography takes you to the real villages of India. Superlative performances by Raghubir Yadav,Neena Gupta, Jitendra Kumar and Chandan Roy. Direction is top notch and the writing needs to be given a special mention because the wit and humour used in the dialogues is so natural that it is difficult to find these days.",
        "A simple heart touching and brilliant series kudos to tvf team",
        "Most be see the web serie.All are good to work this web series.",
        "I have watched thousands of tv series and movies . Let me tell you about me something . I was born and raised in mathura . Our local language , customs , way of doing things , way of understanding things and each and every minor detail is shown in this brilliant series . Whoever made this deserve a oscar . They also shows us how politicians are filthy no matter which party they belong to . They shows us how young boys die in political warfare in kashmir . Well done . Really inspiring.",
        "This series works better than any other productions of TVF for many reasons, but primarily because of the presence of Raghuvir Yadav and Jitesh Kumar. The narrative is fresh, worked out screenplay ,beautifully executed which adds to the convincing storytelling. Personally, I loved it more than Kota Factory. I would recommend watching it for sure even if it meant you were to being missing out other series.",
        "The content and acting is so powerful you will never be bored. The whole series looks realistic and perfectly well directed. Every character did their best specially jitendra and faisal. Raghubir also did splendid job. And the struggle behind getting a job was shown in that series perfectly",
        "Indian rural life is shiwn through the gaze of an outsider, who eventually becomes a part of it without realising. It has the sweet essence of simplicity, without the overdramatic Bollywoodness of it all.",
        "Really enjoyed this series. Probably the best of TVF Great writing and direction. Everything looks real, super acting performances by all the cast. Lovely background score and cinematography. Loved the opening title montage and montages throughout the series. The pacing is the king of this show... Pls make season 2",
        "This series is amazingly superb. Acting and story line is fantastic. Everyone has done justice to their role and it was a natural acting. We did binge watching. At the end of 8th episode, felt like it should go on. Must watch series!!!!!!",
        "Another Masterpiece by TVF. They have captured the true essence of UP village. All 8 episodes are gems",
        "So the official release date of Season 2 was 20th May but Amazon released it two days before.\n\nThe best part of this season is that it isn't very out of pace from the 1st season. But the screenplay could have been more tight. I have given 10 rating for the hardwork of the TVF's team.",
        "A Slice-of-Life Comedy Drama that took me back to my childhood when National TV had shows like Nukkad & Circus, when tv shows used to have quality and heart. A City guy lands a Government job in a rural village and he suddenly finds himself surrounded with people with whom he doesn't have any common ground and one after another stupid things start to happen. The performances and writing are the stars here. TVF knows how to write authentic Indian characters and the struggles they go through. Jitendra Kumar does a great job as the protagonist and then there are those incredible supporting actors like Raghubir Yadav and Neena Gupta who steal the show. Music and Cinematography were surprisingly good also. Its such an easy watch, I breezed through all episodes in a day.",
        "Very Good Writing , All the scenes were so Natural.\n\nNo scenes were exaggerated.\n\nAll Characters were phenomenon.\n\nS02 Last episode Left me In Tears .\n\nEmotional Ending .\n\nWaiting for Next Season.",
        "It may sound very exaggerated if we say this series is nostalgic and fantastic as we start with it, but couple of episodes binge watching down will get you realize it's very true! First of all, huge applause for the writers and Creators of this series, that happen to get absolutely new and unique storyline! All of us have at least seen a bit of village and this series makes you all nostalgic about it, making it so relevant that village life is the coolest life! The casting is totally appropriate and each episode brings some new story. Cool... Awaiting season 2! Well done TVF!",
        "Just finished this on one go binge worthy series. It showed the real village drama based on the panchayat system with comedy and good emotion.",
        "Great. Worth watching. Nhice story of a man lived in city.",
        "Panchayat is the pure example of making something so simple yet effective at the same time. It's an 8 episodes series where each ep. contains various phases of Abhishek (Jitendra Kumar), as he joins as secretary of Panchayat in the small village of UP. The Simplicity and The Supporting cast are the most Amazing parts; Everyone has their own identity and input for the series. Humorous dialogues, Realistic nature, Beautiful & On Point Execution with Impressive performances of all actors do make this binge-worthy. TVF and Jeetu Bhaiya did it again with this light-hearted Comedy Drama named Panchayat! Highly recommended! ❤",
        "What a wonderful show. Hats off to creators. One of the best show I have watched in Amazon prime is Panchayat. You want to see real india yes, you can see the real India in this show. I very much liked this show Only because of no stereotypes, fake english accent, fake emotions and also for showing the rural peoples lives in Village which was calm, betterment, their lifestyles, practices beautiful captured in Panchayat. This is where the so called Bollywood failes. A must watch.",
        "Panchayat is the most bingeable show on Amazon Prime right now. Story is about a heartwarming journey of a young ambitious urban person posted in a rural set-up. Just light comedy drama. Loved it. All actors justified their job. Well done. Some lovely writing and great shots of the village life Life's greatest lessons are learnt through pain. #TVF #Prime",
        "This is my 1st review here on iMDB and its absolutely worth it. Be it the natural acting of all the actors or the camera work or music it's just perfect. I watched all 8 episode at a go. Thank you TVF for making awesome webseries like this. proud of you :)",
        "Such a simple story which is well executed. Jitendra is perfectly cast and does complete justice to his role. It gives an insight into the functioning of village administration. You cannot miss this one.",
        "Excellent, fabulous, rustic! Can't wait for season 2",
        "Now a days this type of series can't be seen.. Great series.. Showing true rural India.",
        "Panchayat web series shows the village and their peoples so realistically.. Jeetendra, neena and raghubir done their roles very nicely.. the debutant chandan roy acting is also very good.. this series captures the village atmosphere very beautifully... If a person wants to see a realistic web series then panchayat is highly recommended..",
        "Just laugh. Leave brains out and enjoy. The end is very abrupt. But I guess that is intentionally for the next season",
        "What a simple ,plain ,excellent story with awesome performances by all the people. You wll get into the story because you cannot identify difference between feel and real because it looks absolutely real story..hats off to the directors and actors jitender ji and vikas(story name)",
        "Why more content like this is not available on the internet? I must say this is one of the best Indian series that I have watched. It accurately depicts the life of people in the village. In every scene there is are humorous details that really added to the already amazing scenes. For example, while setting up the solar light there is a wooden wedge shoved in the pole to fit the light(JUGAAD) and many more. The acting of the actors are really good especially the actor playing Vikas (Chandan Roy).\n\nI really enjoyed the series and I sincerely hope there is a season 2.",
        "A beautiful story reflecting rural life with simplicity, reality, chemistry and good humour. Loved the cast and how every character is justified. Amazing roles played by Jitendra Kumar, Raghuvir Yadav and Neena Gupta; and loved the rural humour portrayed by Chadan Roy and Faisal Malik.\n\nAnother good contribution by TVF and great watch for every age group! I hope there is another season planned and keen to know how the character 'Rinki' comes into play.",
        "It's goes steady like some calm clement breeze. Simple n beautiful. Waiting from r next season",
        "The Story is very good and the Actings of Jitu is as usual Best..The Comedy scenes are great..The Story feels too real and natural.. Would prefer everyone to watch..and anyone will not be bored for even 1min.",
        "Story is simple but that's good... execution of the story is good.. actings are Good..Small comedy scenes are too Good just loved it",
        "When awesome screenplay meets a mature acting then such great work is built. Hatsoff",
        "This series depicts the village life and a common Indian youth in an excellent manner.Well done everybody.Must watch for all the Indian web series lovers.",
        "Storyline and characters are awesome plus the way all goes.",
        "With every streaming platform trying to include one great crime/psychological thriller, Panchayat is extremely remote from that world. Panchayat comes with sugary innocence, authenticity and lots of affection towards each other. The problems portrayed in the every episode look eccentric or trivial to us but for the villagers they are quite significant. Jeetendra Kumar and Raghubir Yadav shines their part and creates a very amicable world around them. Very honest writing and cinematography, you will not find anything over the top, extravagant or superfluous. It is not as brilliant as their \"Kota Factory\" or \"Gullak\" but still a decent watch in current times.",
        "What a story and cast.. TVF never fails to impress. Every single detail was well captured through realistic dialog delivery and the shoot location..Vikas was one of the most charming character. Everyone should have friend like Vikas. All actors were fabulous \"every single one\". and this rarely happens.. So highly recommend and waiting for new season with more interesting episodes.",
        "What I like the most about this series is the storyline. It's entirely out of the box. Everyone did pure justice with their character. Natural acting, catchy but simple story, and the social message make it perfect.",
        "This show is simply amazing,you will fall in love with each of the characters. Also ,two important things that are being highlighted are women empowerment and importance of rural india in today's era.",
        "Superb.. love it. Web series is very good. Different from what we saw today. Must watch",
        "Too good. Must watch light hearted grassroots show...",
        "Loved it. Acting of Jitu Bhiaya and other cast are superb!!",
        "After pounding our heads watching a lot of action, drama, zombie horrors on the web, this one comes as a welcome change. Jitendra and the rest of the cast are first rate. After watching this series, you'd feel like you gulped a mentos after a very spicy meal. Highly recommend",
        "It's so relatable - A treat to watch! Beginning to end keeps you soaked in the genuine rural India moments. No wonder TVF is a Gem of a Contents! The writer has so beautifully portrayed the ambition of common students through their situation and circumstances in a jolly way within the rural manners. I'm a big Jeetu fan and again and again, he amazes me with his genuine appearance. No lesser, Neena Gupta is another synonym of Incredible. Huge cheers for the entire crew and cast especially Chandan and Raghuvir. Together they make it a delightful watch. I especially enjoyed the curious appearance of the center cast Rinky! Throughout the series, there are plenty of laughs but just as many genuine moments of emotion. I'm sure every next episode will force you to pause and feel for the people in this quirky tale.",
        "I was so happy to watch this web series. Eagerly waiting for season 2. Thank you TVF.",
        "As we know about TVF, they have perfectly show the dilemma of a guy who is perusing his government & want to fulfill his future goals. A perfect combination of rural lifestyle & urban guy who try to fix in.......",
        "One of the finest depiction of rural India with the mix of political satire. Acting by all the cast members specially Jeetu and Raghubir sir is so damn great. Script and direction seems so apt.",
        "A very good direction. Every character has played a memorable role",
        "Its the first ever series which i seen....so....nothing to say........",
        "Superb all the way. It's clean, point to point with no-nonsense & overdo. The realistically thoughtful storyline with each episode having a different plot turns out beautifully. Smooth storytelling, fine acting. One must watch it.",
        "Loved the way simplicity and sense of attachment we Indians have is shown . Also the message of Try again , Never give up is shown .",
        "I loved this web series so much because of its script , beautiful cinematography, acting . I highly recommend this web series who love simple, light and heartwarming web series. one should watch this web series for the awesome acting of jitendra kumar, faisal malik and chandan roy. all the actors in this web series have acted very naturally, anyone who expects roughness and action in this web series, then he should avoid watching this web series beacause this is strictly for drama, comedy web series lovers. I think we should watch this kind of web series rather than watching serials like kundali bahgya kum kum bhagya to bring in front the talent of this natural actors especially jitendra kumar (jeetu bhaiya).......",
        "Impressive adaptation of the local culture, language dialect. Kudos to team TVF",
        "What a beautiful series - one of my top 3 ever - kudos to Prime for producing this masterpiece- at the level of Malgudi days when it had come\n\nPlease produce season 2",
        "Good to see how high quality can be churned out from potentially low budget.",
        "Superb l8ved it really its vry nyc suppppbbb there is a way to see how to compare the real life ( village life) and the reel life (city life)",
        "Musr watch....Great cinematography and good acting makes it watchable",
        "Another awesome web series by Prime. The simplicity mixed with black comedy. Every episode was a journey in itself. Waiting for season 2.",
        "Authentic, brilliant acting, direction, screenplay",
        "From tvf pitchers to panchyat. Jitu bhai a.k.a Jitendra Kumar has never made me feel disappointed in acting. Amazing script and direction. No nudity, no fake acting only pure show. Expecting season 2 soon.",
        "Superb acting by all, usually 1st season good for every series but in 2nd it goes down but Panchayat is exceptional, great work. Let's wait for the clip to be Viral.",
        "This is an interesting series about rural village life in India. However, the content is so targeted and specific, unless you understand the culture of the country and village life there, it will have very limited appeal at a global level. I enjoyed it because I am familiar with the environment, others may not. It does deserve a second season but the stories may have to be made a bit more interesting, perhaps even tackling serious social issues that do occur within that environment. It does show the competitive nature of landing a good city job in the private sector in India, if you are not willing to push yourself or lack connections, and the need for those who are unsuccessful to find a job in the civil service and do their best to try and move up in that system. As it stands, it's a light and entertaining comedy with a strong \"feel good\" component.",
        "Oozing beauty from every nook and corner of this creation. Fabulous performance by everyone, story, direction and whatever. And the background score with those numbers, very good taste. I hope the next series wouldn't turn into a romantic tug of war timewaster.",
        "I'm rating it one star less only because I can't watch this with family because of cuss words. You could have just beeped out those words.",
        "Best web series till date...Must watch...Complete love.",
        "Hats off to the cast. The way all the actors have pulled off their roles is commendable. The story is highly relatable and the direction too is crisp (if you ignore minor loopholes). A must watch for light entertainment.",
        "Simple storyline... few characters but amazing acting. Every character did justice to the show. No over acting but plain humor. Loved it!",
        "Most appreciating thing istopic of this web series.Full family comedy show. There is no vulgarity, no violance, no bad poiltical scenes. Total classic Web Series with masterpiece acting of Jitendra Kumar, Rghuvir Yadav & Neena Gupta. Very short episodes can't irritate you.",
        "Casting for this series is best .Each and every actors played their role beautiful .\n\nSimplicity and acting and story are at best.enjoyed every scene of this series...............................",
        "Just finished watching Season 2. It was not like Season 1 but still you can call it a decent Season. It has some light hearted, funny and emotional moments. Specially climax was very emotional. If you are going to watch season 2 then keep your expectations low and enjoy with family.",
        "Panchayat, the web series on Amazon prime is a gem which depicts rural India's problems on a blunt scale but makes us feel its hard hitting resonance.\n\nIt tells a story of a young man in his mid 20s, who unable to find a job in the corporate sector settles for the job of a panchayat secretary for a meagrely salary. The innocence of rural India is depicted beautifully in this well written show which is filled with truckloads of humour. The lazy style of film making was an excellent idea to suit the pace of the story. Raghuvir Yadav as the headman and Jitendra Kumar's portrayal of the secretary was very nice.\n\nThe show focuses on social issues plaguing rural India ranging from patriarchy to superstition and is laced with black comedy.Panchayat is a must watch for everyone who lives in urban India and watch villages only in movies.",
        "Very interesting story with wonderful screenplay. I watched all episodes in one sitting. Go and watch. You will not disappoint.",
        "Very well made season one. All HODs and departments need to be lauded. The best is the simplicity maintained throughout. Defintely waiting for the second season. 👏👏👏",
        "Abishek is a graduate who looks for a job and gets one as a panchayat secretary in a village. Though he is not happy with this job he goes for it and decides to prepare for CAT exam simultaneously. The story is about the events that occur in the vllage and how it affects him. It is a good comedy series to watch without any second thoughts. You won't get bored at any point although there is no big twist or thriller the series is fun to watch as it is. It gives us a glimpse of how good a village and its people are. And the background score as well gives it an classical mojo feel.",
        "Jeetu once again, never misses us to entertain. What an actor. Entire cast of Panchayat has delivered an awesome performance. Its a must watch wholesome entertainment. Expecting a second series.",
        "It's simple yet so lovely. Each of the 8 episodes deals with one simple topic.shows the condition of the real rural India. Jeetu is in his usual TVF character but Raghuvir Yadav as Pradhan is the best character. Must watch in this quarantine/lockdown period.",
        "This web series has comedy, drama, entertainment and most importantly it shows the reality. Everything that is shown is genuine from misuse of women quota in elections to ego fights, from rumours of ghosts to everybody helping each other in need and all that we have heard about villages from our elders. And also TVF has always related to the pain of a carrier wise unhappy engineer ;) .",
        "Shandaaar series One of the best series of jitendra👍💯",
        "The best thing about show is it's story telling...another amazing creation by tvf..waiting for next season. Casting is best. Everyone has given justice to the role. Jitendra Kumar is the best as always. Simplicity is not spoiled in new season as well. Cheers to the team.",
        "Another great web series by TVF. Even small small lines are funny, and of course star cast is amazing,they justify there role. Of you want to just relax and enjoy,than this is the show.",
        "Feel good show. Performances were amazing, Screenplay were amazing. You will get that feel of Indian village. The journey is what this show has to offer.",
        "Brilliant season which captures stories which happen in day to day life especially in rural area.",
        "Panchayat (Village Council) is a pleasant watch with frontman Kumar's usual style and characterisation but it still depends on the tropes involved when you put a man from city into a government job at a council in a remote village. In the pilot season, you can predict what's about to happen in almost all episodes. But there are still some novelties in here which will bring a smile to your face. Nod to Raghubir Yadav and Neena Gupta as well as the other supporting actors for a good showput. TN.",
        "I have watched the complete series at once. Just loved the rawness of village life presented in the series. And ofcourse Jitu's acting was a add on. The way series have portrayed the life of villager and its political situations, is really commendable. Good work TVF.",
        "I think I am seeing the revolution in Indian cinema made infront of my eyes. such a beautiful story and the script pierces your heart with hard reality of life. I can't say enough for this masterpiece. P.S. I haven't researched enough about the writers and cinematographers but they are damn good! Jitu is the new legend we witnessed again and he deserves every possible appreciation for the success of this web series.",
        "Watched it as soon as it got released today. Scenes, costumes, dialogues, setting, everything looks so authentic! Acting is superb, all the actors have done a great job! After I finished it, I put it on again and re watched with my family. They also loved it!",
        "Actors have done a great job and comedy is also great and it take some important steps is showing How to take responsibility and should work hard and Never give up but in a great comedy and fun way Loved it👍👍",
        "TVF tried very good and also idea was good to present the actual situations of rural areas and their people mentality Like the corruption level, education level of people, thinking level. It was well acted series specially by jitendra kumar. He has brilliant skills of acting. Series targeted so many rural concepts and that was nice\n\nHowever, this time TVF has made some mistakes which was not there in Kota factory, pitchers. First the theme music was copied from narcos web series. In this series I felt some lack of humor as well. They could have shown more facts about rural areas but the cause was series is very slow that's why they ran out of time to show it. At some point I felt boring because of not enough comedy and slow motion.",
        "Overrated as per review trend suggest most of the reviewer didn't had rural life experience Lack of depth in writing, and research, tvf should think that they are not making short videos of youtube Their should be good balance between simplicity and reality , same problem was with kota factory Hostel daze was good",
        "Excellent Script storyline ! Still in Aww of acting scripting !! Screenplay !! Theatre actors Mr . Yadav is excellent and emerging actor Jitendra the more I see of him he just keeps improving ! Commercial steam as it's own charm but actors like Neena Gupta ,Raghuvir Yadav,Jitendra are true stars who purely through their acting can keep you glued for the series ! Good work and look for more like these .",
        "A soft comedy will make your day fresh ... In the end you will had a sweet smile in your face....acting was too good from every actor",
        "Speeches behind the truth. No over-drama else. Glazing fragment with a flavor of absolute soil. As well as the expressions of annoyance have been developed earnestly by all casts.\n\nRinki could get more scenes if it was a movie with masala but the relaxed director been clearly used the web perfume.",
        "The best series I have ever seen from India. You will postpone your work if you start watching the comedy-drama series An engineering graduate's job journey in the village. Great job, team! :)",
        "AWESOME WEB SERIES, enjoyed every scene. NO NEPO KIDS equals to game changer piece and awesome acting.",
        "This is how a series should be made. Close to reality. These kind of series makes us connect to the story and the characters.\n\nP.S - They finally showed us Rinky \\o/",
        "Very ordinary tv show. Best part was introduction of Rinky. Nothing special. Intro music was almost like Narcos intro.\n\nIn the real life, village politics are much more critical.",
        "Binge watched season 2 and enjoyed it so much. It retains the feel and character of season 1. All the characters including new ones are phenomenal. What an amazing web series which isn't adulterated with conventional bollywood essentials. Must watch.",
        "Yes the tag line is \" Thumbs Up\" that's why the title of this review. beautifully crafted and novel in approach I rated it 9 because I expected a longer season, eight episodes are too less to rate any show higher. Great timing and spontaneous acting by the ensemble makes the whole show a natural experience. Hope another set of episodes follow in the current season itself.",
        "One thing where this series doesn't fail you is the acting department, it's mind-blowing by the entire lead cast. Story, however, is very average and looks like a wasted opportunity. Art director has done a pretty good job and so has the camera team, using a lots of drone shots, which gives it a very unique country feel. Music blends well with the scenes but nothing that you will remember. Decent effort but falls short of what it could have been. Keep going, TVF!",
        "I feel that this show would have been much better with-out Jeetu in it. The show is let down by his mediocre acting portraying an angry young man. His needless yelling and berating other characters in the drama series seemed excessive & stupid in places.\n\nRaghuvir Yadav and Neena gupta (and their corresponding characters) were very good and carries the series on their shoulders.\n\nI will rate this as a mediocre series due to the lack of a quality lead character.",
        "As always tvf did it again amazing series. Actors performance is top notch too just give it a chance without thinking twice",
        "All the actors have given their best shot in the series. Every shot keeps us deep into the real village feel. Waiting for next season.",
        "Raghubir Yadav and Neena Gupta stole the show. Their presence in each scene was hilarious, natural and pure. Jitendra Kumar hatts off to you and your team(the two men along with you). The police inspector and the village.\n\nI watched it with my parents, they too were in love and are waiting for season 2. 10/10/.",
        "Panchayat is one of the best series I have seen in a long time. It was so relatable at a human level. The portrayal of rural India is immaculate. Having given CAT, I completely relate to the frustrations of Jitendra in the series.\n\nExcitedly waiting for the sequel.",
        "Loved every bit of it. It looks so real and great acting by all of the actors - and jeetu my god - exceptional guy",
        "Awesome series. Amazing story with a captivating cast puts realism at the front!",
        "What a Brilliant Series... You can feel the soil of village.. A must watch series...",
        "Simple story, well written and conceptualized. Watched it straight and thoroughly enjoyed.",
        "This show is a complete perfection. The show has captured the true essence of a typical Indian Village with the help of exceptional storytelling. Not just that, the production level is outstanding. The show has immense capacity to keep the viewer sticked to there screens. Nothing is over done. We get the taste of comedy, drama, suspence and every else in the most perfect sense. Thank you TVF.",
        "If you are tired being watch those crime thrillers and dark web series,this will definitely redeem you. It has a calm vibe which make you happy and you will eventually feel good. It hasn't very intense storyline.Story revolves around Abhishek who just joined as panchayat secretary at Phulera,a village in UP. Screenplay is excellent as other TVF series and some shots make the cinematography very aesthetic. Acting is superb for everyone but we should specially mention Jitender Kumar and Raghuvir Jadav,but somewhere Nina Gupta should have more screen space as she is a brilliant actor. Overall to make yourself feel revive watch this and this series is a must watch .",
        "Story of patience, courage, friendship and motivation",
        "I enjoy watching TVF creations. So when I came to know about apna Jitu bhaiya doing a show like Panchayat I couldn't miss it. The season 2 of the series is also as good as its predecessor. But this time, the characters have evolved. Each episode starts with a preview of the episode's issue and the rest shows how the Panchayat team overcomes the hurdle. All the episodes were funny, but the finale was heart-breaking. It felt as if someone had taken out my heart and held it in their hands, not allowing to beat. I literally cried at the last episode, and it showed how the characters were each others' support system in times of grief. I wish TVF also brings in Nidhi Bisht and Shivankit Singh on board somehow.",
        "After finishing all episode, now I am sad especially when I watched last episode my eyes we're wet. Good work panchayat 2 team.\n\nI was watching it for abhishek and rinky chemistry, but series unfolded into different direction. I had watched it in one go. It is not are regular drama it is something else.",
        "You must take this motorbike ride with Jeetu towards the rural roads of India.",
        "They have definitely not been in a UP village.\n\nTotal drama, mostly inaccurate representation of villages of UP. Had the story been made in 90s and early 2000s it might have been accurate.",
        "If it were possible I would give it 6.75 out of 10. Basically this is the best show to ever come out of TVF. It is very grounded and doesn't swear just for the sake of it which ever other tvf show does. There is focus and a medium pacing. There are a lot of plausible moments and some really funny once too! Love the believable character. Overall it's an average watch which you will enjoy! I think they shouldn't go for season 2 since it's a short and sweet season long story.",
        "Just one word awesome.A story which has been beautifully portrayed and captures the life of Indian villages.Jitendra once again compels us to praise his brilliant acting skills .No better debut than Panchayat for Chandan Roy aka Vikas who steals the show with his smile and dialogues.Overall a perfect web series which you can watch it with your family and OTT platforms need more web series like this.Eagerly waiting for season 2....😊",
        "You guys have already set a bar and when you do this kinda things, I feel bad. I'm not saying the show is bad. It's not. Trust me. But it doesn't qualify your benchmark. All the cast is great, acting awesome, direction perfect but the story is little boring. And sometimes you loose interest. Sorry guys being harsh but you've made so many great shows that I feel this time it was lacking something.",
        "Wondering how did it get the 9 rating. Over the period, expect it to come down to 6 or 7. The show is disappointing, especially as it comes from TVF. Most of the scenes should have been cut or edited. It gets painfully slow and boring. Survived the first episode somehow in the hope it might turn out better subsequently. Finally gave up in the middle of 2nd episode and decided not to waste any more time. Perhaps should be edited a bit-that would improve it a bit but not sure it would change anything so much that you would be happy to put in your precious hours.",
        "An absolute Series for a Billion to watch... Simplicity on a mission... Our culture with a shimmy of arrogance !!",
        "Wow, this a very interesting show.\n\nAt first I didn't know what to expect from the premise. This is an almost complete package of emotion (funny, sad, touching) yet also full of absurdities and wisdom.\n\nEvery episode has their own theme and they left the very best scene at the very end of each episode.\n\nJust watch it and enjoy the ride.",
        "The way Indian cinema has long represented our everyday living was far from the reality. It sugarcoated our lifestyle, revolving around the chapters that should have been closed long time back, and worse, relying on the kind of music that doesn't channelise the momentum. But Panchayat isn't all this. Panchayat is a simple, meaningful drama. At its best, a kind of cinema that amazes and leaves you with various emotions at play. We are slowly heading there where cinema shares a bit of us all. Panchayat is that another step in a long run. Go, watch!",
        "Very well written script, each character has given atmost importance. Good story in each episode , very fresh and engaging. Definitely worth watching and cannot wait for 2nd season .",
        "It makes you laugh, it makes you cry. But in the end it makes you feel like home. A good second season of a show is very hard to find these days, but this gem gives you a great 2nd season as it promised. A great watch and \"Jitu Bhaiyya\" as usual a treat to the eyes.",
        "Jittu bhaiya is best always, hilariously done by all main characters. Panchayat is the small village's daily life needs with politics. Raghuvir Yadav first time watched him in Chacha Chaudhary and Saboo show (Maybe) and I loved the way He simply talks or deliver the dialogue is great.. Neena Madam is cheery of the cake. Faisal sir is good too. But Shahayak Sir (Vikas) i mean Chandan Roy He always makes me smile whenver he comes to the screen. I loved the Work.. I'll wait for next Season.. Keep it up team TVF. Now every Age of people will know the Awesomeness of Team TVF and The Artists. Waiting for next panchayat... Bulaiga jaroor.\nitsbymayank\nMayank Bharat Bhushan Louteriya",
        "If it has Jeetu Bhaiya or is a Tvf creation watch it without a second thought! This one's got both! A gem.",
        "Fantastic! I can't express my feeling. This series is a masterpiece. Raghuvir Yadhav and Jitendra Kumar nailed it literally....",
        "This isn't something you can watch and forget. The characters stays with you forever. Didn't expect them to recreate the magic Kota Factory created.\n\nThe four main characters were crafted to perfection. Only rarely can we see such smartly written charcters those stuck you straight into their world. The writers has won my respect for their genius.\n\nActing was perfect from the start to ending seconds. Gives you a glimpse of the lives of village people and their characters with their flaws and imperfections. And the main character done by jeetu was lifelike. This is a life lesson and a very good and motivational one at it.",
        "Great show and Throughout the series I'm actually and genuinely excited for the love story of Abhishek and Rinki in next season. Super excited for season 2.",
        "Must Watch And Fully Entertaining , Light Hearted Comedy Series. Panchayat Series Show You The Realastic & Beautiful India , Rural India. This Is Full Paisa Vasool Drama To Make This Binge-Worthy Series During This Lockdown.\n\nI Feel So Nostalgic While Watching This Panchayat Series. Story Will Show You Simplicity , Supporting And Real Nature Of Village ( UP & Bihar ) And People There.\n\nSupporting Cast Are Very Important Part & Everyone Have Their Own Unique Identity. Humorous Dialogues And Impressive Performances By All Actors. Jitu Bhaiya Did It Again With His Acting Skills And Unique Concept.\n\nThanks TVF For This Superb Series , Highly Recommended.",
        "Slice of life series with standalone episodes. Episodes don't have much continuity. Humorous and depicts the slow paced yet enchanting life of rural India. Like the protagonist, the viewer eventually falls in love with Phulera village and can't get enough of it.",
        "Finally a indian comedy web series with very few foul languages, no double meaning jokes and no sexual content. When was the last time this type of series was made? It's very grounded and many of us can relate it. Acting was top class by every single character, they adopted their role so well you can't differentiate between a villager and actor. I reduced one star just because of last two episodes. They were great but could be more better or i was expecting high i don't know but overall it's a masterpiece.",
        "What a web series i have seen today.. never cried for any web series ever.. This is the best evr series i hv seen so far.. season 01 is awsmm and season 02 is full of emtion and comedy which makes it more better and beautifull.. Each and evry character are best of best... even a character with a small role has given their best for it.. Thanks to TVF for making such an amazing web series.. Hope to see s03 soon..",
        "Watched a beautiful series after a long time. It leaves a very good feel of the village life. Completed the series in 1 day . Waiting for the second season. Another gem from TVF.",
        "I didn't have very high hopes from this series, but I'm happy to have been proven wrong. It was nicely done and interesting enough for me to binge watch the whole series in a day. I do miss watching the episodes now though. The storyline was wonderful and all the actors did justice to their respective roles. Definitely recommend you to watch the first episode at least (you'll be hooked for sure).",
        "This web series is so simple yet amazing.\n\nThe story is simple. City boy comes to village to work. He faces various problems he didn't face in the city. He is amazed by how things work in the village and hardly wants to be there.\n\nThrough all his worries, the audience are on the receiving end of a masterpiece.\n\nLimited number of characters but superb acting and comedy.\n\nDon't miss this one and be sure to watch it with family!",
        "I liked for various reason. I believe everyone must watch this series.",
        "Lovely story line. With exact portray avarage north Indian village. The actors did the fantastic job.",
        "This series is a burst of smile, laughter and good feeling. You will fall in love with every character. You will fall in love with gram panchayat.\n\nIt's a fun filled, light hearted, must watch show!",
        "Such a simple idea, executed with such good knowledge and information.. keeping things realistic\n\nThis series is one of the best I've seen India produce.. it goes to places as a foreign series.. keeping things simple. A lot of action happens through words and silence and emotion\n\nA series family can enjoy, understand and explain real India. It dosent apply with tropes either, it keeps balance in mind to an extremely good extent and still grips you on.\n\nAnd props for making this a short series.. dosent seem anything is overdone here (which even the biggest tv series like Breaking Bad suffice with)",
        "In recent days this is one of the best series I have seen. The story is so soothing and it is getting its climax step by step. All the character like panchayat secretary, panchyat pradhan, deputy pradhan, panchayat assistant boy, pradhan's wife all are extraordinary in their acting. At the end one will surely love every character. I like this series too much.",
        "In recent time one of the best series I have seen. The story is so soothing and without any violence and bloodshed. At the end one will surely love each and every character of this seris. what a striking acting. The panchayat secretary, pradhan, deputy pradhan, assistant boy, pradhan's wife all are individually awsome in their acting. I love this series too much.",
        "Loved it , loved it and loved it. Really hope there are more seasons in the future. Too bad it is in Hindi. Needs to be in English, so it has a global audience.",
        "It is a good show, but not as great as reviews are here...\n\nis it rated high being an Amazon Prime show?",
        "If you still wonder how real rural North India looks, talks, feels like.... Binge watch immediately...",
        "A beautiful,refreshing country experience. Amazngly Simple and original.",
        "This series brings u back to the root and teaches you to appreciate the simplicity in life . A treat to watch with family .",
        "Needs a better second season to actually deserve a rating over 8. So far, a 7 from me. Good plot and very fresh characters.",
        "Wonderful .. simple & honest.. heart touching. A visit to village.. all characters played well",
        "Big on show...\n\nLow on content\n\nAfter finishing 8 episodes... Nothing good about it.\n\nMediocre story line",
        "Amazing series. No dull moment. Humour in natural acting.",
        "This is so refreshing & satisfying to watch. More such shows are needed in the present era of meaningless remakes. Yet again, well done TVF!!",
        "Ultimate, Awesome acting of all characters.\n\nThere is also a lady councilor near my house whose face we have not seen yet. Her husband handles all the work.",
        "Show is very good binge watch worth . More then i expected from the show.",
        "This show is so so beautiful. The depiction of village is really rare. There is attention to each and every details. The characters are so lively and they fit in so well. Really a work of genius. Those eight episode seemed so less. I hope the next season comes really soon.",
        "Lovely performances by all the actors. Especially Chandan Roy (fresh and real acting). In love with the show and the characters since the first episode. We want at least 2 More seasons",
        "Just finished the first season. Hats off to the script writers of series for creating such a masterpiece. Attention to details and dialogues are so crisp that you will relates to the scenes easily. This show will leave a smile on your face when you are watching it and even after you are finished with it.\n\nAll the characters are lovely and funny specially Abhishek's (aka JITU ji for fans) assistant Vikas. The show will make you laugh, sad and hopeful time to time.\n\nHighly recommended. Go for it.",
        "OTT has lately been stuck in a genre. Panchayat totally breaks the stereotype genre of OTT content. It feels like a fresh breeze of air. Understones are beautiful. Episodes entertain individually as well. Jeetu, Neena, Raghu, and the assistant to Jeetu are fab.",
        "Simple life story of village.....show only good side of village..... normal comedy ....ok web series...if you free then watch it......time pass web series.... village People love this .....",
        "Brilliant show!! Everything is so perfect abt this show,,ths show has a heart,,its simple, rural India n real India story,,Amazing direction,, brilliant performances by some great set of actors, u wll feel for evry character,, especially the lead character played by jeetendra kumar,, raghuveer yadav & neena gupta r at top form,another amazing performance by thse seasoned actors,, even the supporting actors wre so brilliant,, seriously its a must watch for evryone!! Thumps up for the team n amazon prime for such a great show",
        "Every character played in this series are brilliant. every scene in all episode are wonderful. Can't wait for next season.",
        "To all those people who are tired and frustrated of fast paced life, please watch this show! It is so soothing and entertaining! Can't wait for the next season!",
        "If you have enough leisure, feel free to watch this beautiful story weaved around a rural village in India. The story is very practical and enjoying. You can relate almost every aspect.",
        "Totally wasted time. You can watch if u dont have to wqtxh anything. Very slow drama and nothing suspense or story till end.",
        "Just the moment when i saw that it was created by TVF, i was assured that it's something amazing, and it didn't disappoint. Thanks to the whole team of \"Panchayat\" for making this masterpiece. You can't even think of a single web-series these days that is made without immense amount of abusive language, lots of unwanted porn, and substance abuse. Panchayat just set an exceptional example for those rich fat but junk content creators. People literally can relate to the characters and situations of this series, that's how clear and simple it's script is. It's really good and i would recommend all my surrounding people to watch this.",
        "What a beautiful portrayal of rural india in this web series.how they live and how they behave in perticular situation is almost accurate 👍🏻👍🏻",
        "One if the best family web series for me I like Ye Meri family and now this Please release season 2 3 4 ... and many every month",
        "This series was much awaited considering it's TVF series with Jeetu in lead. The story background is interesting but is slow paced and lacks good screenplay. The characters are not so interesting. Overall, I was disappointed comparing it with Permanent Roommates, Pitchers and others.",
        "I am a person who is really critical of the indian content because of the declining quality and corruption withing the industry. This show has done something that none could do in decades, it has given me hope.\n\nHad a binge-watch with my family, they are fully satisfied and deemed it worth the time that they had invested, thank you.",
        "2nd season was beautifully Narrative with many Fun act, Best part was all the characters were doing their finest work in this season , so realistic that definitely gonna fall in love with this Show. At 1st they will make you Smile and at the end you will not only feel sad for the last episode but also flabbergastedflabbergasted by them. Gem of indian Entertainment .",
        "As simple as it can be. Jitendra Kumar won't disappoint you. And you know that well.",
        "I too live in village, and I totally connected with every single thing about this one. Beautiful, realistic and most importantly original.",
        "Every thing in this tv series fits very nicely together...acting, caste, dialogues, location filming, and execution all are in great balance.....",
        "As a TVF fan I had huge expectation from this series...and they delivered more than what I wanted. Great writing backed by brilliant acting. Each and every character is too real and organic. One of the best Indian series I have watched.",
        "Amazing character developments. The way they have made all the simple moments into such interesting episodes is extraordinary. No over the top dialogues or cheesy moments. They have carefully avoided the usual feel good moments and made this as fresh as they come. Haven't enjoyed a TV series so much in a long time. Must watch.",
        "Many people can connect with the condition of protagonist & his journey is enjoyable.",
        "Unpretentious is what this show is. The characters are so lovable almost feels like you have met your long lost friends once again. A very sweet slice of life with our very Desi touch makes it even more appetizing for those starving for good meaningful content. Not to be missed. Indian TV needs more like these.",
        "Generally second season is not as good compared to the first one...but Panchayat 2 is equally good as the first one!!! Last episode made me cry literally!!!! Can't wait for season 3!",
        "Yes !! I am an 80's kid, born and raised in a small town and I don't think anything on screen has jolted my memories so consistently than TVF. Don't get me wrong, these jolts have been ever so pleasant. TVF has given me some moments which were buried deep inside in my memory files and they just spring back with every other series.\n\nWith \"yeh meri family\" TVF made me remember my entire childhood .. and when I thought if anything would even come close to it .. here is one more - \"Panchayat\". TVF, with panchayat, has somehow bought out the innocence of an Indian village which just keeps on gripping you with each passing moment.\n\nI do not want to share any spoilers, so I would just end it here by saying - TVF is the quintessential middle class India .. which is what is India :)",
        "Gem jeetu bhaiya... Simple and sweet.... Just nailed it... Season 2 kab aayega",
        "It's ok, it's a kind of movie style I like, but the story doesn't impress me.",
        "Panchayat is a simple, lightweight but a refreshing series with a perfect mood boosting story. The storyline revolves around an engineering graduate Abhishek, who joins as a secretary of a Panchayat office in a rural village of Uttar Pradesh. The life of Abhishek experiences the culture and the conservative people of the Fullera village where he faces many things and explore the life out of the cities.\n\nThe casting and the way of expressing emotions are great in this series. The story is just simple but the dialogue delivery and their facial expressions are such good that you soon start to find chhoti chhoti khushiyaan in their simple lives.\n\nAlso, I would like to suggest that such type of series are not for binge watch. Just watch one episode everyday and you'll enjoy is fully.",
        "Perfect drama with wonderful performance from each and every individual and elegant music.",
        "No black comedy. Simple and clean village back drop story. Kind of connects now urban India with rural India. Reminds me on Doordarshan serials. Must watch with entire family.",
        "It's a well written 8 Episode Web series with strong performances from veterans like Raghuvir yadav , Neena Gupta and others. Jeetendra has worked hard on absorbing the character of Abhishek , however it could have been better. The cynosure of the show was the character Vikas played by newbie Chandan Roy and he has absolutely hit it out of the park in this one. The story telling is quite simplistic in it's nature & the way Deepak Mishra has captured the nuances of Village attributes is something that is absolutely phenomenal. The director himself is known for playing simple natured characters with complex nuances in the TVF Universe and as a director he has done justice to the story by implementing the same. Overall it's a well directed and performed feel good show.",
        "Very well directed and simple script. The rawness is the key in this series. Loves the performance of all the actors. Needless to mention Raghubir Yadav and Neena Gupta, Jeetu as always is very realistic. I must commend the acting of Chandan Roy who has played Vikas, he has done a great job and the accent sounds really authentic.",
        "Light hearted comedy that's simple and honest. Loved every bit of it. Let me hooked the whole time.",
        "Another level of excellence with such simplicity. Loved all the episodes and all the performances are exceptionally amazing. Starlits n bollywood directors especially ekta kapoor have lots to learn from this.",
        "Simple and the best like any other villages in India. Jeetu bhaiya bohat bhadiya. Tvf never fails to impress.",
        "It's a very simple story but that's the beauty of this series. Sometimes simplicity can do wonders which the big budgets and flashy VFX can't do. A mustttttttt watch",
        "This web Series is Awesome am Watching this with my mom we love it.. Waiting for season 2 !\n\nTvf is Really Awesom they always make a good content like permanent room mate , Make Some more web Series.",
        "Beautiful series, My all ttm favorite.I have watched it numerous times and always feel fresh. Must watch for everyone.Waiting 4 season 2",
        "What a refreshing change ! No unnecessary sexual content, no cuss words , no abuses. A simple heart touching story. Showcasing the village life and the simplicity around it. MUST WATCH",
        "TVF never disappoints. Simple and enjoyable story with powerful performances.",
        "After Swades is 2004 and Rocket Singh in 2009 (that is almost a decade) I, personally never felt that something that runs on screen will touch the soul, until I came across this series Panchayat.\n\nVery honest at its heart, extremely loveable characters and their performances, funny and deep satifying; this series made my soul happy again.\n\nThis is something worth watching.\n\nPanchayat - 10 out of 10.",
        "I have never seen like this pathetic series ever. Waste of time and I have wasted time by watching this.",
        "Well directed, well written, and excellent casting",
        "When TVF is associated with any webseries, one this sure - brilliant content. Panchayat is yet another masterpiece series created by TVF. You can watch this series on Amazon prime. Jeetu bhaiya is as usual at his best. He nails this role. Brilliantly supported by Raghuvir Yadav and Chandan Roy.",
        "It is a very simple, but relaxing comedy show...with some amazing acting and great performance...every episode brings something new and refreshing. All the actors are amazing..can't wait for second series.",
        "This series shows the goodness of village people, they are sweet and always there for one another. This is something we are missing in cities where we hardly know who stays in next flat..😊",
        "A beautiful journey to the rural India.... perfect acting with superp story line and direction. A must watch series",
        "It is definitely one of the best web series of 2020. TVF is getting better and better year by year. It is definitely a must watch series.",
        "This is a simple light hearted series. The simple village story is the key. Everyone has acted really well in this.",
        "Wow.. another simply fantastic TVF guys really knows the detail of each and everything so they just put it in this masterclass series Panchayat Its simple story with powerfull porformence of skillful actors Must watch love it..",
        "The web series is So balanced it have light Comedy which will lighten your mood",
        "Screen play is superb The series can encourage many civil services aspirants .",
        "This is the best hindi web series on Amazon Prime...",
        "Amazing show. I was browsing through Amazon Prime, looking for something to watch. Saw Jeetu's thumbnail and was intrigued because I know he's a great actor. Tried it and what a series. I love TVF's products. They are always awesome.",
        "Another best web series by #TVF and #PrimeVideos. Just wow.. Goa and watch the series now.. Jitu's acting is outstanding and as aways TVF is good at stories and screenplay. Anyone can watch this series (no age restrictions). Comedy Story and Inspiration 👌👌",
        "Great performances. Short, simple and detailed stories. Casting bay did a great job. Director didn't loose focus of story in presence of Raghubir yadav and Nina gupta. Up- Pradhan was a delight. Can't wait for season 2 and Rinky's story.",
        "Characters of this web series are simple and brings a lot of peace and smile to your face. Vivek Kumar has played a young Individual trying to balance between his present and his ambition, he is so real, he shows a character who is straight forward, honest but also practical who sometime gets frustrated while balancing his present. Raghubir is spot on, he delivers his character without any fuzz, Neena jee is adorable. The cherry on cake are Faisal and Chandan, they make the whole series picture perfect. Simple story which brings smile on your face",
        "Desperately waiting for season 2 one of thr best series I have ever watched and very clean series. Amazing heads of to the makers.",
        "What a fantastic piece of art presented in the form of nicely crafted 8 episodes of season 1!\n\nWriting, direction, screenplay, casting has been very honest. All the characters, yes I mean, everyone has a role to play - even a 'water tank', 'monitor', 'bottle guard (lauki)', 'office wheel chair', 'solar light'. I learnt that how much can be offered to the viewers in just 35 minutes episode when you have a fresh approach and honest intent. Each episode is a story in itself where you get to see new characters taking center stage.\n\nHighly recommended 10/10.",
        "Awesome. The series brings out the village life in the simplest yet stupendous way.",
        "Jitendra Kumar is an addition to the league of natural Actors like Nasruddin shah , Rao, Nawazuddin and Irfan",
        "The Series is really interesting to watch. Explains the simple and slow paced life of rural villages! The comedy punches in between will make your stomach giggle out!",
        "Very well scripted series, keeps you glued. It follows the story of an ordinary person that connects with you, not like overrated propaganda trash. Someway it also gives a message to the society. Waiting for the next Season.",
        "Very good show. Beautiful direction and location selection was just perfect. Jeetu bhaiya and other cast members acted really well.",
        "Attention to details is amazing . With veteran Raghuveer Yadav in a pivotal role , this is a brilliant series. Faisal as the deputy and Vikas as the assistant were just outstanding.\n\nBackground score is of international class ... This is NOT to be missed !!\n\nDeepak Mishra does it again !!!\n\n9 just because of the unnecessary drag around a baby naming story track.",
        "To be honest, stage actors are the real gems and this show just explained why. I would be definitely be watching actors like this then so call famous actors who doesn't even know the difference of acting and overacting because all their life they are doing overacting or buttering to get roles.",
        "This amazing and very realistic narrative takes you on a journey as you watch it. Fell in love with the music and the OSTs. This show has been successful in capturing the pulse of rural India and its people and the nuances of its beauty. Kudos to the cast for so perfectly breathing life to every character.",
        "You will feel connected to the story. Plus, the cast of the story is amazing and every episode is full of suspense.",
        "It's a master piece. Super awesome terrific performances. Outstanding.",
        "It's been while since I saw Raghubir Yadav on TV and he comes back with his trademark role. The name Panchayat made me set my expectations towards this being some Indian social issue drama, but thankfully it turned out to be a good humor. The character of Abhishek is a different genre, which despite being serious, brings about a lot of humor. Neena gupta probably is a overhyped character, but still gells well.",
        "Found better than those like Special Ops,Sacred Games..",
        "TVF has brought awesome shows time & again. Pitchers, Tripling, Permanent Roommates & Yeh Meri Family are some of the finest stories on net right now. They have a good bunch of actors & they rope in veteran actors who suit the story premise. The concept of Panchayat was again interesting, so I knew that this is going to be another awesome show.\n\nLoved the show. Jeetu Bhaiya is easily Di Caprio for Indian Webseries audience. Raghubir Yadav, Nina Gupta, Up Pradhan & Stenographer did great job.\n\nFor those who are yet to watch the show, prepare to be heart-warmed.",
        "When story line is fantastic, yet simple, acting is not the main thing to see. Here story and execution is the Heroes. All is so well and creatively demonstrated that it look like we are living in the same village. 100% Truth shown.",
        "I was pretty reluctant to watch the show but I am glad I watched it. It was shot in realistic locations and story is very simple too. Great performances by all the actors. Many other Indian shows have disappointed me very badly because they focus too much on fancy stuff but simplicity will always be the winner.\n\nEagerly waiting for season 2",
        "Breath Of Fresh Air @FarziGulzaar u are truely the SRK of Indian Web World #RaghubirYadav Gem of a actor #Panchayat 🌟🌟🌟🌟 #TVF You are the best in the business Do watch it guys #PanchayatOnPrime",
        "A story which keep you smiling all the time. Loved it.",
        "This kind of web series show that , if someone create show with honesty and deep research , why an Indian village story can not be Super-Hit ?\n\nVery good story , Great acting of every character , Dialog's are such as we talking in between us ... Everyone who love Indian village lifestyle , should must see this series ...",
        "TVF is creating one gem after another.... This is not a gem but it is a good series. Panchaayat leverages strengths from their characters Jitender (a.k.a) Jitu bhaiyas honesty, simplicity of the village. Good thing is Panchaayat does not dance to usual village problems that we have all seen. Rather kept is simple to day to day problems and simple village life. Whatever is there in the village is presented very much in the same way. Acting from all the actors are excellent. Why it doesnt score a 9 or 10? Because it is a very simple story, absolutely nothing is loud about the series, it is very flat.\n\nOverall verdict..... good watch and you would like another season.",
        "Must watch , there is not only horror, thriller and sex kind of movies or series are best except of this you mark this in list of ur favourites..",
        "Usually I watch movie, series regularly. Few series are really touch our heart. This one on that list. Just simple story but really good. Like it.",
        "This another masterpiece from TVF and Amazon prime. You wil enjoy evry bit of series. The way it written , picturised, directed and acted is fantabulous.\n\nJitu is marvellous in his acting, raghubir sir is always good. Vikas is good to see.\n\nBut here to mention each character has played their role with full justice.\n\nOver all a must watch series with full comic and equal emotional punch.",
        "Good to look at Indian Village culture in a fresh way. Worth to watch for every generation & both urban & village audiences..",
        "Awesome awesome awesome!!!!! Best written, best performances, so best shoot with great background score!!! Must watch!!!!!! Big thanks to TVF team.",
        "The show has potential and some talented actors but jeetenra is not one of them.I got really tired of the lead actor - jeetendra's constipated face! Buddy! someone should give you this feedback. You suck! Throughout this series and whatever web content i have seen in the past, you always have the same constipated angry face. All he is capable of is few exasperated sighs/angry expressions/eye rolls and angry rants! Jeetendra is highly overrated. He is no better than katrina kaif because he is mediocre at best! Please quit acting!",
        "This show bought smile on my face. I just got a random thought if only all our villages were this clean and people this friendly. I thoroughly enjoyed the series. Waiting for next season.",
        "This series is excellently written. It's all about an Indian urban guy who ends up taking a job in a panchayat in country side because he has no other option. In each episode, the writer shows you the various situations this guy finds himself in and portray such a realistic way of different characters in the story revealing themselves that it looks absolutely convincing. Hats off to the director and cast.",
        "What happens when an uptight reluctant urban graduate goes to work for a village panchayat with all its colourful idiosyncratic characters?\n\nThis 'Swades' meets 'Malgudi Days' affair set in a north Indian village provides the answers.\n\nThere is a certain way the village and its denizens work which is different from what we are used to in cities. This we find out through Abhishek's travails. The village itself looks charming and the Pradhan's house is beautiful.\n\nGreat writing and superb understated performances, especially by the two masters: Raghuvir Yadav and Neena Gupta, make this just the kind of content we have been craving for on Indian screens.",
        "After a long time Indian media has produced something relatable and realistic.... It's time Indian Tele should let go of futile efforts to portray being scientific and psychological intellectuals and focus on more realistic stories panchayat is easy to connect... It resonates perfectly with your wits. No nudity no violence. It's traet to watch after a hectic day.",
        "This is a brilliant webseries. Bought joy and laughter during quarantine time. Felt close to village life.\n\nAll of the actors have acted very well.\n\nI could easily end up watching 40-50 episodes had they made em.",
        "The story line looks really simple but there are layers of complex issues in Indian society, which have been focused on. Acting is mind-blowing. Worth binge watching. It's light hearted and fun. Hopefully Amazon, comes out with many more amazing series of similar kind.",
        "Watched all episodes in a single go, its great assmble of script and great cast. Good series on village and simple feel good story without any violence. Just loved it.",
        "Another gem from the TVF. All characters are well portrayed. Strong acting by all the characters specially Jeetu and Pradhan. Purely depicts the common village life of common people of India. This series can teach us how little things matters and can make us happy in our life. Great storyline.\n\nNice Work TVF.",
        "One of the best series I have ever seen. This series says much about rural life & more. Must watch",
        "Unwillingly Abhishek move from metro city to hinterland as gram Panchayat sachiv with 20k salary when all of his friend getting handsome salary he is facing ruler India problems. This series revolve around three main characters Raghubir Yadav as in husband of Neena Gupta actual Pradhan of village , Faisal Malik the right hand of Raghuvir Yadav. Chandan Roy secretary of Abhishek a k a Jeetu bhaiya. In the end how Jeetu bhaiya notion change towards village and if he is able to crack CAT exam or not to move out from village?",
        "Just watch all the episode and this is the first webseries i have ever watched so...",
        "Personally I like this Panchayat series. This show reality of ruler culture. Ruler people fun and loving and any situations handle. All characters act is very good.",
        "Excellent performances and wonderful story. Recommended to every age group",
        "By name I was not in mood to watch.\n\nHowever, it just clicked in mind to atleast check 1 or 2 episodes and its awesome!!\n\nEvery episode was funny and I not being lover of such content, still liked each episode.",
        "Potrays many aspects of village life and habits of the beautiful and simple people. Only lucky people have the opportunity to connect with their village and live the simple life.",
        "Amazing series, with keen attention to details on very tiny stuff makes it real and treat to watch. Simple yet beutiful, great casting, dialogues, camera work and and too great background score...!!!",
        "Simple storyline with exceptional performance by the entire cast... Most of the episode ends with a smile on our face.",
        "Simplicity in each actors emotions Narrative close to the reality Impeccable screenplay, kudos to the writer TVF has best creative team when it comes to such dramas like Pitchers, Permanent Roommates etc. Raghubir Yadav rocked the show! Good to see him after a long time",
        "Very good, and this is the best online series I've ever watched in my life; it sends a strong message to the audience.\n\nExcellent!!\n\nWhat could have been corrected is that the National Anthem could have been sung without mistake and without breaks.",
        "In Malayalam there is a movie titled 'Mutharamkunnu P.O' starring Mukesh & Nedumudi Venu. It's a story about the people of a village. The hero appointed as a postman there. I feel my filmic nostalgia while watching this series. I loved this one. Each episodes are interesting, witty and simple. The last episode is about Women politics. Waiting for the next season..",
        "Gripping story Precise editing Amazing performance Socio-political base of the drama But only thing is.. It got few and to be honest, very unnecessary cuss word.. What makes it unwatchable to a lot of prominent viewership..",
        "Panchayat ! Beautifully crafted, A truly realistic representation of village life. Simple story yet you'll get too connected to it, The characters & chemistry between them is worth praising. People who want to take a break from dark, crime, suspense, thriller, patriotism genres...this one is for you 🙌",
        "Total game changer when most of the web series are crime action suspense thrillers",
        "All the episode were funny..My fav was the wedding scenes where the bridegroom takes away the chair along with him.. Gr8 writing & well executed series. One liners were very funny and so were the characters !! This was a perfect work of situational comedy. Waiting for S2.....",
        "One of the best Hindi serial in a serene setting unlike the current othercity based in artificial environment.",
        "Realistic, simple, funny and beautiful. You won't be disappointed. :)",
        "Amazong work by tvf... Jeetu played the mlsr amazing and perfect role of young sachiv... Reality and good comedy",
        "It's top class web series which shows us a very very true nature of village and the inhabitants. Dialogues are very real.",
        "This get very boring long storyline with some funny joke if you in mood of watching comedy then this webseries is not for you, because if you have mood down to more down",
        "Raw content with relatable circumstances. Just loved it. Every character did justice to his/ her part. Especially Chandan Roy & Raghuvir sir. no need to mention that Jeetu is always flawless. Don't wait for watch it",
        "Jeetu bhaiya nailed, perfectly mixture of everything humour, comedy, emotion, great story, perfectly acted by everyone, awesome direction, soulfull music, ultimate cinematography all in all jeetu bhaiya (jitendra kumar) nailed it...",
        "You can either tell a beautiful story simply or tell a simple story beautifully, this series falls in the latter category. Stellar caste of excellent actors and staff, give life to this simple village tale of a Btech passout who cannot find a job and decides to work as the assistant for the village panchayat office.\n\nHonest stories written with nuance, beautiful execution with excellent acting.",
        "Wonderful writing and execution. Well done. It's one of the finest series I ever watched.",
        "A simple Stry of rural India. What stand outs is the detailing, acting by Rughvir and the supporting cast. there are so many movement whre u feel arey yaar exactly aisa toh hota hai. Not a single scene is forced by creating streo type characters nor there is any forced situational comedy, evrything flows in naturally. the story does touches subjects like class divide, dowry, gender inequality, population control bt in a very organic way.\n\nJust an e.g of detailing. when panchyat head takes abhishek for village tour, u will c all the land own by him have sprinkler and all other land r almst dry. bt neither the camera emphasis on this fact nor the character coz thats the nrmal ways fr them.",
        "Packed with Awesome performances, simple language with superb humour. Very engrossing and capturing.\n\nDon't miss out on this one if you like realistic, simple and clean comedy",
        "Clean, Family Drama/Comedy. From long time never seen such series or movie. I would like to watch it's second season.\n\nWe can watch it, with family and kids. Beautiful!!!",
        "One of the best web series available on Amazon prime Jeetu bhaiyya acting skills awsm All the actors had given their best Must watch web series",
        "After a long time, I saw a great series. Rural environment, soil odor. All in all awesome. The story is good, the comedy is good, and everyone's acting is also good. Great time.",
        "When the promos where on, I was expecting comic riot. But the story as it unfolded, it was more like village drama, anything but hilarious. Lethargic writing, neither close reality nor close to an interesting fiction.\n\nThe performances are decent but wasted by poor storyline. The Backdrop had better potential than any other to give best fun outing of a village, but completely missed.\n\nA lost opportunity.\n\nThere's a Tamil Movie called \"Mundasuppatti\" on Hotstar. That's perhaps shown the best fun about a village.",
        "What a beautiful story, acting.. loved every episode. Very realistic.. highly recommended.",
        "This series beautifully narrates the daily life of a small Indian village. It definitely puts a smile on one's face.",
        "Tight , relatable story with great connect. The twists and turns come without annoying drama. Am waiting for the season 2, I really want to know what happens next with.....",
        "Season 1 review - I got connected with Season 1 and watched it many times.\n\nSeason 2 review - But I lost connect in Season 2 and felt many scenes were added to an unnecessary degree. I don't even recall any good dialogues of season 2. Keep your expectation very very low for season 2.\n\nHope they come up with season 3 like season 1.",
        "Thanks to story writer,producer,director and all the actors of panchayat series.All played fantastic job in their role.This story gives me feel like im in the character of jitu.Im a fan of Jitendra Kumars acting.As im a Doctor ,I also have to do 1 yr rural bond .I feel like repetation of my story in village named Bairagad Teh Dharni Dist Amravati in Jan2018 to 2019...You all took care of each and every thing that happens to village level thats why im giving you overhype 20 star out of 10.Once again thankuu uou soo much guyss for this wonderful content...Must watch web series",
        "A series that watch whol family togather, and the filming location is osm feel like its a real story in funny way",
        "A story set up in a small village which talks about the issues faced in the rural India and a urban man's journey amidst the chaos, entriely diffrent lifestyle, rural crowd and his own wish to escape from all of it, yet find a way to live with all of it.",
        "Panchayat takes you to rural India. For those who have been part and parcel of rural India, it will make you feel nostalgic. It will drive you back to life which you spent in your village. For those who have always been in urban areas, they will come to know many fascinating things about rural India. It's a must watch and highly recommended. Love you team TVF.",
        "This a must watch for anyone who understands and likes good content, brilliant acting and excellent direction.\n\nSuch simple storyline and location converted into a masterpiece.\n\nCan't wait for the next season.",
        "When everyone is busy watching series like thriller,suspension,crime. It change your mood and reminds about our villages. Jeetu bhaiya rocks again in this show. After Permanent roommates this show also hit our hearts Thanks for this type of content Deepak mishra. And huge fan of purshotam waiting for PM season 3",
        "I love every single character of this series. To be frank I am in totally love with Pradhan ji Character. Story is so strong and gripping and never deviates anywhere.\n\nAnd the background score is class that lifts the series to a epic level. It's just a treat to watch this series. Thanks TVF for this beautiful work.",
        "Enjoyed a lot,it showed the true picture of village life and wish there were more contents like this",
        "Takes you through the beauty of a village... and portrays the lifestyle of people living there. Waiting for season 2",
        "This show is really a diamond hidden in all these garbage shows on OTT. A very clean show which is funny and can be enjoyed with family. Perfectly shows how govt works a grass root level. Character development has been done for everyone and no actor has been used as a prop. You will fall in love with the show after episode 3.\n\nDo not miss it any cost. Eagerly waiting for next season.",
        "YOU'LL FEEL LUCKY TO WATCH THIS SERIES .\n\nTHIS IS IT .",
        "Loved the show for its subtle humor, soft moments and memorable characters.",
        "Very nice acting by Jitendra kumar, and another masterpiece from TVF\n\nKeep good work guys",
        "Show is good but jeetu bhaiya seriousness is a dull point one time watch is ok, not a single moment when jeetu bhaiya make me laugh because his charchter is so nervous,confused..less comedy more drama,emotion show..and first 2 episodes are lil bit boring too..so as a fan of TVF shows..this is not upto that mark..",
        "It's a decent show but not worthy of a 9 or 10. Like everyone else i was looking forward to it because it's a TVF production but it doesn't have the charm like other TVF shows do.",
        "Masterpiece shows like this is the real reason we love TVF.",
        "Show reflects upon the slow, simple lifestyle of rural India. All characters have done very realistic acting.\n\nThe grass is always greener on the other side, the protagonists also feels the same with him yearning to work in an MNC and leave the job he has in the village.\n\nIt is his daily struggles in the village that makes up the whole series.\n\nIf you are already living this liefstyle and are from rural India it wont attract you that much but for people in urban India or for NRIs this show is gold.",
        "Panchayat captures the essence of the real Rural India. Beautiful. Simple yet different from something which has been shown as Small Town or Village in Mainstream Cinema. Jitendra Kumar aka our very own Jeetu Bhaiya is just Brilliant as Abhishek Tripathi. His Screen Presence is so Pleasing. He brings the best of this character. The way he expresses with his eyes is so Ammmazing. Loved him. Apart from him Chandan Roy who played Vikas is extremely Natural in his role. Everyone did a fantastic job. A very-well made show. Watch it for it's simplicity & the way it tells the story. Awesome✌",
        "Eagerly waiting for season 2.Everyone is damn superb.",
        "Again another refreshing drama series from TVF with a completely different story line. This one has our Jeetu bhaiya as well! Really good acting and it was nice to watch something different for a change! TVF never disappoints, btw!",
        "Story is very simple, roles are very simple, direction is very simple, nothing is complicated.. That's what Real Rural India is.. Just Loved it..",
        "A descent and simple series , does not bore you at all. Writing and direction with a backdrop of beautiful village sets the series up nicely ! No need to experiment ,plain and simple wins the hearts! Amazing actor Jeetu ,with veteran Raghubir jee and newcomer Faisal aka Vikas . Gazab Dhaaa diye TVF ke laundo ! Worth waiting for season 2. Jai Bhole !",
        "It gives you an insight into rural India. The Director has been successful in narrating what he wanted to show us. The star cast is excellent. The story line is simple and the whole crew deserves an appreciation. A family watch .",
        "This was not heavily advertised, didn't seem very enticing by the name but I like the actors in to so decided to give it a try and was hooked. It is so well written and amazing acting! Highly recommended!",
        "Panchayat is Best web series because of their simplicity of rurals area Waiting for second season.",
        "It was so natural and heart warming that i binge watched it in one go. Felt like why it ended.\n\nNo words to describe the performances by each actor.\n\nWaiting and hoping for a Season 3.",
        "Loved the work every actor made enough light to shine and a personal journey to youself and creativity at its simplest but yet best\n\nI bought Amazon prime for you rest is torent.",
        "This is a masterpiece. The storyline, direction, acting etc everything is excellent. Each and every character has done a commendable job.. raised the standards expectations of the viewers ... waiting for the next season and more from TVF.",
        "Well made and totally entertainment.go for it you won't be regret.",
        "Panchayat is one of the examples of how you can keep people engaged with good story writing and script. All the characters are up to the mark and the story is so simple yet impactful. Loved this.",
        "Claim, neat and peaceful web series to watch. Funny, kindness from Vikas. Fear, motivation from jitu Bhai. Immature from prahlad Pandey. Wiseness, helping nature from Pradhan pati. No age limit for learning from Pradhan.",
        "A good stress buster during covid 19 lockdown, great story",
        "Amazing take in the politcal scenario of Indian villages. Brilliantly written, directed as well as acted.",
        "#Panchayat - Series on Amazon Prime.\n\nThis one refreshes you to the nostalgia of Malgudi Days! The dynamics of 'Panchayats', our little Indian village republics come alive with some simple yet brilliant writing. A small season of mere 8 episodes captures you and its highly possible that you might just wind up the whole season within a day!\n\nA pure gem from #TVF. Been following these guys on YouTube right from the beginning and seen its actors grow from ordinary meme video makers to full-blown performers. Jitendra Kumar 'Munna Jazbati' is one such actor! No introduction needed to the genius of Raghubir Yadav or Neena Gupta.\n\nMust watch.",
        "Whatever has been depicted about d so called village Fakaulli is really very realistic. Good choice for light viewing.",
        "Whatever has been depicted about d so called village Fakaulli , is really very realistic.",
        "After a very Long time I have come across something like this which we enjoyed as family. A must watch with good social message as well simple day to day problems and solutions.\n\nParental guide : no adult scenes there are some abusive words but that's all.",
        "Just completed this loving series with parents. superb. never seen before such actual Indian web series which shows true rural indian life.",
        "Ohh boy what journey and lesson that will teach you how to enjoy every corner of your life",
        "Beside that it's only 8 episodes, for me it's surely a piece of art. Loved every episodes and I will definitely rewatch the whole thing after sometime.",
        "This is definitely one of the best Hindi web series I have seen.The episodes just go so smoothly with no violence, no unnecessary dialog, no cheap jokes. Perfect entertainer which you can watch with your family. I could finish the entire web series in just one day. So interesting.",
        "It's a beautiful story reflecting the rural life with Simplicity and good humor.It is a journey and events in the life of an engineering graduate, who for the lack of any better jobs takes up the position of the secretary of the village panchayat chief. The total story based on the urban boy's ability to adapt his post and the situation. There are little bit of fun,mindgames,political issues etc. The scenes and stories are wonderfully executed in this series.Apart from the comedy, the story also drives Abhishek's journey from hating the village to slowly loving and accepting the people around him. Obviously, I I expect that the show will return for a second season given it ends with multiple cliffhanger, but what TVF does best is making a show that remains re-watchable because even more than the script or screenplay, you fall in love with the characters that would stay in your heart long after the end credits roll. I think this is best web series in 2020 to lift your spirit up",
        "Tvf is providing us great contents.no one wants to watch series like four more shots plz. We wats series like PANCHAYAT",
        "No doubt this series is just excellent. All the actors have done their work beautifully and m a big fan of Jitendra Kumar, Raghuvir sir and Neena gupta. But as a viewer i get fuckin irritated and annoyed most of the times bcz of the situation faced by the character Abhishek caused by the villagers. If i was at the place of Jitendra i will surely reply them and punch them at their face if needed. But this is a series this is what they want to portray. And actually this is the beauty of this series. Anyway well done.",
        "Waiting for season 2 !!! Watched all the episodes in a day!! Excellent actor and touch base script writing. I could relate the story as I was a rural resident in India",
        "I hope we get more series like that in future where educated people make better lives of rural areas.",
        "Everyone has done their roles perfectly which Will make you fall in love with all the characters. Story is as perfect as watching the village in real time. Eagerly waiting for next season.",
        "Superb direction, relatable characters. A must watch show.",
        "Panchayat is a brilliantly written comedy drama which is rooted in the brutal realities of rural India. The script doesn't embellish the presentation in order to make it a quasi-patriotic series. Rather, it cleverly focuses on the nuances which separate rural India from its counterpart. The drama doesn't ring the nationalist bells and so is brutally honest and comically incisive. While Jitu takes the bulk of the weight on his shoulders, Raghuvir Yadav and Neena Gupta are simply class apart contributors to the presentation. A special shout-out to the stringed pensive background music and the short melodies which enhance the impact of the presentation manifold.\n\nIt wouldn't be an exaggeration to call Panchayat TVF's most important contribution to date.",
        "Loved it! Depicts true life in village. Doesn't feels like a made up story and hats off to Jeetu for such an amazing work. Looking forward for season 2.",
        "I love how they pay heed to minute details, perfectionism is this and not the mainstream bollywood. I worked in a village tehsil before I started working in IT, I dint get placed in IT companies like other friends right after the college, and I had to take a low paying govt job (on contract), everything shown in this series is so true and authentic. Accent of actors, the setup, the houses, how the wedding happens, how a city boy doesn't get his say in the meetings because villagers dominate. How small community of village is influencing each other. Look closely they even placed a mosquito killing racket near Jitu's bed, such small things tell you how hard these guys worked to create such an awesome show. I specifically loved Chandan Roy's character 'Vikas' and how he played that character, such a great talent everywhere in this show. another example - the guy who played uppradhan, no BS, real acting.",
        "Now a days indian tv series are just too much standard and maximum of them are based on social life or crime. This one is completely based on the true RURAL INDIA. This tv series has everything..: FEELING, PAIN , SACRIFICE and REALLY BRILLIANT COMEDY without any vulgarity. Character Development is top notch 👌 Jitendra Kumar is again as strong as he has always been. But I want to mention the character of all the panchayat officials including Pradhan ji and the real Pradhan!! The episode where the monitor is stolen is really memorable as in this episode the others feel Jitendra Kumar that he is not alone,also in the photo episode where they all fight for their SELF RESPECT AS a team is really appreciable. Whenever Jitendra Kumar felt alone they have always supported him..\n\nLove this series and eagerly waiting for the PANCHAYAT SEASON 2 !!",
        "It's a subtle yet slow burn drama, give it a little time to grow on you, and you'll keep hitting the 'next episode' button. Kudos to the entire cast. I'm already waiting for S2.",
        "Simple plot but absolutely enjoyable. Characters are really relatable. Strongly recommended for all.",
        "If u are a viilage guy frm UP or bihar , trust me u gona feel connection with each and evry frame of this web series.... once u start watching , vl get lost in it. feels like things are happning around u... hats off to the screeplay .. its just another level... this is show which deserv 10 out of 10 rating...",
        "Are you looking for genius in simplicity minus all the crude language, crime and bloodshed in other shows? Please watch this. You'll be infected with the life and thinking of these simple people. And Indian. oh so Indian!",
        "Being a guy who has been brought up in the city and working in rural serving the village people, i totally relate myself with this series. It's the innocence and simplicity with which the story has been written and played by the actors that makes it stand apart. I generally like the suspense thriller type series but this has totally blown me away. Waiting for season 2",
        "One of those series you will watch on one go . Its simple, beautifully played and there you go one masterpiece created.",
        "Series moves smoothly, you get to see some aspect of the villeges of india. Writing is good and so is the acting by everyone. But it could have been little better.",
        "You will definitely watch it again and again. It's so soft that you forget everything else and when you are done with it, you end up getting so many messages, morals that its unbelievable. And the best part is its for everyone. Literally everyone regardless of any background people ( my mom enjoyed it thoroughly).",
        "This series is really very good. (Because it is from TVF! Duh!) The concept is really good. It is very funny with a right touch of drama in it. Don't try to compare this with Kota Factory! They both are different. And both are, Lovely!",
        "Jeetu is definitely a Mohan Bhargav type of guy in a turmoil. A modern day character stuck in the bureaucracy of panchayat. The cutest part is the innocent acting of the cast involved and the rural India which is not shown in a lot of cinema. Amazon is definitely foraying in Indian cinema and the strongfooting can be experienced first hand with Panchayat.",
        "This series is very entertaining. The Jeetu sir, tries to escape but finds the true meaning of staying in village. Could be a lesson or message to future generation that our people need us, we should come up with ideas to develop everybody instead of running in rat race.",
        "It is a great series. All character did justice to their role. Jeetu sir is awesome in this series.One of the best webseries' produced in recent times. I just love it. The webseries is worth to see.",
        "Its a wonderful series by TVF and the series is available on Amazon prime... One of the best series in 2020, it is a treat to watch specially during corona lockdown\n\nWell the story revolves around an interesting character who recently graduates from an engineering college and joins as a gram pradhan in smallest village in UP...each and every episode has a beautiful story line yet coincides with the main story line of the fellow coming from a city and preparing for CAT to get into an IIM to live a less challenging and better life just like his other friends\n\nIts really a treat to watch such thought provoking web series which at times truly shows the reality of real India Rural India...thanks TVF almost all of your series are wonderful.",
        "I loved this series. Its so simple and still so good. All actors are amazing and so natural.",
        "One of the best series of all time. The concept is simple and the acting, plot and dialogs are really bang on. Definitely and binge watch and you would love it",
        "This show is an exemplary example of amazing script and screenplay which shows that clean and intelligent content exists and there are shows that can be a perfect family entertainer. No profanity, nudity, voilence and still with crisp script and screenplay this one is a must watch. Simplicity is the essence of this show.",
        "What a series. It's so refreshing nd nice series every episode Crafted well . Jethu bhaiyya is mind blowing.",
        "Great to watch. A smooth and good narration around rural India. Hoping for Season 2",
        "I'm desperately waiting for the season 2 of the series. This is so simple and easy to relate web series. And lastly Jeetu and all other characters were amazing in their role. Nice acting Jeetu you will soon be among top stars.",
        "I come from a village in madhyapradesh with a panchayat office and pani ki tanki near my home. The dry landscape and slow pace gives a strong summer vacation feel for some reason. Makes me feel nostalgic. The performance of the cast is extremely believable and stories are so simple and warm, it melts your heart. Tvf has never disappointed with their content.",
        "A nice portray of village and people living there..Though some foul words could have been avoided to make it proper family show.. Nevertheless amazing story and characters..Hope for season 2",
        "Story, acting everything is so beautifully directed. I watched so many times and never get bored.",
        "My go to series whenever I am free and switch on tv.",
        "All actors are fab. Nd story is too much great I love this series.",
        "Another gem from Jitu. Raghuvir Yadav and Nina Gupta support well.",
        "Simple Real feel story and we must connect with all episodes and feel time go on whit out any boring moments superb actors with natural feel just a feel of real rural India what I say just awesome.... must watch with family...",
        "The series is fantastic with great performances by actors and all the crew member . Story telling is Amazing . This is perfect series to watch with family .This series offers real comedy ,friendship ,respect ,care and love. Last episode was too emotion I was in tears for half an hours.\n\nPs -I am from Ballia Uttar Pradesh.",
        "A great comic series. The story Goes slow but with a flow and has basic humours comedy.",
        "Gajab series mja Aaa gya dekh k and most beautiful thing is all characters are too good and legends and presentation of villagers life absolutely fantastic.",
        "We have best team that brings us awesome content.\n\nThe dialogues and cast were awesome.. Lady dancer and drunk guy ke dialogue humesha yaad rahega.. Can't wait for s3.",
        "Had a lot of expectation but quite boring. The episodes are so normal there is no good script. Not good comedy at all. The others shows from tvf are quite and interesting. It seems this one is the most boring show amongst the tvf.",
        "There is no denying the fact the TVF brings the best content on Indian OTT platform....",
        "This series is an idealistic simple yet impactful one..neena ji really nailed the roll and raghubir ji is amazing in his character too..panchayat is really impactful on a simple mass.",
        "I am in love with all the Characters of this beautiful and sweet series part 1. Deepak has created a masterpiece and everyone watching this falls in love with this and with all characters be it Abhishek, Vikas, Pradhaan pati,vice pradhan or pradhan ji helself. A truely beautiful,simple and sweet series.Eagerly awaiting for part 2.",
        "This is one of the best webseriss i have ever seen. Must watch for everyone.",
        "Raghubir Yadav has overshadowed Jeetendra. Simple story with little learning but high moral.",
        "Lack of any main story. But great performance by all the actors...looks authentic. Binge watched it. Enjoyed it.",
        "TVF has always produced some really good series. Till date their Pitchers is my favorite series. This one too is very unique and pleasent",
        "They have got everything right from cast, plot, script writing and editing. Every episode has something which you can relate if you have ever been to a rural India.\n\nHave to admit this just raised bars",
        "Brilliant Jitendra bhai as always.... SuperB.......",
        "After many years somthing better has came that left me in tears ...what a work... everything was subtle and we'll expressed ....,loved it .... waiting for 3rd season.",
        "For Indians this is a must watch especially in this time. This is a great comedy series by tvf and Amazon. Just lays out the type of things which happen in rural Indian and the struggles of an Indian student.",
        "Will make you feel that life in village is not so bad afterall.",
        "Must watch series. And Jeetu Bhaiyya is love. And Rinky",
        "Yet another amazing Indian series. The characters are people you meet and interact in your daily lives.It brings back all the memories ,if you have ever visited a village. Little things such as bonding over dinner, everyone getting together for a family function, Simple gestures such as trying to get things done with a Lauki, capture the jist of Indian society and brings up a smile on your face. While there are shows that spend millions to win over the viewers and don't succeed, this one wins hearts just because of it's simplicity.",
        "This will make you laugh in fist 7 episodes but the 8th will make you cry and that is the best episode of the entire show (s1&2) and Faisal Malik (praladh pandey) rocked the last episode loved it and bought prime subscription just to watch this show and it was wort every single penny.",
        "Story writer and dialogue writer awesome. Every one is great in the master piece.After watching Panchayat, I am not able to watch any other content. I am searching for movies and web series like Panchayat",
        "This beautifully executed series can't be a better one. That 4 hours of screenplay, you will be right there with them in the village. The emerging relation between the characters is a grace to watch. Exceptional character portrayal from each of them. Hats off TVF!!",
        "Acting is the best ! Characters are really enjoyable ! Comedy is soft ! Script is okay !",
        "It's a light hearted comedy to watch with your whole family during this quarantine time. No cuss words, No Adult Scenes & No Graphic Violence. Just sit with your family especially Parents & Grandparents and enjoy the Show.",
        "Every bit of this series is loaded with pure nostalgia for them who have spent their childhood in villages and small towns. Those who have not, will get the flavor of it.",
        "All the characters in this series are daashu.. Amazing and ground reality scenario.\n\nLooking for upcoming seasons 3 and would like to see sachiv ji promoted to higher position form his current post and staying back in phulera and getting married to rinky sooner or later in the seasons.\n\nRequesting an episodes on awareness of farming, renewable source of energy, water. Harvesting, RO unit for village through your media.",
        "Panchayat A light weight comedy,a reluctant public servant who doesnt like his job but still stuck in order to earn for his survival and to save his from after family scenes.I agree it takes a lot of courage and time to really understand what you actually want but you should never allow anyone to demean and disrespect you.And in the end to find happiness you are trying to bring in some person as a part to make it romantic.Not acceptable,a typical bollywood types.They could have made it different.",
        "Good to watch an non violent jovial village series with smile",
        "Panchayat recalls the cinema of the great Hrishikesh Mukherjee. Beauti of human emotions, delivering its message with ease and impeccable performances of even side artists. Soothing screenplay of the soul of india. Must watch",
        "Pure talent ( no nepotism) and great cast with awesome screenplay.",
        "By far the best Indian web show. Highly recommended it.",
        "Good content , enjoyed watching it. Story about Indian village",
        "Peaple complaining it to be slow paced should understand that's what this show wants you to feel, just like the protagonist. Life goes slower then the hustle-bustle of the city. Life revolves around simpler things. If the backdrop is rurel, its not necessary to expect action-drama like Mirzapur etc.",
        "The season was excellent.. the storyline, characters,acting everything.\n\nYou will feel connected to all the characters I felt like Prahlad Pandey is someone whom I know from many year it was like feeling his pain laughing with him crying with him.\n\nTurely loved the season the wait was worth.",
        "All characters in the movie was superb and interesting and played well their role, the direction was also superb, but I found something missing in the story may be the essence of village was missing, it does not mean village was not seen but village does not mean only unmetalled road Or Unripe houses but it also means much more. Love story was also was missing which may be seen in next season. I did not know why the character of Abhishek was always angry. Yes but this is watchable.",
        "Thank you for finally showin Rinki🤣. The only reason after jitu bhaiya is rinki that make me more curious to watch all the episode, and in the last finally i can see her..😂",
        "As we all know that Jitendra Kumar a.k.a our Jittu Bhaiya and team always do a great initiative with all kind of series. I must say that Panchayat is in my favorite list of 2020. This series also show why people always care for each other. One of the best i've seen in Quarantine.",
        "It is a wonderful content and TVF again proved that why are they best",
        "Calling TVF Netflix of India is not wrong. Content of TVF's web series is awesome 👍. Hail TVF",
        "Intelligently written and awesomely portrayed! everyone did justice to their characters.",
        "Best show for watching in amazon prime Awesome characters great story writing Everything is perfect",
        "My parents laughed and watched so well. I am thankful such good content is still made.",
        "Tvf has proved once again that content may be simple but presenting of that content should be strong. Very nice series and at the end it will not only make you smile but more than that it makes you happy. Waiting for season 2 already...",
        "Generous show... They episodes are so brilliantly made.. that u can correlate with the show as soon as it starts... Ensemble cast at their best acting shots.. Special mention to Jeetu bhaiya aka Abhishek and yaa chandan roy aka Bikas he is so brilliant",
        "Acting - 9 (over all) Cinematography - 8 Direction - 8.5 Story - 8.5 Entertainment - 9 It will surely make an impact over mind along with a happy feeling which you get from first rain of a season its fresh its interesting equally funny. People who are into stupid bollywood movies will not find it interesting so please stay away from this because you don't deserve it. Those who like realistic direction will find it amazing and yes its ENDING is beautiful. Thank you.",
        "TVF tooks great content and present in decent way.\n\nThis web series fills that you are watch something real not friction. This is the one of the best series I've watched till now. Great concept, great acting.\n\nYou will fill reality in this series.\n\nPlot: A city guy posted in Villege Gram Panchayat in UP. Where he know the how we can find happiness in small things. Always happens not get through big wins. Sometimes small challenge and contents makes you happy.",
        "Love this series alot!! Loved the people, the environment and everything about it ❤",
        "Must watch!..every little things r captured..what people life look like of indian villagers. From start till end, it keep the grip on the story line and way it narates the situation is far amazing.",
        "Great job done by JitendraKumar and ably supported by Raghuvir Yadav and Neena Gupta. Worth the watch and definitely better than other web series kudos to Panchayats team 👍👍👏🏻👏🏻🎉🎉",
        "Something which you can watch over and over. Strong characters with powerful writing.",
        "Fell in love with the series withing half an hour of watching . In the era of different web series with nudes, violence and abusive words, 'panchayat' felt like a fresh breeze which can be enjoyed by everyone of your family. It portraits few sensible issues which are still dwelling in most of the Indian villages. Moreover, every character of the show starting from jeetu, raghuram ji, neena gupta , faisal malik and one more person 'Vikash' Portrayed by chandan roy touched my heart. ❤❤❤",
        "TVF team you guys are working brilliant, lots of love for your team very nice and inspiring movie",
        "One word just awesomeeeee !!! This is what I expect from indian cinema ..but web series are doing it :)",
        "Stunned to see the amazing acting of every actor. Even the actors in small roll also leave the impression of their skills. Synonym of superb.",
        "10/10. Must and must watch series. Waiting for season 3. Every characters and story line represented in very realistic to indian village culture. Direction and story will involve you at every step.",
        "With RY and NG, this could have been much better series to watch and enjoy. Simple storyline and rural backdrop complement their characters and their marvellous acting. The only downside in the entire series is the actor playing the role of village clerk. He lacks the enthusiasm that was required in all his scenes. And, he miserably falls flat with his constipated acting and thus disappointing the viewers.",
        "We need more series like this. Best acting by jitendra .",
        "This is one of best performance of Jeetu Bhaiya, the series shown the beauty of Rural life and it's consequences.\n\nI'd recommend everyone to watch it out.",
        "Poor storyline and screenplay. acting of the side actors is very impressive and natural. village life has been shown pretty well. jeetu bhiaya didn't impress with his role.",
        "Superb cast, amazing background music and a brilliant script. Nothing else could make this series anything better. A simple yet lovely story of a young graduate who joins as panchayat secretary in a remote village of Uttar pardesh. The series shows a young graduate struggling through his mundane life and at the same time having fun and facing consequences when expectations meets reality.\n\nThoroughly motivational and enjoyable. Hats off to entire crew and cast of TVF!\n\nSuper excited for what's next. 👍",
        "If you love the earthen smell of the villages and if you've experienced the boredom of noons, quietly lying on the roof in the evenings and so much things you observe in a rural life, then this web series would bring you back to that world again.",
        "The series transported me back to the end of 80's and early 90's Doordarshan serials like Daane Anaar Ke, Humlog, Mungerilal ke haseen sapney etc. Interestingly some of the actors like Neena Gupta played femal leads even then. Every episode's theme atleast look real and also has a sarcastic take on accepted norms. I am eagerly waiting for part 2. The show has an overall positive vibe.",
        "They could have shown more of village life . Jeetu as good as always",
        "Great acting by all the actors.. the story is sweet and watchable by all ages.",
        "I want to thank TVF for making such a beautiful show. The goods and bads of being posted with a job at rural setup are shown here with the touch of sense of reality with no over the top comedy. Things are predictable but I binged watch cause the way it was potrayed was mesmerizing. Personally I liked the Drone view Scenery.",
        "Loved it. Simple, realistic with breezy humor. You literally live in that village for the full course of the season 1. Brilliant acting and can not wait for season 2!",
        "Amazing..simple stories of real India. Away from the glamor and maze of fake characters. This is a gem and I hope people appreciate such shows to encourage production houses to churn out quality content.",
        "Now that is what they call an awesome story. It looks like a low budget tv show, yet the story is tremendously good and fascinating. Just loved their work. Keep it up guys!!",
        "This series is humorous take on a city engineering graduate who ends up getting a Government job in a village Gram Panchayat.\n\nThe actors are superb, the dialogues or rather the talking between the characters is so engaging and realistic, each episode has a crux and the episode revolves around it and ends up satisfying you and leaves a smile on your face.\n\nFull marks for direction, screenplay, cinematography, story.\n\nIn a sea of Thrillers , Crime, Suspense web series, Panchayat is a rare pearl shining brightly.",
        "Awesome series which brings the true indian feels and flavours. Nostalgic at times!! Awesome must watch. I m sure you would have come across all these characters at some moment of your life.",
        "The show is excellent. It shows you the ground reality. Superb cast. Kudos to the entire team.",
        "The show is so good that you fall in love with all characters and the village , this kind of show can get a lot of success if telecasted or streamed as daily soap, felt like 8 episodes were not enough.",
        "Tvf and jeetu Bhaiya does it again.. If u make such beautiful series who will watch movies in theatres.. Amazing performance by all actors.. Waiting for expression Pradhanji and pradhanpatiji after they know that Rinky finally meets Abhishek Bhaiya..",
        "There are so many web series releasing every weekend but one can not find a single one which have no vulgarity, violence, sex etc. Etc. But here comes another gem of a series after kota factory by TVF which got a complete thumbs up from my mom!! 😊 waiting for more .....",
        "It is an extremely well made show. I felt like I was living in a Panchayat while watching the show. The best part of the season-I was absence of any romantic angle. This kept the focus strictly on characters and mundane things in \"Panchayat\". All the actors are bang on. Special mention for Raghuveer Yadav and Neena Gupta. And what a debut for Chandan Roy (Vikas). I am fan of Jitendra Kumar now. While watching the show - it really makes you think if you really want what you think you want. In the process, you lose out on loving what you do. It will be really a task for the crew to live up to the expectation if and when season-II happens.",
        "It has all the accolades of a wonderful cinema. Acting script direction and editing all are on par with standards. What I liked the most is after ye meri family , tvf again penetrated deep into our heart. The episode where pradhan , vikash and up pradhan all comes to secretary ji and make him feel like home after that police wala incidence was just heart melting. We all have been stayed away from our family quite k few years and can relate how it feels when u r staying alone . HIGHLIGHT- Acting of chandan roy(vikas) . He has outperformed jitu bhaiya I believe. What a natural acting yaar.... Loved it.",
        "A simple, sweet, down-to-earth, realistic story of an engineering graduate. TVF has proved that it can me web-series on any topic of this country.",
        "Thanks to Covid-19 which gave me time to find such a gem of an entertainer. Good to all the characters who did an amazing performance.",
        "Loved it for its simplicity and beautiful projection of each character.. Great work TVF and definitely hoping for the next season.",
        "Jeetendra Kumar (Jeetu Bhaiyya) is back with a bang. Panchayat a 8 episode series is the perfect treat during this Covid-19 lockdown. I assure you will thoroughly enjoy this series and you will not feel bored even for a fraction of a second. I watched it in one sitting which is very rare as I have never previously finished a series in a go, but such was the charisma of this series that I was compelled to do so. HIGHLY RECOMMENDED",
        "Loved it, beautiful accurate depiction of rural (real) India in a comic way.\n\nI first time enjoyed a web series with my family.\n\nPlease, renew for season 2 !",
        "Overall, whole story is well written and well played by jeetu bhahiya, Vikash, praladh, Raguveer sir and Neena Gupta.. Once you start, you can't stop until finish. Everything is balanced..good job..",
        "It was boring. Village depiction was cringe as well as steriotypical. Not recommended at all",
        "One of the best hindi web series I have come across, each and every character was awesome , awesome story, wonderful performances, great music ,it's delightful journey ,Kudos to whole team, can't wait for Season2 👍 P.S last scene was impactful ,hope to see more of Rinky in season 2",
        "I watched it with my parents, this show is so simple, pure and sweet. Writter and director did their homework very well to show the life and people of our rural india.",
        "TVF always come with some fresh contents and here the same.This is very relatable for them those who have been in rular areas.The unity of people, emotional attachment, carring for the peoples of their community and many more.",
        "Season 1 was awesome undoubtedly. So many remarkable dialogues, memes etc. I waited for season 2 with huge enthusiasm. But honestly my expectations were not met. Season 1 was a hit. I got little disappointed after watching season 2. I didn't feel the adventure I felt in season 1. But this is true, the last episode of season 2 made me cry.",
        "This is one of the best series I have seen on prime. 1) series without slangs 2) Series without violence 3) series shows the real India and the philosophy 4) can watch with family",
        "Even the actors with short roles gave full justice to their character, series is beautifully crafted, good cinematography and has great comic timing alongside preserving the authenticity of every bits and pieces of some society related issues. Although sometimes you may feel storytelling to be slow and sometimes a bit exaggerated. But overall even these negatives can be overlooked.",
        "Thought I did not had very high expectations as TVF is not maintaining its content quality lately but this series turns out to be one of the gem. You can totally relate each and every scene if you come from a small town. Beautifully crafted !!!",
        "A light heartwarming series that brings a lot of happiness. The pace might feel slow at the beginning, but the series grows on you as you start connecting with the characters. A must watch! Wish they come up with season 2 soon!",
        "It connects you to the real middle man youth of our own era.\n\nTvf always connects you to real imaginations not some kind of movie imagination or virtual imagination.",
        "Story telling is an art and the TVF team always try to be real with that. This time too they are real and pure. The life at village in the series is as real as the people live in actual. The actors are as amazing as the story telling. This is real rural india and it is not filmy at all. Kudos to the whole team and especially the director Deepak Mishra.",
        "Superb series...given beautiful message in all the way..hope the society likes this... better to watch this when their is time",
        "A great series for every real Indian, and not to mention for unemployed engineers too.",
        "An absolute Masterstroke from TVF☺ Can be compared to the Doordarshan era kind of taking. No Bakwaas. Just the right kind .",
        "What a lucid style of representation. Simple story but full of humour and entertainment. Thank you guys for creating this beautiful series.",
        "Finally a web series after so long which have fresh content, soothing storyline, flawless acting and a true glimpse of the Rural India. The storyline is so engaging and direction is so great that you can't help it but binge watch. In these days it's very rare to find something which have a very relatable content with a beautiful message which not only mature the characters but also the audiences.",
        "Prime is doing far better than Netflix india. They are investing in good product. Great acting, great writing.",
        "This series shows the actual reality how thing happen in rural areas it has touched all aspects and very well presented I hope to see the next season",
        "Honestly it was amazing. Jitendar kumar's acting was amazing you should see it at least once",
        "It made me laugh, emotional, feel good. Except one or two places, everything about this series is just awesome. Everyone has done brilliant acting, music of this series is just perfect, it can make you cry also. Waiting for 2nd season.",
        "Tvf doesnt fail to deliver yet another brilliant series. The set up of the village feels very very real and so does the acting of all the characters.Characterisation was on point!! The storyline, the journey of the panchaayat secretary just makes you fall in love with this show. You get emotional, you laugh, you cry but At the end of each episode you get a good feeling in your heart and love the show a little more. Hats off to TVF for Panchayat!!",
        "1. Jeetu jeet gaya , this also 2. Raghuberji , Faizal and chandan roy are brilliant at their work 3. Deepak kumar mishra brings the simple life village and frustration of an ambitious individual in very subtle way. 4. Music , storyline and characters are engaging. 5. Best moment - ' do bacche meethe cheer, usse zyada bawaseer'",
        "After a long long time i saw such a simple and light hearted series and it totally keeps you involved in the story.\n\nIt all starts with a boy who fails to get a job and instead applies for the position of chief secretary in Fulera Gram Panchayat. How he struggles to adjust to the village life while preparing for his MBA exams and how he earns friends and trust forms the story. Jitendra Kumar is brilliant as usual. This man is really going places with every performance. Raghubir Yadav and Neena Gupta as the Pradhan - Pati and Pradhan gives top notch performances as expected of them. But Chandan Roy impressed me most as secretary's assistant as this is the first time i am seeing him. Will be eagerly waiting for Season 2 , especially when they gave a hint towards that with the ending.",
        "Whatever happens in vallege everything is in series apart from pradhan ji...but one word for series awesome 👍......",
        "This is the content for which you are in 2020. Stunning performance by Jitu",
        "Watched panchayat, splendid ! Really loved the serenity of the show. During this time when you mostly find shows which serves violence, darnkess and nudity this one comes out as a pearl withstanding simplicity. The modesty of the characters directly make a connection,It rightly present the utter mentality where people try to compare and rather enjoying life they just emulate others. The plot is normal but how meticulously it depicts the force of Human nature is commendable. Enjoyed all the episodes, Using a Village plot they have correctly presented the gratitude , generosity and honesty and it comes out acceptable .",
        "This one will take you straight back to your village . Brilliant action, great storyline, witty dialogues and perfect comic timing brings you everything on a plate called panchayat. Its was a feast to watch.",
        "After so many days, finally a web series with such a good yet a simple story with such a good acting .this series truly depicted the real flavour of Indian village life.loved acting of each and every actor.hats off the director and story writer for this amazing story which is really humours.one last thing ,a perfect ending for season 1 with last scene of water tank.",
        "After so long an Indian web series which is so realistic yet entertaining. Congratulations to the team for their honest effort. The characters make you feel that they resemble someone you already know. We need more of these kind of realistic web series which showcases the realities of day to day life. Eagerly waiting for Season 2.",
        "Jeetu rocks! Acting seems to be his forte and he does it with ease. Neena jee is awesomely amazing along with Raghubir Yadav!",
        "Good for those who have never seen a village so closely. The series has picked up good issues and has tried to highlight the same in a light comedy. Everyone seems to justify their roles. Nice to watch.",
        "Finished watching Panchayat 2 today..this is another master piece. It felt like I was living in Phulera and I know everyone from Phulera village. Waiting for season 3,4 ,5....",
        "What an amazing series to watch. It's beautiful to see the way the makers have put together social issues with comedy. Nothing is over the top. One would fall in love with all the characters for whatever part they have. Fabulous acting. The balance of the show in portraying realistically the plight of someone shifted from urban to rural, to his MBA prep, to the differences in his perspectives to that of the villagers is superb. Eagerly waiting for Season 2. Good luck to the team to keep up the standard. TVF rocks!",
        "This show start with promising note, and few episode are really good, however it's go downhill with story going nowhere. And sorry This time Jitendra has given same angry expression in every episode. Disappointed with last episode where they dramatized lady pradhan role.",
        "Awesome web series, Nyc story line, in this web series you see lovely village scene and awesome village Lifestyle,",
        "Panchayat is one of a kind series I have watched in a while. Perfect blend of comedy and reality.. There are only 5 people as main cast and yet they have so beautifully acted together making it a nicely woven day to day story. It perfectly puts the harsh realities and struggle of a townbie when he lives in a village and yet it has shown how soft hearted and kind the villagers are..",
        "Every Carecter was so real nd act comandabe neat clean fresh story of real IIndia jeetu was so gud 👍 tvf always hv a great content so must watch nd apericiate a good team work",
        "It really has great actors in it and really tells us about the life of a Gram Panchayat Secretary.",
        "In the beginning, the story seems to be slow and you might loose interest but it's a great series of a common man with light comedy. A clean story which is really required in a time where most of the web series show vulgarity to attract audience.",
        "Very nice content with important message Loved Raghubir yadav acting, neena gupta role. Acting 10/10 Content 10/10 Keep making such nice series. Love",
        "Neena Gupta ji acting was great in this series and Jitu bhaiya you are just awesome , waiting for second season",
        "Jeetu bhaiya nailed his charachter.casting is the best.loved the concept and waiting for season 2.",
        "I never felt while this series that this is a show. It gives a pure rural touch, which we see and expey in our daily basis life. That's what becomes possible because of acting. 👍👍",
        "Awesome production, superb direction, excellent acting👌🏼👌🏼👌🏼.... very light and deep entertainment and lovely setting 🌺... I felt positive and uplifted after watching this series.",
        "Brilliant cast and performance. Very entertaining...",
        "Agar ap kuch light but zabardast direction,fabulous acting and excellent story chahte ho then it is best time consumer 😘😘",
        "Splendid work from every single person behind this masterpiece. First of all the writer, then director, then all the cast, then the music composers, and who else not! I am doing injustice by giving it only 10 star out of 10. There should be millions of it. Last of all thanks to TVF for believing in such talents that will turn such simple story into gold by midas's touch. Salute every single person behind this masterpiece.\n\nHoping for new season soon.",
        "What a series from TVF.It shows how life in village are .What a direction and each and every chracter in series played a role which we normally see in a village and gram panchayat and that's make this series best.Every episode show the culture of village,how they help each other.Again TVF show's us that they are best in web series making.Fantastic series.",
        "Its a complete pleasure to watch . Thanks TVF for making it. All the actors were amazing, their best performances so far\n\nEagerly waiting for season 2.\n\nRequest - Please don't make second season a love story.",
        "Thousands of Educated youth in India dream of working with their Dream Company. They have plans for their future. But at the same time social economical and peraonal condition sometime force one to join job what come as ' Sarkari Nukari'.\n\nSTORY OF thousands of such youths.",
        "The acting of Jeetu, Vikas And Pradhan Pati makes you feel like you are also a part of the village. Such an immersing experience, felt like I went back to my childhood village. Superb story with an amazing puch of comedy. Loved it.",
        "TVF always comes up with amazing content and also realistic. And Combo of Jitu Bhaiya and TVF is superhit.",
        "Heart warming, simple tale of an urbanite finding his groove in a small village. Every episode brings the characters closer to you, and soon you will be in love with each of the protagonists in this story line. I finished all episodes in just three sittings, and this is one series which was enjoyed by every member of my family. I was sad when the final episode ended, because I simply want more of the same. Don't miss.",
        "For me its the best web series. Cast, script, music, cinematography all perfect.",
        "The show is really worth to watch after long time on Amazon prime. Acting and cast fits very well with the script.",
        "Come on..... You can't go away from this page without scoring 10/10 here.\n\nCan you imagine how awesome the reality can pe resented in the best of its forms.",
        "Another not to miss series from TVF. No exaggerations",
        "One of the best series i have watch in lockdown... must watch for new generation ... as u get knowledge abt how ppl live in village area.",
        "Shoot the next season please Cant Wait for its magic to continue.\n\nShoot the next season please Cant Wait for its magic to continue.\n\nShoot the next season please Cant Wait for its magic to continue.",
        "This series is a prime example of how focussing on the basics is sufficient to captivate the audience. You get drawn in to the story right from the opening beautiful aerial shots of open landscape. The series excels at representing the innocence and simplicity of village life, as the main story unfolds. Each episode is calm, easy watch and you feel connected to the plot and the characters. A must watch. This is a hidden gem.",
        "A Good Series by TVF about Indian Village, People and Culture",
        "Your will never regret watching it. Second season eagerly awaited.",
        "Just finished Season 1 and enjoyed every episode thoroughly. TVF were the first real content creators on YouTube in India. And they still are the best content creators. Very few series these days that actually make you feel good. Panchayat is definitely one of them.",
        "Just love the story i still didnt find the answer why did he didnt give the 10 rs to person who was asking for oil to feed his sons it hurts me till now.",
        "Great Acting , Wonderful Direction . Episodes were shorter but better.\n\nNon Masala stuff.\n\nClassy Comedy compared to cheap comedy served by many Series. Half of India still relates to villages so it will be nice if we see season again from non metro locations. Villages stories add newness to series.\n\nSee you soon.",
        "When comes to the Indian TV shows I think Amazon is ahead of Netflix. This is another example of a great desi show that's authentically Indian not influenced by the western tv. A must watch.",
        "One can finish entire season and start a repeat in no time. The characters are so adorable and real to life, the dialogues, costumes, sets are simply marvelous.",
        "Intro music and picturization Matching screen play, art,fashion, characters, dialogue and acting. Waiting for season 2.",
        "Not sure what exactly describe such shows. It feels like so real and i'm not watching but actually living into this. The life in rural area is so much peaceful. Story is so simplest, heart-warming and relatable.\n\nFinished binge watching second time today.\n\nJeetu Baiya has become one of favorite character for me, and I'm grateful to TVF for creating such masterpieces during disappointing bolly era.",
        "A must watch show by tvf... I really congratulate tvf and I proud to say that tvf is a indian version of netflix with awesome content. Jeetu bhaiyaa rocks and who can forget Mr Raghuvir yadav one of the finest actor in indian cinema whatever he do it's become gold..",
        "I watched the whole season with a smile on my face. The season feels so warm and familiar, it will wrap you up. I repeated watch all the snippets time and over again , because I am in love with the characters and the making of the film. Way to go to the makers. Cheers.",
        "Very beautifully crafted show. My whole family like it very much. We can't wait for second season... Good work. Well appreciated.",
        "Too much drama feels like gangs of wasepur the touch and feel of season 1 is lost in between and last episode is just a failed attempt and too much to expect from a show like panchayat.",
        "I just watched the season 2 & its the best show till now what story what acting its a masterpiece no one will be able to match the level this show has reached i started the show laughing but i ended up crying i felt every emotion everyone was so natural & specially the climax its so heartbreaking season 2 is even better than season 1.",
        "This is probably one of the best shows ever on Indian screen! Every episode makes you smile straight from the heart and I don't know when was the last time I did that. The feel good factor reminds me of malgudi days. Nuanced characters, wonderful performances, honest writing and earnest approach. When was the last time we described an Indian show/movie like this! Wah !!👌",
        "No good and a boring show completely, not did one episode was good, makers have 0 knowledge of screenplay",
        "Brilliantly made and awesome acting from all. A must watch for everyone. It shows how simplicity can be beautiful and heart touching.",
        "There is literally nothing in the story. Complete rubbish.",
        "If you want to find out the true colors of India with a subtle humour and phenomenon acting skills in the character's of village fhuleria then you should go for it and of course do not forgot the JEETU bhaiya 😎",
        "Amazing content , great execution.. would love to see further season of This series.",
        "One of the best show in 2020, the characters in this plot are awesomly delivered there respective role. They have shown us how politics goes in remote village. Awsome story and screen play.",
        "It's a TVF Creation. So expectations were high but they did beyond my expectations. It's awesome.It brings me to the world of Munshi Premchand. It's like a modern day Premchand tail. So simple yet so beautiful. If you belongs to a village then you are gonna feel nostalgic. It's a very beautifully crafted show & all the actors are amazing & the ending was so awesome and I'm eagerly waiting for Season 2 now.",
        "This series shows the village life in such a wonderful and beautiful way, the simplicity of the characters, and the aura of the whole village is what makes you connect with the Show. A must watch light-hearted series.",
        "Panchayat is an example of how a great script, amalgamated with fine acting, produces a fantastic show. Kudos to the team of Panchayat. Cinematographic brilliance, directorial finesse, great dialogues. The cast did a complete justice to their roles. A peek inside the true rural India with glances of social messages.",
        "During this crazy times be kind to yourself and go watch PANCHAYAT on Amazon Prime. Its the only show I have ever felt like binging.\n\nIts about our frivolously ambitious youth, our crazy democracy and our beautiful villages. It is the show that celebrates raw Indian spirit.\n\nIt is a show that will live with you for a longtime and make you wonder why we left such a beautiful life for a capitalistic virus infested life!\n\nSo go watch it with your family and thank me later 😁.",
        "I liked the cast. Nice script, natural acting and touches real life themes.",
        "It's not everyday you come across creations like these. Everything about this series is so simple yet so mesmerizing. Great work by the actors. Each of them have perfectly played their characters. Definitely worth a watch",
        "Wholesome goodness! We are from Baliya and the small details, lingo, behaviour and culture was so on point! The beautiful story and the casting were brilliant. Jeetu Bhaiya is a gem.",
        "Beautifully written and well acted comedy drama.\n\nAll the actors are fabulous and each episode leaves a smile on face. Big shout out to Jeetu and new guy Vikas (Prahlad) did awesome jobs.\n\nAnother gem from TVF after Pitchers.\n\nWaiting for the next season.",
        "Watch it , admire it, enjoy it, coz I loved it. Acting 10 Screenplay 10 Direction 10 what else man.",
        "Great story,great acting,and great teachings\n\nbahot sahi acting by all the characters mainly by jitendra kumar,chandan roy and raghuveer yadav portraying all the basic nature of a villager this also shows the struggle that take place if someone goes from a city to a village but on the other hand shows how villagers live their life to the fullest this also shows the struggle of studying while doing job...those who want to persue their studies with their job..they must see panchayat\n\nchandan roy was the best character who came in front with this season...how well he shows the innocence of a villager ...",
        "This is another flawless delivery from the house of TVF. Brilliant acting from each and every cast... specially pradhan and vikas came as a cherry on the top. Jitendra Kumar as usual with his classy performance. It's worthy of 10/10",
        "A wonderful webseries which beautifully explains the life of rural people in India. Plus the end has a beautiful message which may even give hope to many people. A perfect blend of comedy & emotion. Do watch !!!!",
        "I was literally hooked and mesmerized by this series after watching the initial few minutes. Each episode, each frame is like a breath of fresh air. Each character has been cast to perfection. And beautifully shot in such a way that you will fall in love with the village and the characters. I have deservedly given this series a 10 rating and hoping for an even better season 2.",
        "Panchayat season 2 is must.. my love for my panchayat is high",
        "I was able to relate a lot of things as I also belong from a small village like phulera. Jitendra did awesome job as always. Loved watching it. Awesome work again by TVF. Waiting for season 2 #GoodStuff",
        "Loved the show , sachiv ji😜 Wonderful location Purely genuine and real story can be relate",
        "It shows full reality of villages and village concerns. All actors nailed it. Kudos to Story writer.",
        "What a great great series. Without using any obscene language or nudity they have created a masterpiece. Loved the show entirely. Cast is fabulous... Having stalwarts at their finest every single character has done justice with their roles. There is absolutely nothing to criticize about the show. It's a MUST watch for sure.",
        "So simple yet so extravagant. when i started seeing this i felt a slow togetherness in the series. as im preparing for cat this was really an inspiration",
        "Simple but Wonderful rural lifestyle. Panchayat shows you the reality of rural India. Must watch",
        "This web series really describe the rural india and its problems how rigid mentality people have",
        "First of all Jeetu bhaiya done Osm Work and I am glad to see him again. Story is very motivating and Each Episode gives very strong Lesson specially related to students life After watching this wonderful web series I would like to recommend you all #It_is_Must_watch_web_series 😇",
        "Only one thing to say TVF's content so everyone can relate at least engineering students of our country.",
        "Wow what an amazing storyline, casting, location, ... I loved every single detail about Panchayat.\n\nJitu Ji you a star keep shining. Kudos to whole team.",
        "Enjoyed it beautifully crafted Sachiv ji, Pradhan Pati, Up Pradhan...phulera",
        "TVF has been making one after one great series\n\nBollywood is behind them.",
        "Romance is missing from Web series but Its one of the beautiful web series Ever made. Just loved it. Brilliant acting by all the characters and especially writing and direvtion is just brilliant. This wen series will make you feel happy. Must watch",
        "It's a wonderful series. Highlights the simplicity of human nature that we've lost on as a race. And it shows that entertainment can be without any frills and fanfare. Absolute classic. Superb performance by the entire cast. Looking forward to season 2 eagerly!!",
        "Good story, acting and direction. Did not come across any scene that can be skipped.",
        "This series contains Quality writing and amazing performances.",
        "Amazing web series.... You will get an essence of indian village things and specially gonna like the characters and their adaption of village people. The story keeps you to sit down and watch until it gets over and also quiet relatable to your life.beautiful shooting location and we'll directed with the performance of brilliant actors.",
        "Start with my emotion on this web series (series dekh k Gaon ki yaad aa gai aisa laga k in galiyon me main ghuma hun) . It was just amazing one of the best web series on the basis of realistic topic. I will be a bit biased for Jitender(Abhishek Tripathi). He is awesome in this series as well and he is a great actor. Raghubir(Pradhan pati) he is always doing his best the way he talking just like he live that charactor amazing and the New guy Faisal (Vikas) did a phenomenal job as well the language he used is just match with rular areas language( bahut badka hero na bano bhos** k). And the most important msg given on women empowerment. Neena Gupta(pradhan) again doing a phenomenal performence specialy on last epidode of series. Chandan Roy(Vikas) this man aslo doing a great job.The episodes are beautifully executed n brilliantly intertwined. STORY is very unique and well tell by director and location this series is just awesome.",
        "Why 9 ? I believe the is always room for improvement though here there is none, mainly i don't have any. This connects to major portion of indian people like me. When web series in india trying to copy hollywood style and modifying the content, this is fresh breath of air. Watch this if you want to know a portion of india with it's genuinity.",
        "Today i just watched the webseries it was so awesome that i can't avoid my eyes nd i watched all episodes continuously... So fun nd a hidden Inspiration reveling the story in awesome way that \"daring is required to do something special all qualities is inside u. U have to do is just put ur efforts inside that passion\". Nd last bt not the least no one can ignore the strong acting of \"jeetu bhaiya\" my all time favourite person his acting is just flawless.. Keep working like this jeetu bhaiya .. All the best..! Waiting for season 2..!",
        "Don't waste your time.......after watching Money Heist i think i should watch this bcoz i heard that this is awesome series etc etc.....but i was wrong......this is completely waste of time....don't waste your mobile data",
        "Worth watching.. Never lose hope that's what we learn from it, keep working hard!! Great work done by all the actors..",
        "Characters played for Abhishek,the secretary, Pradhan' s husband, and official pradhan were awesome .Perfectly depicted. Jeetu , as usual ,brilliant actor.Looking forward to binge watch more series. Well, this made me watch another piece of Jeetu' s work - Cheesecake",
        "Small incidences that play major roles in village people life. every character has satisfactory role. beautifully shown",
        "I binge watched it and loved it! Its so raw and beautifully written along with humour. Full of emotions and real connections along with brilliant acting.",
        "Best acting by Raghuvir Yadav and Jeetendra Kumar. Unique",
        "Why producers & directors always think that Indian people always like crime, love and suspense stories. But time time TVF's Panchayat has proved this wrong. Very simple but nicely written story which takes you to real India with lots of laugh & tickle. Characters are awesome and actors have played the role like a real. A must watch series. Requesting TVF to release the second season as soon as possible.",
        "Need more series like this .... literally made my Quarantine enjoyful and removed my boredom ...Keep it up TVF.!👍",
        "As usual its a realistic drama by TVF. Generally movies and shows showcases fight against corruption in a very heroism manner but this show presents the change in a very real manner. Fresh and a Feel Good Story.",
        "Best acting by every character. Each character justified 100% their respective roles",
        "\"Panchayat\" has come at a time when almost the whole world is battling with an invisible enemy and that too by locking ourselves in our respective homes. While this long lockdown period has caused anxiety and stress issues to many people, this show brings with it the perfect vibes to make people feel light at heart. Each episode has been produced covering some or the other minute details of the rural India. Every actor has given a memorable performance. Jeetendra has done a role quite different from his other roles till date and he has excelled it. Neena Gupta and Raghuvir Yadav have been splendid like always but the real surprise is Chandan Roy. His performance will make you meet a person that you see when you visit such area.",
        "I admire how patiently crafted this show is. The story and characters grow at the perfect pace. The show never tries to force the audience into liking any character from the get-go, not even the lead. Every emotion is raw, relatable and true to the character.\n\nIt's a must-watch and I hope it doesn't meet the fate of TVF's Pitchers, but returns for many more seasons.",
        "Everyone is gonna love this show. Better than bollywood movie because they wouldn't come with this kind of acting and story.",
        "Brilliant story from TVF,its quite different from other web series, the real Indian Culture is presented here,you can watch the web series with your family you will definitely gonna enjoy it.The Acting of the casters Jeetu Bhaaia, Pradhan, And the most important Thana Prabhari Gopal Singh(Gangs of Wassepur) is outstanding.",
        "Awesome story-line with realistic acting and solid screenplay!",
        "In this lock down I am more obsessed with each and every character of this series, what a story telling WOW, frame by frame not to be missed",
        "I completely enjoyed the season. It reminded me the memories of my childhood. Few Things really took me in those days in my village. The person played the role of Vikas really has natural skills. Raghuvir and Neena Gupta g have again proved themselves as a fabulous actors. Jeetu bhai , control your emotions bro. Sometimes you over reacted 😜. My rating 8 out of 10",
        "A good web series having considered the small issues that are normally faced by the urban population while stepping into non urban roles in villages! Beautifully portrayed, picturization was spot on, cast was brilliant! In all a good watch.",
        "God knows after how long I was able to watch a series with my PARENTS and could connect with each and every episode. Also, they DID NOT SLEEP EVEN AFTER 1:30 AM for watching the complete show, which they never do. And we were discussing the show next morning. It indeed is a gem. Waiting for season 2.",
        "Great to see fresh ideas being incorporated ... :) great work amazon India 👍🏻",
        "Panchayat is a web series by TVF, casting Jitendra aka Jeetu Bhaiya. The story line starts with a person who ends up with a low salaried job in a rural location of India. Where he struggles a lot and this is a real life description of Rural Management people with more field work. The web series bring a perfect drama and a composition of struggle, comedy and humanity. Must Watch for youngsters!",
        "Really liked the series. Perfect acting by all the characters of the show. Feels like you want to live the village life after seeing the show. Waiting for season 2.. Kudos to all..grt work by TVF after Kota factory.",
        "The series was very fun to watch, i watched all 8 episodes in 1 days . Watched the series only for apne jeetu bhaiya but i would say that all the characters in this series are brilliant .",
        "Loved this series! Genuine story told in simple, realistic manner with honest portrayal by each character. TVF proves time & again that quality of content is what matters the most! And here again, they've chosen such a wonderful cast for each character, perfect fit. Congratulations to team TVF on coming up with this beautiful story, waiting for the next season :)",
        "Panchayat is a true portrayal of an Indian village culture and panchayat political system of women reserved seats. Excellent performances by Jitendra kumar, Raghuvir Yadav, Neena Gupta and not to forget Chandan Roy. Perfect Direction. All actors were deeply engrossed into the characters. The series is shot at real location which makes high impact.",
        "This is a simple honest story about our villages . Casting is really good.",
        "What happens when a young graduate gets the first Job in a village. He is shy man of few words does not know how to work with the village elder, a friend, boss or father figure. Every episode is a story by itself. Worth watch. Recommended by a friend from Philly, shout out to Chand. No violence, no sex, a simple comedy.",
        "I saw 8 episodes in a go. The Panchayat series is created on terrific writing on rural drama. This series shows us the sense of life in a rural wrapper in a very entertaining manner. The story throws light on the struggle of the millennium in the context of rural politics and human management. Jitendra Kumar has won the heart of his fan again. Raghuveer Yadav and Nina Gupta as supporting actors excel as on-screen duets. You should see this web series at least once. Panchayat web series is one such mix which is a recreational box for you. But it takes your time definitely.",
        "Actors performance and story is good. Little slow but will keep you engaged with the story. Loved the narration. TVF never disappoint.",
        "Too good TVF team. Eagerly waiting for Season 2. Jeetu bhaiya I m your new fan. Actors r top class but d real hero is d tight script.",
        "Good series, light hearted UP village style. You can complete it in one day.",
        "Story is fantastic and has all the necessary humour. But I am truly disappointed by the acting from Jitendra Kumar who plays the role of Panchayat secretary. He has same expression and body language in almost all situations. Remaining people have played there part well. I am surprised by such great rating by IMDB.",
        "Panchayat is a true portrayal of village life administration played wonderfully by the leading cast..The simplicity each scene brings to the frame was outstanding..Humour, laughter, funny dialogues- all made up the full series..The entire story is very realistic and touches the heart honestly..",
        "Its an entertaining serial with a bit of humour and yes a bit of rural india and its charm. Its a great watch and looking forward for the next season",
        "Awesome web series, shows rural side of our country. Best web series i have ever seen.",
        "!!NO SPOILERS!!\n\nUnlike most shows nowadays, this show doesn't try too much to get your attention, no sudden twists, no melodrama, just a simple story of everyday life, struggles & joys in simple things that life offers us each & everyday but we are always looking for something more. Acting is as natural as it gets, my top picks are Raghubir Yadav as Pradhan Pati Ji & Chandan Roy as Vikas. Jitendra Kumar & all the cast were great too. But I feel it was the music from Anurag Saikia that made the ride so pleasant & gave us joyful vibes. Well done to the whole team & thank you TVF for bringing simple 'daal chawal' in the times of 'Masterchef'.",
        "Tvf always with a new genre and idea to entertain and learn.",
        "I was amazed by the performance of all members of Panchayat team. I have watched this show three times and every time I enjoyed the performance of every team member. Eagerly waiting for Panchayat Season 2. Happy watching 🙂",
        "Very well written and presented. TVF always have different view angle of Indian audience. At this time other production are busy in producing series based on crime, sex, action and suspense but here comes TVF which takes you to rural India and show you the challenges faced by people there.",
        "A light comedy, village life, great acting, nice plot, no (sex, nudity & vulgarity) that means it can be seen with family.",
        "Amazing series. SIMPLE, ELEGANT, TRUTHFUL, THE ACTUAL PICTURE OF INDIAN VILLAGE. AMAZINGLY WRITTEN, DIRECTED AND ACTED.\n\nLOVED IT!!",
        "While watching I felt like it should keep going and never ends. Wish they had more episodes. Waiting for 2nd season.",
        "\"Panchayat\" is an outstanding series to show, full of comedy and drama. A must watch show.",
        "Keeps you hooked from first shot with its depiction of challenges faced by protagonist in adjusting to otherwise a simple village life. Awesome background score and cinematography. Can easily binge watch whole series in single go.",
        "Actually I loved this web series..and every character in this they made their best and most funniest thing is they didn't shown rinky till 7th episode... Over all it deserves 10 out of 10 rating",
        "A complete one in all respects. I could not think of such a series can be created connecting few simple incidences of life but with quite a few messages. The stages were so realistic that I could travel to the places siting in front of may laptop! Everyone acted so nicely, and just amalgamated with the characters. This showed a very interesting movie can be created with a simple subject and without any sex, violence, abusive languages and so on. A very pleasant experience. Great job! Thank you.",
        "Good humour... Depict the village style and life style in true sense.",
        "Halka Fulka Comedy. I watched it twice and can watch again.",
        "Excellent performance by each and every cast ...... waiting for season 2",
        "Panchayat shown us the simplicity of ruler India.\n\nAmbition of a average Gus who finds out something better then current situation.",
        "Just loved it and I'm telling just go to amazon prime and watch it,Thank God I got it's trailer recommend by Youtube.\n\nGo go and watch it.",
        "Too good web series .. fully purvanchal UP based ....amazing performance of all local actors , what i enjoyed most, is dialogues and expressions of all.. my favorite episode is \"chakke vali kursi\" and \"hamara neta kaisa ho\".. I like Vikas (chandan) character and dulha character very much.. after watching it i miss my village in UP",
        "Well done again. It felt like our own lives only. Brilliant",
        "It made me laugh during the most fearful time of our lives. Thank You",
        "When I came across this show and it's starcast after watching it's trailer, I was expecting a bit more, but all and all its really disappointing. it just doesn't worth your time. The protagonist lacks in everything, the other actors like, Raghubir Yadav, Neena Gupta, Chandan Roy, Faisal Malik all these outshine the Jitendra Kumar when it comes to acting, who looks monotonous in most his scenes. This show fails to make us laugh or doesn't even inspire any way, I mean I really feel it lacks the punch needed. I'd really not recommend this show, just think twice before bing watching this show.",
        "Pseudo nationalism sellout nothing else can be said for Season 2, with its subtle Privatisation support isn gullak s02 to now selling out nationalism via mytrs.",
        "I don't know when will these web series makers going to understand what is problem with them. for them Brahmins are the only one who lives in Indian society.",
        "Witnessed a fresh storyline supported by solid acting after a very long time. Superb casting and screenplay keeps audience hooked. Worth the wait.\n\nWitnessed a fresh storyline supported by solid acting after a very long time. Superb casting and screenplay keeps audience hooked. Worth the wait.",
        "Awesome webseries hope for season 2 and Pradhan ji 👍👍👍👍👍",
        "Amazing tvf my family and me too enjoyed a lot ...",
        "The acting and we seen the real india in this webseries .",
        "Love it totally. The way they showed the fulfillment of life.",
        "I am left out with words while explaining my emotions towards this series.\n\nMasterpiece in real sense.",
        "Excellent and senseful comedy. The characters and screenplay was awesome. Completed whole series in one day.",
        "I just loved it, season 1 was best and season 2 is super best, i just loved it. Didn't expect that emotional ending. Waiting for season 3 eagerly, please bring season 3 as soon as possible.",
        "In that web we saw real india with real emotion ...",
        "Love the music, cinematography and the amazing actors! Absolutely fantastic performances by Jeetu, Vikas, Neena, Raghubir Yadav, and Prahlad (with a very infectious smile)! Can't get over thinking about the scenes n episodes! Feeling good!",
        "A decent series with a good message.\n\nThe direction gives the exact village feel.\n\nThe caracters are all so pleasing and has good behaviour. It promotes a good message.\n\nIn a single word it's a very good web series that I have seen till date and motivates youg people to not loose their hope and keep trying till the success is reached.",
        "Just brilliant screenplay , must watch for everyone. We need more shows like this.",
        "It's a story of stability, aspiration, small vs big dreams wrapped in a perfect roll of drama, satire, comedy, emotions. USP of this series: plot of every episode is a smallest thing one can ever imagine other than the character who is living that thought. Every actor/character, including 2 seconds short, was amazing, however, to me: Awesome plot and astonishing editing.",
        "Heart warming, simple tale of an urbanite finding his groove in a small village. Every episode brings the characters closer to you, and soon you will be in love with each of the protagonists in this story line. I finished all episodes in just three sittings, and this is one series which was enjoyed by every member of my family. I was sad when the final episode ended, because I simply want more of the same. Don't miss.",
        "Panchayat is the story of a common student who has his own aims and ambition and his desires. How he handles difficult problems posed by a rura life and how he handles the journey. A must watch is lockdown times",
        "TVF has outdone itself with this show, from casting to the story line, and character development to the script.\n\nA refreshing change from the other shows out there, Panchayat will ensure that you will definitely finish Season 1 wanting more episodes. Each episode is to be treasured for its simple, yet entertaining premise and you'll fall in love with the characters and the village as the season progresses.\n\nAn incredible concept, and what I can definitely say, is one of the best shows I've watched in a very long time. I look forward to Season 2. Thank you TVF for bringing this brilliant series to life.",
        "Very good web series but if u omit g**nd word it would be a Family web series make web series for family also please",
        "Again TVF have proved , they are real content creator, superb story with punch of comedy. Acting of Jeetu bhaiya and Raghubir ji is extra layer of creame",
        "Simple village story and best part is that there is no drama in characters but only in situations and environment they are, just watch it with family and live the indian village elegance",
        "Very good series with unique and relatable or realistic concept. Best ever cast and acting. you wont find even small amount of negativity. Must watch if you are frustated with watching negative stuff all day on news during quarantine. this will enlighten you definitely, key is do not expect too much, just relax and watch.",
        "I didn't believed I would ever say this about a TVF series but here I am. The series was utter dissappotment as it failed to show any chacher growth. They missed a great opportunity to show real India but they were more focused on not dissappoint there current audience or so. The guy was a real dissappotment as he stood there and did nothing while all these corrupt things were happening. He didn't give a whether the poor get what they deserve from the start of the series to the end of it.",
        "The only disappointment was the series was too short. We wanted it not to end. After a long time, I found something that took me back to my childhood. Pure nostalgia it was. Raghuvir Yadav and Neena Gupta as a couple was too sweet. Waiting for the season 2.",
        "One of the best series i have ever seen another gem",
        "Superb acting of all characters and practicality of life depicts with the simplicity of village life.",
        "First of all. All the cast is excellent in acting or in there character. The screen play is also good. The direction is also good. Storytelling is very good. The stars i i have cutted due to this season is ended now on i have to wait for another season. All the things are absolutely fantastic. And the main lead hero the \" jeetu bhaiyya\" as marvelous. In any character.",
        "Amazing backdrop and stories set and directed with light comedy ! The main cast has done a brilliant job - characters you will simply fall in love.",
        "Being a early fan if TVF, this series touches heart of Rural India. Very relatable characters, day to day struggle of common man are present in this series. Watch this..",
        "Saw this in one sitting aline; now I'm watching again with my wife.\n\nLaid back, relax, no tension, etc.",
        "Everything about this show is so real. And Jeetu is always so natural. Inf act the whole casting is done brilliantly. And hats off to the guy who played Jeetu's assitant role.",
        "I would rather put it as Simply Brilliant. Subtle story which is very predictive in the first place, but the way of life of villagers in India is something to adore. The acting by Jitendra Kumar, Faisal (the newbie) are fabulous. And Raghuvir Yadav / Neena Gupta have done justice to their roles, it was expected from them. They are phenomenal. The story revolves round the life of Abhishek Tripathi, who is an aspiring MBA, but lands up as a secretary of a village panchayat in Fulera, Uttar Pradesh. He tries hard to come out of this experience and studies hard and overcome all types of hilarious obstacles to crack the ominous CAT. But soon he realises where he belongs. The plot is really simple but the storyline and acting is what makes this show so adorable. Very highly recommended. A family package. Do watch with your entire family. Everyone will love it.",
        "In one word rustic and authentic! Being hailed from a small village, I know this Pradhan-Pati culture is everywhere. Government has given two third seats reservation to women in local body elections but these men most of the times they are the husbands who exercise true power, the woman being just the rubber stamp. Telling performances, I loved Prahlad's character, so hilarious and relatable to many of my fellow villagers. As Pradhan-Pati, great Raghubir Yadav is top notch as always and I enjoyed thoroughly watching him act on the screen. Jeetu bhaiya again excelled what he does the best being genuine and loyal to his character, it's a treat watching him. Neena Gupta as real Pradhan is so refreshing to watch and portray our flawed women empowerment. Vikas is extremely genuine and authentic as assistant which takes the brunt of his boss and takes charge of the situation when needed. The end sequences were hard hitting and will be a idol for our governance. The last scene has made me anxious already for the next season, Mishra ji! when is second season coming?",
        "Well series began with ultimate indian village, screenplay seems slow but keeps you thinking what lead character would do next for day to day solutions. Director has shown each characteristics like local politics, lack of education in funny way, women empowerment and specially struggle of Engineering graduate working on lower scale. Biswpati sarkar has good cameo. Overall must watch and S2 expected....",
        "Eagerly waiting for second season ....TVF as usual you always gives us what is real in life. Loved all the characters BRILLIANT",
        "It's a nice fresh air types amidst Gangsters n killers etc...well crafted and nice for a change",
        "The best part of the series is it's simplicity and the way it connects to you each, episode has its own story and you want to see more and more",
        "Another fantastic series TVF. The honest reality of rural India, real issues, real-life characters, it contains everything real. Waiting for season 2.",
        "Wonderful series created by TVF. Its simple, charming and real life.",
        "I believe this is one the best web series ever made in Indian web series history. Content, direction, acting and background all are matched with story line and give you goosebumps. Each episode have their own flavour and you really gonna enjoy this masterpiece.",
        "It's sketch of true rural india.. Appreciate Tvf for ur effort... Desperately waiting for 2nd season..😎🙏",
        "This is the one of the best web series, I have ever seen. This is the best story about UP village Fullera Sachiv and pradhan family. U will never feel bore to watch this series. Must watch series.",
        "I sat to watch this show with no expectations and finished the entire series in one shot with no breaks in between with my expectations soaring high on each episode! Such brilliant writing and casting! I can't wait for the next season and will renew prime just to stay tuned to this show!. Im in love with this show and the cast. Keep it going TVF 😁😁",
        "All the characters have done justice to their roles. Excellent series.",
        "Excellent content and acting , must watch 💥💥😀 TVF Zindabaad💥💥",
        "Literally in this time period of lockdown, negativity, coronavirus and all, this webseries is giving us so much to feel happy from inside by watching the so simple yet beautiful journey of villagers. So impactful performance by each and every cast. Jitendra kumar and raghubir yadav just nailed it. Outstanding work.\n\nDamn excited to watch the second part.",
        "Very good performance all starcast are perfact natural act. When u watch u got hangover of this show for days",
        "The story, characters, actors, location, everything is well researched and portrayed. A must watch for youngsters and all age groups for that matter.",
        "Such a beautifully written series.. Amazing story.. Amazing acting by each and every character. A Must Watch..!!! Music is soo damn good.. You'll feel like you are living in the moment.. 10 out of 10 stars.. Desperately waiting for the next season..",
        "Best show. Its content created out of nothing. And these characters were so Awesome",
        "The acting of all the star cast are really awesome, fabulous,...etc ..story was like very very real as village story.",
        "Simple stories full of life and emotions. Clean language is really great to see. Hope more series do so. Great family watch.",
        "Indian web series created by TVF and represented by Jeetu Bhaiya, life of an urban boy looking for a job but he got placed as a village's leader secretary. Series is full of comedy and showing the life of rural India. Hats off to all!",
        "Great series, shows actual struggles of the Sachiv Ji as someone leaving home and living far for employment. Rural India is depicted beautifully.",
        "At this point, is it even surprising that a tvf original is a piece of art? Panchayat is everything a person would expect from TVF, pure quality content!",
        "Panchayat is a show where every individual viewer will feel that it revolves around them and has the true ability to connect with almost every viewers of the show also it is the show which a whole family can sit & watch.",
        "It was kind of sweet portrayal of a city boy having a government job in the rural settings.",
        "This web series make you fall in love with village",
        "A must must must watch. tvf has outdone itself yet again.",
        "When season 2 will release . I desperately waiting for that... Season 1 is fabulous",
        "No words to express how good it has been made and even the smallest details have been taken in mind while making this show. Jitedra is at his best. Acting, story, screenplay, and direction is on another level. Loved it.",
        "TVF did again the best, like the village life in detailed form, good content,sense of humour was really good, enjoyed the quarantine life watching these episodes, awesome....",
        "If you haven't watched this show yet, i would request you to watch it ASAP without fail. 10/10 acting, direction, dialogue, casting, background score and what not. Anyone who has ever been to village will be in love with this show in fraction of seconds.",
        "Excellent web series. The concept of the series is very clear \"Rural India is real India\".",
        "Awesome show.. Binged watched it. Really liked the acting of Jeetu, Pradhan Pati and Vikas. Was waiting for the love story to start.",
        "A great series well knitted plot ,it shows that good shows can be made without creating unnecessary controversy .",
        "Feels like the reviews have been paid for! Very very slow and boring!",
        "Initially i started watching this series to know why people had rated it so high. As i went on episodes after episodes, i felt in love with it, i can relate it somehow to my real life, in fact i guess most of us can relate this series to their personal life. Title track is lovely n i fell in love with it, i am hearing it in continuous mode. Acting is superb from everybody, all 5 main characters are 10/10. This series is so simple, no action, no masala, yet i could keep on watching it and then when it ended i felt this series should never have finished. Urging director & TVF team to bring next season ASAP and keep it as simple as it was in 1st season and close to our heart.",
        "One of the best show I have seen in recent times. Real depiction of how Panchayat system and things work in Indian Villages. Such Innocent people....Such caring for each other....Can only be found in villages....Very Well directed show and every actor...I must say this again Each Single actor was good... However, I really didn't find Jeetendra Kumar's acting up to the mark....or probably the actors around him were acting so well that he could not match their level. But the overall show was too good. Makes u feel really light and you would fall in love with Villages desperately wanting to visit it again and again",
        "Extremely Well written and directed, One can not stop watching, simple yet engaging throughout the end.",
        "Season 2 more awesome than season one. Hat's off to tvf team. Everytime tvf bring so simple story that is so relatable to every middle class family who lived in villages. So beautiful direction. Just keep it up this beautiful work. Please don't make us wait so long so another season 3. Thanks tvf team.",
        "Jitu bhaiya on 🔥,,,, simply super,just felt that I am living that moment",
        "TVF never fails to entertain the indian audience with thier authentic and next door guy performances. Everything is exceptional about the series unless it wont be fair if u fail to deliver the next season and end this season like the rest of other tvf hit series. Pleqse finish the works please",
        "What a great program....more than 10.stars perfect combination of reality and humorous. seen at strech 8 episode waiting for.more",
        "This is very inspiring story of lower middle class boy who struggles for higher study while doing job in a village as panchayat secretary.100% contentful series",
        "I expected much from this but...it didn't was. No doubt that it is one of the good web series but not one of the best. Still ! Good job TVF.",
        "Wonderfully depicts the life of a city man who seems to have failed in his career and left with no choice but to go work in a village with a menial wage. This show is slap to all those high budget web series with overacting.",
        "No abuse, no pornography all stories about incredible india.",
        "Good drama and realistic approach towards real village panchayat All characters do great role as per their requirements.",
        "Really well written and special because this is one of the series you can watch with your family. Some swear words in Ep. 7, but nothing an Indian teenager has not heard. Initial few episodes are a bit slow, but it catches grip soon. Acting is top class which brings out the feel of the odd setup even more! Waiting for season 2!",
        "First of all well done tvf in creating another masterpiece. I think the rough idea is taken from the movie Swades giving it a much realistic approach this time and as we know Jeetu is often compared to SRK which fulfills the charisma of the main protagonist in this series. A light hearted theme which takes you to the journey of a common man his struggles in life and ending up in a rural village envisaging for a better life.",
        "Just watching #Panchayat #PanchayatOnPrime a very good story writting and direction focusing on rural india concept request to make more episodes of this series and congrats you and your team for making awaiting for more.",
        "Brilliant web series from TVF. Great performance by Jitendra. A must watch web series for all. Loved the direction of Deepak Mishra.",
        "This is what needed from Indian web series industry.\n\nJust pure and awesome content.\n\nOne can feel the character's emotions only when the actor is playing his/her role well, and in this series I every character is played well and looks completely real and natural.\n\nWhat a brilliant casting!!\n\nAlso to all those reading reviews , i would request them to watch it on official OTT platforms only (Amazon prime), as , it would be very appreciating for the whole CAST and CREW, if we give as maximum AUTHENTIC views as possible to this masterpiece.",
        "I don't know why whenever I see this puny lifeless guy Jitendra onscreen ( which I rarely do ) I am reminded of the awesome Rajkumar Rao ... and how it would've been zillion times better if he was cast in this lifeless and expressionless guy Jitendra. Same problem In this series , The premise is so good , the supporting cast is terrific ... BUT ... why the hell did they cast this non actor Jitendra !!!!",
        "Its naturally amazing. Very minute details of village life. Its simply awsome.",
        "Panchayat is one the best feel good Indian web series ever made in India. What makes it stand out is the simplicity of the narration, detailing in the script, reality of the scenes, punch lines dropping at random occasions and the strong hard hitting individual performances. Incredible casting, music and art direction will leave you with an impact at the end of every episode.\n\nThis series has the best Intro ever (you will not feel like skipping the intro)\n\nThose narrow village lanes and short tales will take you deep into your memory lane (if you even lived a village life)\n\nNote: Writing this with my experiences of directing many documentaries in rural areas.",
        "TVF never disappoints. Perfect storyline,great direction. Casting is superb. Jeetu bhaiya was superb in the role. Other actors did their job pretty well.",
        "Couldn't asked for any better series. It was a amazing combination of fun and inspiration. Apart from all it's concept of loving one's own job is just amazing.",
        "Beautifully written with amazing star cast. This time if we keep jeetu aside...I must say Raghuveer Yadav (Pradhan jii) has done a great job. \"Old is gold\"... #Eagerly waiting for season 2.",
        "Just as expected from TVF, must watch for Jeetu bhaiya's brilliant acting",
        "Light comedy story well executed, the direction reminds me of Hrishikesh Mukherjee...awaiting for series 2...",
        "Acting of Jeetu bhai is again on fire as always !! and acting of other cast is also brilliant.",
        "Female characters role should be added as spices and not as a main ingredient in any cinema The director implemented this principle perfectly in Season 1 and so it results in a hit. Now after knowing that it's already a hit and people are hooked they started introducing more and more female roles in season 2 trying to make spices as main ingredient and this spoilt the recipe to an extent. Just as one provides the pure stuff as demo and once people are hooked they induce the duplicate maal :D.",
        "Strong acting and very good story.\n\nAnother milestone from jeetu bhaiya",
        "If u wanted to enjoy village life like swadesh movie with good content, this is the web series for you.",
        "Something different to watch... A very light headed series...great acting...",
        "Right from the beginning when I watched the trailer I was curiously waiting to watch this web series. Last night I watched all the episodes in a row.\n\nAgain TVF has set a mark and produced very humorous and lovable content. You gonna love the acting of Jitendra Kumar as always and Raghubir Yadav(Under rated bollywood actor). In many ways the story touches the lives of youth these days.\n\nSummary- Amazing! Fabulous! Super entertaining! Humor level-100 !!!",
        "Loved it, especially the end. A realistic show. Shooting location is also awesome.",
        "Watched all 8 episodes in a go ..No masala..Brilliant story and performance by all the cast!👍🏻",
        "Very good natural acting, well depicted village scenario with humor quotient.",
        "Best thing I have seen so far. The real taste of rural India.",
        "Excellent performance by Jeetu...Very realistic story of Real India with an added falvour of Purvanchal area.. Must watch for everyone...",
        "Amazing Amazing!! From Quandary to lessons from tales to humour and specially the Churning of Indian System. What a brilliant portrayal of a befuddled youth, who somehow became a part of the system which he never wanted for himself.",
        "Another masterstroke by TVF and Amazon Prime India. Hats off Deepak Kumar Mishra for the amazing direction and kudos to the entire team of Panchayat. Yet another excellent work by Raghuvir, Jeetendra, Neena Gupta and the entire cast.",
        "It's outstanding. Just amazing. Every cast of this web series worked brilliantly .The director have portrayed every single character and plot brilliantly.",
        "This is just too good prime and tvf two of my favourite web series producers do not disappoint with this amazingly real and nuanced webseries. Jitendra Kumar once again slays this performance: tiger schroff, varun dhavan and the rest of you untalented star kids go learn something from this guy he is the future of indian cinema",
        "Demonstration of true village life-style without any unnecessary exaggeration. It felt so real that every moment it kept reminding me of my native village I used to visit in Vacations when I was a child. And I have to mention, EPISODE 3 (THE WEDDING BAARAT ONE) IS PURE GOLD....",
        "Must watch series... All characters do their work perfectly.",
        "TVF team has brought the wholesome entertainment with simplicity and ease. Best show streaming right now !",
        "TVF creations have always been my favourite & the latest series is just an icing on the cake . It is a great show touching on the intricate matters in our society and how well we all are managing it . I was however a little upset when they used the national anthem being practised . I hold an opinion that national anthem is a nation's pride and should never be touched or used for any matter . Otherwise a great show & a must watch . Waiting for S2 .",
        "Tvf maintains its legacy of making world class content .",
        "This web series teaches us Love what you do and love more TVF",
        "This series is here to stay ..will definitely touch everyone!",
        "Panchayat captures the essence of struggles of an engineer graduating from a tier-2 college has to deal with harsh realities of life and has to settle for a job in a small village named Phulera. 8 episodes of this web series captures the struggles of a city joy Jeetu adjusting in Phulera and also reminisces the beauty of summer vacations in your native town. Perfect Casting, dialogues and direction make this a gem of show to watch.\n\nDefinitely recommend this show :)",
        "Omg !!! What a superb series... Must go for it.. full of logical comedy... Down to earth series... Shows the real life of indian gram panchayat..",
        "What a beautiful portrayal of Indian village. Simple and loving story of day to day life of Indian village and Panchayat.Memorable performances by raghuveer jee and Neena Gupta. And what a wonderful performance by the Panchayat secretary and the boys.. A must binge watch this lockdown...",
        "Mostly web series are around any suspense or murder or there may be something big is going on. But this series is not like that. It will take you to a simple village, you will see their day to day life, their issues. You will enjoy Abhishek Tripathi's journey, how he changed. This very original and very indian. You can relate to each moment. Everyone's acting is superb. In these type of series side characters are very impressive and they did their job very well. I'll recommend it to everyone.",
        "An extraordinary script, a unique way to see the rual India thier culture, traditional thinking and social significance. Very well act performing by whole cast specially @Jitu bhaiya",
        "This is another masterpiece from TVF. In a barrage of action/horror/thriller web-series Panchayat comes as a surprising option that transports you to a rural world as real as you can get. With top notch acting, extremley simple yet effective screenplay and beautiful direction makes the web-series believable as life. Jitender Kumar is breeze, Raghubir Yadav is a class act and Neena Gupta yet again proves what we, cine goes have missed for her being out of the silver screen for long. In the steller cast Chandan Roy as Vikas and Failsal Malik as Prahlad as treat to watch. Panchayat shows how we take smaller things in life for granted while there is a big part of India that still struggle for them.",
        "Finished the series in A single go. Brilliant Acting by Jitu. Equally supported by Newcomers Chandan m Faisal and veterns Raghubir and Neena Gupta. A must watch.",
        "As most of Indian household my parents were also far away from the concept of web series. However, it changed after this masterpiece. My parents who spent much of their life in Bihar rural area loved the authenticity and all the characters. As for me, a guy who is up for MBA admission this year loved the struggle for preparation of CAT (now my parents know how tough it is to get 90+ percentile) . All in all everyone should watch it once",
        "A must watch and get mesmerized by the rural life..the series has more heart to it...trust you would never get bored by watching any of the characters....good job team TVF...looking forward to the season 2👍👌",
        "2019 Kota Factory 2020 Panchayat Must watch It's like a Kota factory Comedy, emotional, full enjoyment.",
        "Very lovely series....enjoy every moment of series....and jeetu is as alway too perfact...👍👍👍👍👍",
        "Anyone desiring an honest rating shouldn't go by the average rating you see for this series. This series by no means deserves an average rating of 9. A below average screenplay, average direction and ordinary acting can best be rated around 5.",
        "The guys at TVF definitely captured the essence of rural India with Panchayat. With an amazing story and some brilliant performances, Panchayat is a definite watch for someone looking for some real and light-hearted comedy. The people of Phulwari and Jeetu with their very well written characters, stories, and performances provide a peek into life in a small Indian village. Each dialogue and expression was thoughtfully written and acted and evokes an honest laughter. The series is an instant hit and will leave you wanting for more.",
        "It pretty much describes the struggle of modern Indian middle class juggling between life. Village life depicted is so accurate. You are bound to find a connection with the story at some point of time. Kudos to TVF.",
        "Pure class. The real taste of rural India. All the characters are look like real one. Have to mention vikas aka chandan roy, he is the new find. Jettu bhiya is the jem. Giving 10 out of 10",
        "Panchayat is one of the best web series I have watched. A neat and clean web series which keeps you captivated with the strong storyline and equally strong acting. Jeetu Bhaiya as usual was at his natural best. I loved the role of Vikas. The way the character is developed is amazing. It captures the real essence of the village and I could feel it watching from overseas. Few scenes of Manju devi in kitchen, the usage of commonly used names, respect to our rashtra gaan is amazing. Everyone gets their accent right. Must watch and timing is perfect. Waiting for season 2 !!!",
        "I just loved to watch the series. Everyone has done splendid job in their role",
        "A well scripted story which was directed by one of the best deepak sir and excellent acting by jitu bhaiya.. thanku for giving us this gem. U guys deserves much much better results.",
        "Jeetu bhaiya was auwsome. And this story will show the real challenges we face😍",
        "A clear steal of Rural India Setup from Bollywood.",
        "Completed the season 1 on first day of release it was amazing web series I have ever watched",
        "Better than I expect. Initially I thought ita boaring but further it's really interesting. The cast was better than bollywood actress now a days.",
        "It's the best series which one can watch in this coronavirus crisis. It connects well with the viewers and overall the direction done is really well. P.S my first honest review in IMDB. 🙂",
        "One of the best web series or movie based on Village Life ever after nadiya k paar whoever spend his childhood in villages of up and bihar will certainly connect theiself with the series",
        "Amazing story n amazing performance by all the characters!! I loved each and every episode of it.. I would say must watch lightweight comedy series with friends and family!! If you belong to any small town.. you ll love the way they have portrayed every single event and characters.",
        "A very simple, clean and humorous series. Guaranteed to bring a smile on the viewers face. The cast are chosen to perfection have all performed well. In times when intricate plots, devious characters, adult humor and sex seem to drive the popularity of a series, panchayat is a breath of fresh air. A good watch for the family !!! Waiting for Season 2",
        "Panchayat has the essence of village shown in a beautiful manner.. Actors are all Brilliant superb work by TVF you guys have nailed it again.",
        "Honestly I can't wait for season 2.. superb webseries and I totally loved it.. perfect storyline..perfect acting and really appreciated work done all praises to every actor..it definitely leaves a mark on your heart and mind must watch for everyone.",
        "Amazing writing and very beautifully executed script. Jitu is the best in the business.",
        "TVF is back with a bang. Solid story, prolific cast, crafty direction and so very rustic. I binge watched all episodes in 1 day and now I am sad.\n\nEasily 1 of the master piece by TVF.\n\nTVF please don't take too long to come up with 2nd Season.",
        "If you have experienced Hindi heartland you will easily connect with this series. The storyline is realistic and very nicely blends youth aspirations with the people's narrow interest, social issues, local politics and so on. The challenges of the village spring up opportunities for the protagonist to inadvertently do something good.\n\nAnd all of this achieved in a very light manner, thanks to beautiful direction. Crisp editing andsweet music add to the charm.\n\nAnd nothing to comment on acting of actors. Presence of the likes of Raghubir Yadav, Neena Gupta just increase the expectations from the rest, and they very well do the justice. Jinendra Kumar is awesome.",
        "Simple, vibrant, colorful, real - a beautiful, unjeopardized folklore of rural India. You will experience each and every moment, you will feel connected with the simple village dwellers. The story flows so naturally that you will wish that it never ends. It's rejuvenating, the casting was brilliant, a must watch.",
        "Recommending this, because I am sure that it would make you smile as you watch it in one go. The execution is light, smooth, impactful and intriguing; picking up one theme and reveal new dimension of a village with each episode. While it's the story of Abhishek Tripathi, each of the other characters are developed beautifully. It's fun to travel to a village, and it's not something you should miss out on prime.",
        "This shows depicts the original lifestyle of rural India. A middle class guy aspires to make it big after a govt. job. The storyline is beautiful & the actors are phenomenal.",
        "For my Indian friends and family , if you are wondering what to watch online.. let me suggest a wonderful series \"Panchayat\". After a long time got to watch such an impressive series , no intense drama, no far from reality sets and makeup , no extreme actions . PLAIN and SIMPLE -REALISTIC , FABULOUS acting and SUPERB direction and yes as the name suggests .. story of roots of India",
        "What else you can ask in this time of Lock down...this is pure magic. This is true art of cinema...This is INCREDIBLE. My heartiest congratulations to each and every actor present in all the episodes. Eagerly waiting for season 2 :)",
        "Shows every expect of rural india. Negative as well as postive.",
        "The whole series is extremely slow and boring. There is no growth in the central character. He is not doing anything for the village upbringing. At beginning it seems as if he has real potential and will do something for the village. But he disappoints. He doesn't even care anything about the locals or to do anything for them. Please dont waste your time. Even if you have too much free time during lockdown find something better to do.",
        "That's Called A Perfect Webseries Can Relate To Our Rural India Perfect Comedy,Perfect Acting Just Brilliant Webseries. Waiting For Season 2😘",
        "Unlike Kota Factory and Pitchers we see a plain story full of native vibes and how a single man deal with all of it. In classic bollywood we would see a lot heroic figure who are either bureaucrats or held important post in public services, this no doubt, break all those stereotypes and comes up with a character that is not ideal, and may be thats the best part of it. Sachiv ji is at high point in his life yet the very day he is also at low point. He is both hopeful and hopless as well. He is just like us. Also the suspense regarding the daughter of Pramukh ji is well held and somewhat Create a sort of eagerness into the mind of the viewers, well especially me. I am giving it a five star. Kudos team TVf",
        "I LIKED IT.As it shows village culture and I enjoyed it",
        "It was good and entertaining . Please I waiting for second season....",
        "A series that focus on rural India and their thought process. One can watch with family only few desi 'galiya'. No kissing scenes so with befikar watch with family.",
        "Best web series of 2020.each and every characters played well by all actor's.",
        "Yet simple but atttactive Tvf and jeetu did it again..tvf doing something oit of their comfort zone, nailed it..no words to praise for jeetu..other characters too stood high..mainly vikas..expecting more like this from tvf",
        "All story is moving infront of me...story is mind-blowing..I really expected from the Indian cinema but web series doing this.. waiting for season 2...love this series most",
        "Best web series from TVF, eagerly waiting for next season of panchayat.",
        "Class acting by all actors, no vulgarity, no nude scenes, no sex, no glamor, the story, place, screenplay all are best. Can watch with family friends and enjoy. Love d acting of assistant to sachiv.",
        "If you were from small town or village, then this is going take back your good old memories. Excellent casting and acting. Cant wait for season 2!!!",
        "If you want to see real India with authentic comic story . You are at right place.",
        "Gone deeper n deeper in plot, story, acting. Every one acted brilliantly, seems like a true story to me. It's like a suspense in each episode, what you think will happen but in an unexpected manner.",
        "Real Acting, great characters and original language.",
        "TVF has done a marvellous job in bringing the sweet and raw depiction of rural india, its people and their simple thinking. It also showcases the modernization of the villages and the rural politics in its administration in a very comic way.\n\nCast and direction will remind you of the days when doordarshan(indian state media) used to run daily soaps and all the cast was from film and drama academies. And the cast and crew has left no stone unturned in their work.\n\nThe debutant crew especially Chandan, Faisal and Jitendra are upto to the mark when compared with other veteran casts in the series like Neena Gupta and Raghubir yadav.\n\nIf you have been to an Indian village, u're gonna surely enjoy this one.",
        "This show reminds me of the movie Swades in so many ways and doesn't fail to be at par. Three cheers for Jitender Kumar, you rock man! Also a perfect example of good acting, narrative and purpose. Loved it!",
        "Brilliant , this series is like fresh breeze across stereotypes serials . It's proof that we need simple stuff in life to be happy and entertain . We all can relate to the characters & would have certainly meet these kind of humble and innocent ppl across in our lives",
        "It is a very good dramatic movie which shown mainly in rural areas and it's story is attached to field. It's also shows the culture of our rural India.",
        "They say there is power in simplicity and this is echoed in each and every episode of Panchayat. Each character has its significant impact on the audience. The raw village portrayed in the series is mesmerising. These kind of shows should be encouraged rather than dark and vulgar shows by OTT platforms. Awaiting 2nd season eagerly.",
        "An amazing series. Hilarious and funny to the core.",
        "When I read the reviews I had doubt that the reviews are paid. Don't expect this from Amazon. Cheating audience. Another bad thing about high rated paid reviews is that genuine reviewers also tend to rate higher than they think the show is.\n\nThe show is really basic and has nothing that can make it highly rated. Period.",
        "Best webseries from TVF like always, village depicition is best exactly what happens there. You'll feel connected with the story with your village. They have ended well so you'll die to see season 2. I wish they have made more episodes.",
        "Maja aa gya I just finished this.what a brilliant story ,cast",
        "Great series, one of the best have seen till now. Supporting cast pradhanji, up pradhan, vivek rocks.",
        "If you are from that northern part of india ... it will take you on a nostalgic ride of a tyoical village scene with everyday hillarious moments of a colorful indian village life !! Thanks for creating this guys !! Jeetu bhai was awesome",
        "One of the best series, great work by Jittu Bhaiya, Chandan and full TVF team.Loved the role of Vikas done by Chandan and There is no word for jittu bhaiya, he is always awesome.",
        "The series really has on the mark Cast who have performed very well and gave justice to the characters of the story - storyline is simple yet effective in terms of the illiteracy and little social matters in the remote regions which actually have a deep impact on the whole system - Music is perfectly matched, it simply connects you with the rhythm of the life of Abhishek Tripathi(Jeetu Sir) in the village(Phulera).",
        "Amazing acting and the cast is just perfect - the whole experience of watching this series absorbs you into the Indian rural country side. There are no big names and I wouldn't focus on any one actor like the main protagonist even because every single actor makes the whole village come alive with vibrant characters each with their unique personas. Jitendra Kumar maintains a steady stream of frustrated expressions and almost makes you want speak to him asking him to cheer up! The whole time - a stroke of brilliance is the introduction of Rinky whom you don't get to know till... no spoilers - must watch this wonderful example of story telling.",
        "Every single character of the series is on point, they are so natural with their character, that you just can't stop watching. The exchange of bottle gourd (lauki) The banner on bricks, Every smallest thing is just amazing. Costume Designers, Camera angles, Dialogue, Body movement, Way of Talking, Everything is just wow. If you still have not watch the series, Then do watch it now. It's worth watching..",
        "This series can make you laugh and emotional. Teaches you some important life lessons. These types of series are rare so, do watch. You will enjoy every moment.",
        "Simple and sweet, the frustrated character played by jeetu bhaiya is awesome",
        "Just a feel good tv series, lacks a proper story. This is problem with all the TVF series, they lack story. Each episode will be good on their own but when you combine you can't relate much.",
        "I really liked this series. I usually watch english tv shows but sometimes i also watch indian shows and this show is really worth watch",
        "Have watched many series in past, but this one... fell in love with it... Awesome location, awesome people, awesome story and above all, inspiring... Jitendra, Neena, Raghubir Ji and in fact every one was so great to watch... so touching... I was thinking... what a 'simple life' .... wow!!",
        "Thanks you prime for this wonderful series. Family and drama. All fun together. The deep story of a village and there people, you have put those story together. And star Jitendra, wonderful acting man. Keep it up. Even all the star of this series, you have done a wonderful job. Hats off to you all.",
        "Outstanding presentation of panchayet Raj of has been highlighted through a number of episodes. It shows real power is exercised by titular head. It's quite enough to get whole picture of panchayet if one watches this series. Here we see how qualified tries to find its root to earn livelihood.. Watch it.",
        "First web series I have ever seen without any vulgarity and foul language... I wish there will be more web series like this... I really enjoyed watching it...",
        "The fact that the creators and writers wrote such a show that seems to change up the common narratives we often see in Hindi Amazon TV shows is commendable. We see the pizzazz and glamour of urban life portrayed in Made In Heaven and Four More Shots Please (also commendable in their own right) flipped and there comes a new narrative and storyline. Jitendra Kumar portrays his character with a silent impatience and frustration, slowly evolving to come to terms with his circumstances due to past mistakes. Compelling and simplistic, Panchayat is a must watch.",
        "I love this series the way they represent the village is so real when I watch this series I used to remind myself when I lived in village and I so excited to visit my village.",
        "Panchayat was on of the best Web Series I have ever seen specially last one episode 8 Season 2 . This series give respect to my village Ballia and one of the hero's of India that is Indian Army.",
        "Just marvellous... Not even a single actor whom we couldn't connect.. Abhishek & rinky's unconditional love , that bond between Pradhanji , sacheev ji , prahlad and vikas.. Panchayat is getting better and better.",
        "A must watch , what a beautiful direction .\n\nJitendra Kumar won 💖. Each and every episode will make you more queries.\n\nA master Piece from TVF that everyone should watch, 10 star seems less for this .",
        "I saw full series in 2 days. Extremely liked fully. Very humorous, neat and simple. I was curious to see the reviews given by people rates very low. Very sarcastic comments and and silly one. Some talking about what the lead role has done for the village etc. Hello, it is not a educational movie and to show case all these. It is an fully packed entertainment.\n\nI like very much",
        "Amazing performances by all the actors, my only complaint is there were only 8 episodes. Hope the second season comes soon and is a bit longer than the first one",
        "I can relate to the culture and tradition of village, I have seen in my village too somewhat similar, all actors r versatile and fit in the characters shoes, Abhishek Tripathi is awesome, hope the makers gonna make another season too and also marketing & promotions of the web series is required till I watched today I wasn't aware of the show.",
        "I was hesitating to watch it due to exams but after watching it after my mains it is just awesome experience.... Combination of bestest actors.... beautiful script and beautiful directed movie...just one word simply lovely",
        "The web series PANCHAYAT is a spell bound story revolves around the earthen grip of those people living in village, differently enveloped with hurdles, simplicity, attitude levels, warmth of relationships. A complete cameo by the director Deepak Kumar Mishra, what a cast especially Raghubir Yadav, Neena Gupta, Faisal Malik, Jitendra Kumar. Vote of thanks to Chandan Roy for a brilliant performance, especially for his vernacular. He lived his character Chandan raising the bar. I am still to touch the least, watching this web series for last 6 times. More than a must watch, its a just watch. Thank you team Panchayat !!!",
        "Could be a amazing series to watch with family. Just some offensive words restricted it from reaching lots of hearts. Sad why everyone have to use these offensive words.",
        "Another masterpiece from TVF, smooth, subtle but hard hitting. Must watch !",
        "Superb web series good actors and well written script makes it an one stretch watch",
        "I watched 'Panchayat' during the time when the world was locked and the stagnant lives of people were no hope of an active future.\n\nReminiscing about that experience, today I am amazed to recognise the intrinsically weaved tale of an everyday man who meets the other side of his country and eventually comes closer to the harsh reality of life seasoned with the sweetness of hardships that comes with it.\n\nThe plot of 'Panchayat' is rooted to reality and the way it presents the vulnerability of a common man is simply awesome.\n\nThe dry humour, the UP dialect, the deliveries of simple-minded village idiosyncratic people prove to be a breath of fresh air which immediately puts a smile on your face.🙂",
        "Simple and nice,great acting ,great comedy,family friendly and totally fresh plot",
        "1 masterpiece 2 brilliant acting 3 vikash ki acting brilliant hai 4 maja aa jata hai 5 exclusive for villagers",
        "Perfect portrayal of rural india by TVF, i myself grew up in a village in UP and TVF have showed it pretty much accurate, that's how simple it used to be!, ahh man! I lived every second of each episode, went to a different journey from those memories after finishing each episode. I can't explain it! Well TVF did it ...",
        "Simply beautiful and beautifully simple.\n\nCongratulations to the whole team for producing this gem. I want to watch it again and again, especially when I am bit low. This is genuine stuff and proves glamour & glitter are not requirements for a quality production.\n\nAnxiously waiting for the second season.\n\nRizwan Karachi, Pakistan",
        "Top Class Series, Top Class Actor, Top Class Story.\n\nEverything is Top Class.. waiting for season 2.",
        "Loved this series, must watch! 💜. TVD'S best gem of series. Just watched the 8 ep's . Jeetu yaaar you are awesome.",
        "Totally a heart warming and enticing village based realistic drama... awaiting for season 2",
        "Beautifully made, Almost felt like i was living in that moment. The most appreciating thing is the content is presented with such a grace , and acting is simply awesome, this is perfect example when a good acting skills are mixed with an superb story and mind blowing direction.",
        "This is an extraordinary Hindi web series I have ever seen. The performance of each actors are so realistic and praiseworthy.\n\nI am eagerly waiting for the second season.",
        "Too good series. Must watch. One of the best serial in decades. Waiting eagerly for season 2.",
        "Totally new story, it's like a feel of fresh air in the middle of movies full of vulgarity, violence, and dirty language. Director did a very good job. Raghubeer yadav is a good actor. Jitendra Kumar is also very good. Other Directors must learn that a good series can be made without use of dirty things.",
        "This show appeals me at a personal level. The fun and simple life that people have in my north indian village has been portrayed to every possible detail. The episode of \"chakke wali kursi\" took me on a laughter ride.",
        "What a series boss. Full entertaining , great story line, great cinematography, great acting. And the ending was unexpected . Fully emotional. Eagarly waiting for season 3.",
        "Panchayat season 2 did not break the expectations like the second season of other webseries. A unique amalgamation of love, squabbles and comedy that makes a man jiggle. Favorite webseries and greatest webseries of all time.",
        "TBH this is the best series I have ever watched. Eagerly waiting for season 2.",
        "It's an amazing series and I am a fan now! The casting is so well done you don't think for a second ..anyone is acting.",
        "Really Really good i love it. One of best series. Must watch it ....",
        "This might feel slow to some, but totally drenched in subtle comic elements. What a script, screenplay, direction, acting...that was a total gem! Can't wait more for the next season.",
        "Panchayat's biggest strength is its simplicity and by keeping things simple, the series wins hearts. It's truly a masterpiece - in these times of adrenaline driven dark stories of crime & gore, it is a refreshing change to see a simple story.",
        "Superb informative & entertaining series without any \"fluff\" about the real life issues in my beloved India of today. Definitely a most watch - desi or non-desi.\n\nAlthough I'm now an NRI (in a cold northern country) I need to go back and explore the interior i.e. Phulera in UP - once this C19 is done with.\n\nIn the meantime I got some bottle gourd for lunch tomorrow.\n\nOne question if I may - most of the characters wear a half sweater over their shirts - is the weather cool enough to practically allow this because my understanding is that its about 30c normally. Thanks !",
        "Every character looks like meant for that role. Deeply impressed with the showcase of simplicity in the acting of Raghuveer Yadav and Neena Gupta.",
        "If you've ever visited or lived in rural developing India, you'll be able to connect with some aspects shown in this series. Good dialogues(some one liners were a hoot!), amazing acting by all actors, gentle tug of heart interpersonal interactions and best of all..no OTT drama with positive endings if u want to get inspired! Give it a watch if this sort is your cup of tea.",
        "The series is fantastic with great actors . Story telling is very good . If you want to watch a complete series this is that one. Not like others series full of toxic language and adult scene . A series with good comedy scenes strong story . The location is selected perfectly and it show love,fight,friendship,respect and care which forms a family . It describes the atmosphere of village . Every episodes has differnt story you will never get bored due to it . Finally this series deserves many awards . 👏",
        "You'll feel the great vibe throughout the entire season 2 and the unexpected climax will leave you teary and wanting for more. And the romantic wire between Abhishek and rinky was the sweetest thing in this new season ...... All the characters have done their job perfectly Points for why should us watch the season 2 1. The beauty of the village 2. Romantic but pure relation between abhishek and rinky 3. Sarpanch , prahlad , vikas and abhishek bond over all matters 4. Real problems of village and the mentality of the villagers in a humorous way 5. Every episode has its own morals.",
        "Very nice 3 season also pls.very good and i appreciate their hardwork.they have made an absolute amazing series even better than kota factory.jitendra bhaiya op.",
        "What an amazing season. It's very difficult to live up a perfect Season 1....but the Panchayat team did it again. Beats your expectations...off course in a positive way.! Episode 8😭",
        "About villages being portrayed in Indian Cinema, unlike you think, we have already had all type of diverse depictions in every era. Some show remote areas / tribal people, some show smart people. Some villages have all modern facilities and some like the one in this series don't even have proper electricity. There's nothing novel in this series. Nobody wants to see how a middle class boy who didn't study well, landed in a screwed up govt. job and is not able to cope up, makes some friends and things get better. We have all seen these things since always. TVF has over these last 4-5 years made excellent series, but I will definitely put this one as one of their most mediocre presentations. Btw I hope you are not directly/indirectly associated with TVF, are you?",
        "You are definitely gonna enjoy this short story....the feeling u get after watching this series is amazing. A must watch series who loves the village dramas.",
        "Natural acting, nostalgic, genuine, best part is that all characters have gray shades but are good human beings overall, all characters are so familiar if you have ever lived in any small town or village of UP.",
        "One of my favourite webseries. I love to watch this.\n\nWaiting for season 2 from 2 year but after release sukoon mila dekh kr.\n\nBest webseries of 2022.\n\nMaza aa gya dekh kr Love you Jitendra Kumar.",
        "Nice job.....Last episode really touches deep down heart. Overall it was nice and worth watching. Now this 150 character making me write unnecessarily.",
        "After watching this I am no more a fan of Jitu bhaiyya",
        "Best web series yet i have seen all the people must watch. And best cinematography,and jittu bhaya is best actor i have ever seen all the actor at the perfect time and best version of the village.",
        "A GEM to be Watched : True and Genuine Portray of Village Culture. Well Directed, never felt watching something created its as Natural and Genuine.\n\nKudos to TVf Team and Character in this Web Series, Never Given any review before, this Series Prompt me to do so, Series much to be appreciated and Celebrated. Its a SWADESH of INDIA WEB SERIES!!",
        "Superb web series ever last episode just nailed It. Even i don't realized when i get tears in my eyes and i had cried a lot until the episode has been finished 👍🙁 I have remine our soldiers salute to our Indian army 🙏",
        "The story line and the plot was very wonderful and the series is awesome and entertaining .. The second season has a good suspense at the end and give a excitement for season 3 it was very funny and interesting and emotional.",
        "Nice season i want to watch season 3 early as Nice season i want to watch season 3 early as possible early launch season 3 panchayat. Early launch season 3 panchayat. Nice season i want to watch season 3 early as possible early launch season 3 panchayat.",
        "Tvf huge fan 😍😍😍.. pls keep making something surreal like this plssss.. i watch it in repeat.. jitu sir Pradhan ji madam ji rinki vikas .aur up Pradhan ji kya character play hai sabka each n every single character mind blowing.. this is called cinema no vulgarity at all.",
        "Waiting for next season. Make fast season 3 and realease as soon as possible I can't wait.\n\nThis is fantastic and mind-blowing series. So waiting for next season it is best.",
        "Panchayat is one such village we all want to visit once in our life. The whole story keeps u attached with it until the last episode. All the characters and stories in every episode is so simple and relatable u will absolutely love it. This is one such series which breaks a lot of stereotypes related to our villages and villagers. The way story goes ahead from where they left in last season and deals with such ease and love it's best. Panchayat keep u glued to the screen that u forget every other thing and watch all episodes in one go. The characters are so beautifully written and shoot so well that it seems u r actually living with these ppls in phullera village. It's just amazing and i don't think any of our webseries have strength to show it this way with so much simplicity, love and happiness. I'm a big fan of tvf and this made me a bigger fan. A must watch for whole family. The ending is unexpected but y get the intuitions in last episode and it's emotional but it's best.",
        "It's completely refreshing, entertaining n the most innocent watchable thing on OTT, in fact one of the best on OTT.\n\nJitendar, Neena, Raghuveer, fasal Malik impressed.\n\nChandan Roy's innocence is cherry blossom. You will start enticing to visit a \"phulera\", a soulful feeling.\n\nSalute to the content writer n casting director.",
        "This is the best web series i have ever watched, kudos to the writer, director & the living roling character which is played by the brilliant actors.\n\nNo words to say just mesmerized by watching it.\n\nKUDOS TO TVF TEAM!",
        "I have seen these characters, these situations, these emotions during my village days. Everything felt so real. Acting Writing Direction songs all superb. #Panchayat2 #panchayat.",
        "Everybody and everything about Panchayat was perfect. Cant wait for season 2.",
        "This series showed how a good series can be made with small budget and entertaining plot. Actors were top notch. I liked the acting and accent of Vikas. Jitendra and raghubir were excellent as they are always. I hope amazon prime will bring more like this series in future.",
        "Situational comedy, real characters. whatever you want from a web series.",
        "Really enjoyed watching this. Signature TVF. Hats off to the creative team behind this. These days, it is really hard to find something so simple yet so enjoyable to watch. Charming characters, superb acting and great writing simmered with awesome background music and a dash of nostalgia! Worth a watch!!",
        "Its very good to know that most of the series these days has lots of potential. \"Panchayat\" is one of them. I was little skeptical before watching this series, but watched it any way. The very first episode drew my interest so much that I watched all episodes in a single day.\n\nThe rural setup, the beauty of village, light comedy, a little suspense makes you curious about \"who portrayed the role of Rinkie\", nicely written script, good direction and brilliant acting, all in one makes you crave for the next season.\n\nCouldn't stop from reviewing the show. This show well deserves 10 stars! I highly recommend this show.",
        "What a fantastic TV series nothing special yet everything is special about it simply brilliant direction acting script.",
        "Good series with good content and realistic comedy with great humar.Not any frame is drag in forcefully and each episode is unique with diffrent episode story like old hindi classic series like Malgudi days and hum panch but also parellal story for next season with hopefully more laugh to come.",
        "Mundane script. Poor execution. Incomplete character development.",
        "Everything from story direction to acting is so so good. Being relatable to all generations is simply perfect. Special credit goes to actors too who performed brilliantly.",
        "Very unique. After watching so many series, we needed something like this.",
        "Well done series showcasing the modern day rural India",
        "In an era of over-the-top and complicated drama series taking away all the screen time, here comes a \"honest, simple and brilliant\" series which keeps you engaged with classic storytelling skills. A must watch.",
        "Panchayat is an apt combination of raw talent (Jitender) and experienced campaigners (Raghubir Yadav & Neena Gupta). Chandan and Faisal provide brilliant support.\n\nThe narrative is simple, innocent and effective. Despite me not coming from a rural background, there is an emotional connect with the characters. Each episode touches upon some common issues prevailing in our society and drives forth a moral in the end.\n\nKudos to the whole production team.\n\nEagerly awaiting other seasons now.",
        "Essence was there. Acting was good. You will get the feel of true rural India by watching this masterpiece.",
        "The entire season is so professionally made that it is better than most big names of the industry. Excellent performance from each and every character. Raghuvir Yadav was absolutely outstanding unfortunately an underrated actor. Amazing script, story, music and acting. No department lacked in any manner",
        "Well written, well scripted, cheerful comedy-drama. Characters development is great.",
        "The series has aced every detail and aspect - from the plots of each episode to the costumes, set design, supporting characters - every bit of it is pure example of how one can master the art of filmmaking. I've watched it three times and still love it.",
        "Nice story, good acting, awesome direction. Brings smiles on my face.",
        "I love quiet and simple life so i loved this series. Watching it makes me smile and this is more than enough for me.",
        "It basically deals with many important aspects related to rural area of india. The cast selection is almost perfect, after long time got to see Raghubir Yadav on screen. As usual Jeetu Bhaiya has brilliantly acted. Good work by all actors and nicely executed. Watched in single go. Loved it. Waiting for Season 2.",
        "Please dont spoil this beautiful film in furthur episodes.. this is beautiful",
        "We just finished watching Panchayat, a series in Amazon Prime. Highly watchable and very well written. If you enjoy, R K Narayan's warm and fuzzy stories about simple characters and storyline, you will definitely like this.",
        "One of the best Indian series that I have ever seen simple but elegant.\nBest Music\nBest Acting\nBest Screenplay\nBest Cast\nObviously The Best Direction\n\n\nEverything is best about this series. Waiting for the next season.",
        "Captivating story line. The show seems to me lot of innocence, funny and close to reality. No unnecessary kissing or any nudity, can be watched comfortably with all the family members. There are curse words used but very rare.",
        "Great one to watch, In this we truly understood, In village how life is",
        "The story is very simple but played in a very interesting manner,things shown are quite realistic and can be easily related to one's life.Very well played by the lead and well supported by other star casts.Indian television is changing.",
        "There was a smile on my face at the end of every episode.",
        "Imperfect and sometimes irritating characters, but somehow you till end up liking them. Different motivations, emotional journeys, laughter - this show has it all.\n\nYou get to see how this massive country with such different people live together.\n\nUnlike any show I have ever seen before. I am lost for words.",
        "Good 1 day watch. Something that can be enjoyed with family.",
        "I love this web series most. A story of a villegers nicely portrait.",
        "If you have seen the rural life of Bihar or UP then you will quickly co-relate with this. Even if you din't, still its a enjoyable watch.The dialogs,scenes and acting makes this very genuine.I have seen Mirzapur, Jamtara etc.but this beats them all and way better than those.A must watch I would say.",
        "Beautiful Web Series. Nice to watch. We can see the beauty of Indian Village",
        "I don't understand why Bollywood fan guys give ratings according to the cast they like or what production it's from, it's nothing more than typical Indian drama and sab tv comedy serials are way better than this, guys please see the content and give ratings based on how much you enjoyed the show don't do f",
        "Jeetu bhaiya toh dil jeet liye.. Wonderful show. Great actors, great direction, bang on background score, and a deep subject matter presented in a lighthearted comedy. This is the kind of stuff which restores my faith in India's future. Hats off, tvf team!",
        "Every episode of this brilliant series gives you something different to think about in the end. It will be difficult to choose the favorite episode for sure. I finally came to know how rumors spread in a village on screen for the first time. Vikas (Chandan Roy) would be my favorite character from season 1 for sure. If I could say anything was missing from this series, that would Gajraj Rao. You can't miss this one.",
        "Another masterpiece by TVF. Not to be missed, simply loved it.",
        "Having watched a lot series from TVF on Youtube i did not expect anything but a 10 rater show again. The exact thing happened. Acting was brilliant. Every episode gave a different feeling with a hidden message. Cant wait for season 2 if there is any...",
        "Story is very realistic and very good acting by all :)",
        "Great story build-up.interesting characters.jitendra kumar is just too damn good .",
        "A must see comedy portrayed in a subtle way, enjoyed every episode of it with family. One of the best I have seen so far with some good messages as well. Kudos to the team and look forward for season 2.",
        "Storyline is just great. You will love it. And the main character is also great. You can't stop watching again and again",
        "Simple and Brilliant story . :) Waiting for season 2 .",
        "Most of the charachters are really good and the direction is simple and really upto the mark . Great job by jeetu and other cast .. wating for the season 2. :)",
        "The series is an excellent depiction of Life and people in rural India. Along with making you laugh the series puts out a social message in every episode. Every character has given an award winning performance. U won't be able to stop urself in between once u start watching.",
        "What a beautiful and soothing web series!!!! Man bhar gaya... Jeetu bhai is lit!!",
        "Love, happiness, sadness, violence everything is mixed up here. Such a nice story. Jitendra is a very bright actor. He showed his best I guess. Love the nature, feelings, quarreling without no resons. Hope there will be S2. And I forget to mention background music 💖",
        "Amazing series. All actors played their characters wonderfully, jitendra completely nailed it. He deserves tremendous success for this. Loved it.",
        "The show grows up on you with its amazing starcast,subtle humour and natural portrayal of villages in India.Often in movies ,the portrayal of villages becomes so stereotypical that it disconnects the viewer from reality,something handled fairly well.",
        "Loved the series. Great direction, so refreshing to see simple but subtle art of story telling without over dramatizing. You guys showed the real life of a village. Will be waiting for Season 2.",
        "Another unique and amazing series by TVF, love the way they express contents in realistic drama. Also Jitu Bhaiya added glory by his acting",
        "You will smile throughout the series, wanting for more!! Honestly I am disappointed with the makers for duration of episodes,it should be for atleast 45-50 mins as for 25-30 mins for each episode is way to less for a brilliant series like this. You will get a real feel of our Indian village which makes this series top notch,each and every character has done amazing job.Kudos to TVF for creating such content, desperately waiting for season 2. Don't miss this.",
        "This is a very light hearted series covering broad spectrum of problems starting from unattractive govt job and probelm of unemployment, bad governance at grassroot levels, dowry, misbelief, dominance of groom side etc. There are lots of subtle elements such as pradhanji and secretary relationship (as father son), husband wife humor, local lingo and phrase, which makes it even more complete in the storytelling sense.",
        "Really loved the series and the story line. The acting of each and every character was good. 😍 Next season kab aayega??",
        "I really loved the series. Storyline is amazing, acting is top notch ane over all its a must watch series. TVF has a history to release class web series and panchayat is no exception in it. Jeetu bhaiya has again won the heart.",
        "Wow..wow..wow.......never seen an INDIAN web series as good as this....waiting eagerly for next season.......I don't have words to express...",
        "Best performances by all the characters specially Raghuvir Yadav, Neena Gupta. Chandan Roy and Jitendra Kumar also surprises with the best acting. Overall fully entertaining and fresh subject after long time.",
        "Dont miss it. Right from beginning to end, this journey takes you to somewhere and let YOU FEEL GOOD for yourself. Most waiting for Season 2 ( Hope it comes....)",
        "Best coming timing Best acting and ofcours a fantastic story",
        "Jitu did marvellous acting as per characters. I was looking for this type webseries or serial for long time.",
        "1) Vikash and prahalad's character and actor were spot on. 2) Loved the drama around - hum dulha he 3) Challenges linked to children and population control is very well woven 4) spat with local goon, and humare gaon se he were just superb 5) Jeetu and Raghuvir nailed it again with ease",
        "Episodes were very good, waiting for the next season.",
        "Very light comedy mixed with hard hitting acting performances. Fantastic job by acting legends like Raghuveer Yadav and Neena Gupta. Jeetu is ofcourse best and was at their level. I binge watched it with my parents. All I can say is it will definately put you in better mood.",
        "Finally a show that the whole family can enjoy! For the first time ever, I saw my folks craving for more once it ended. I absolutely loved it. Please make season 2. Don't Pitchers it as well. 😋✌🏻👍🏼",
        "Great content + excellent acting by veteran as well as all the new cast. And Jeetu bhaiya is ever awesome. It's a must watch to understand bits and pieces of rural India with excellent depiction and script.",
        "Panchayat is one of those tale which connects people to real india. This is simplest but so beautiful tale I have ever seen. Now I am desperately waiting for season 2.",
        "Have been a fan of TVF since 2014. Jitu Bhaia acting skill is going high by each passing day. Love for Panchayat- it's has been directed from the heart. Kudos!! to the team.",
        "Jitu bhai is genius.Every one should watch it. All the actors are wonderful.",
        "From TVF, that is enough to describe how beautiful this series is",
        "Best web series focus on reality of rural India.its totally different then other web series which mostly are crime based having violence this one is different it can motivate you.",
        "A feel good series. awesome acting by the actors #prahlad #vikas",
        "Rural India means Real India. Fantastic story & direction with talented actors and actresses. Nice work by TVF team.",
        "Panchayat TV series is an example how a simple story can be made into a terrific series. Be it the direction, acting, screenplay or music everything was top notch right from the beginning. The second best TV series from TVF after Pitchers.",
        "Watching it again and again and again till season 2 comes",
        "One of the best shows based on rural india. Jitendra kumar, raghuvir yadav and neena gupta were phenomenal. Side actors were also spot on.",
        "The simplicity of its storyline, Life lessons delivered in form of humour and Stellar performance from some of the underrated gems makes it a must watch.",
        "Each and every actor has performed brilliantly, music is on point and the show depicts the rural life very beautifully.",
        "The best of the best , full 10 stars, exceptional screenplay and direction , very real casting , Panchayat will take you to actual village life .... Must watch....",
        "One of the best web series..i have ever watched .Acting of all the actors is simply awesome.",
        "Things have been put right in place for the overall series. All lead actors have justified their roles very well. Very pleasant to watch the series.. Good one. Hope the next season releases soon.",
        "Each Episode showcase a new incident which is very well depicted in its best way. A must watch show who is looking for a different drama show than the usual . The way its has been directed will steal your heart leaving behind a smile on your face.",
        "The show is a breeze of fresh air with unparalleled acting and storyline. I was so happy watching the show and I could feel each and every moment .. must watch",
        "This show brings back memories of my childhood, village life, taking me to the roots. It also has a very refreshing vibe like malgudi days. I really wish TVF comes up with a season two!",
        "Truly enjoyed watching this. One of the best shows in last few years",
        "Watched the show in one go, really worth it.This reminded me of all the epic shows we used to watch in 90's.",
        "Hats off to TVF team and specially Deepak Kumar Mishra. Amazing story and as a viewer I enjoyed each and every episode and learned something out of it. A wonderful inspirational series for people with a wonderful message.",
        "Each and every character has their own importance and they were given their best performance.i was completely impressed by the series.I watched the series in a single run.Those people who like comedy drama this is the best choice",
        "Expect more shows like this which we can watch without using earphones",
        "Panchayat breaks the trend on a sequence of successful OTT that tend to be focused on the dark side. It is a light-hearted comedy with messages added at the right places. It brings out the innocence that resides in the villages and people of India. Highly recommended.",
        "Loved the show.Something new, fresh, original Really hats off to the entire team. Waiting eagerly for second season",
        "Specially for students who are facing daily his own competition and they fade up but we learn from this web series never should be give up. We should work hard and not wait for success. It automatically depends on your dedication.",
        "Nice to watch with family, no over drama, based on real life situations with great screenplay by all actors.",
        "If you enjoyed watching Malgudi Days then you will be liking this. Each episode is like a short story. Characters are simple but lovable.",
        "Deducted 1 rating for delay in second season.\n\nLoved the series. Real portyal of a village and roles were played splendidly.",
        "If want to see villages or real village in rear then it is the best ever web series. In this we can also the reality of panchayat with humour.",
        "Logged in specially to write this review. There was no option of submitting any review on amazon prime. Really loved the show. Wonderful work by all the actors. Great realistic story. Loved everything about it. Really relatable. Would love to see season 2",
        "Awesome. All the characters are extremely good. Chandan Roy is outstanding.",
        "Made an account on IMDB just to rate this :D You will fall in love with each and every character...",
        "A beautiful cinematography and presentation by all the actors and the crew. It will somewhere surely take you to your old days when you will be able to imagine the good old days of you life where you have spent your days in rural India.",
        "Excellent watch.One of the best web series.A show with both heart and soul.Strong characterisation and simple writing.Add to that steller performances by jitu,Chandan roy and of course the great raghuvir yadav make it one of the best watches this year.Would have loved more episodes in this season.Eagerly looking forward to season 2",
        "Like always tvf did it again..!! These people know how to stick the audiance to a show about completely normal life. Its the feels you get while watching this, acts as a glue between the show and audience. MUST WATCH..!!!",
        "What a series Full of comedy full if enjoyment Need more episodes or series quickly",
        "Simple, light, intersting and enjoyable. Also, points the reality with good indirect message. Must see.",
        "Tvf always win your heart by their content.i watch it full without take any break..",
        "It's natural comedy I feel, from long time I can't seen any movie or web siries that kind of natural comedy and story line. Every charecter justice with there role. Specially aatma sanman episode I like very much. Thank you tvf for providing great level content for public.",
        "Another gem from the TVF stable !! Watch it for the simplistic yet quite engaging screen-play brilliantly supported by all the lead actors. Jeetu again steals the thunder, it's a delight to watch him! Go for 'Panchayat' if you are looking for a simple, realistic and light-hearted series. It may pretty much pull you in for a binge session .. did to me!",
        "My heart felt 9 star to this amazing drama. It's leaves an impression. One of the best series I've come across lately, it's a laid back rural comedy drama depicting the lives of people in rural India. It's real and great direction i must say.",
        "I love this series,Panchayat is a perfect example that what you really need to make a series sing is a solid script.",
        "Full of gags and motivation and cent percent real gaon story",
        "Initially i was very reluctant to watch as I thought it will be of village kind of story related about panchayat and all. I saw the first episode and all the characters looked very interesting.... And very soon i was hooked to it.... Amazing storyline, amazing performances and the best is when all four come together ( Sachiv ji, Vikas, Pradhan ji, Prahlad Ji ).\n\nI have never written any review but yeh toh likhna banta tha boss..... Amazing i loved it",
        "What a web series. I am in love with all the characters of the show. Cast of the show and acting on superb. Waiting for the season 2.",
        "Need more such positive Indian series. Really creative and makes an honest attempt. Well done TVF. Jeetu and all actors did a really good job! Will we have a season 2?",
        "Panchayat is a web series which evolves around a small village showing us that how a engineering graduate due to lack of job becomes secretary of a Panchayat office in a remote village in Uttar Pradesh. It also shows that how that person is trying hard to get a good job by studying day and night for CAT exam. In few episodes the value of friendships is also portrayed in a good manner. The storyline is very simple and it will touch your heart. In this web series it is also shown that still in many remote villages the proper education is not provided especially to the females and dowry is still there. This web series has drama and with a little touch of comedy. All in all Panchayat is a excellent web series. Worth Watching",
        "Awesome storyline....just love it . .\n\n\n\n.\n\n. . .",
        "Awesome experience. after completing the web-series. Acting and directing every thing is up to the mark .",
        "Greatest series ever made, hardly feels like a series, feels like the monotony of daily life in village unfolding in front of you. Words can't do justice to how good and deeply rooted and connected this web series is to the culture of India back in my days. I rewatched the season 1 with my family soooo... many times and was eagerly waiting for season 2 and it doesn't disappoints. I will be waiting with bated breath when season 3 drops again. I hope this series never ends and they make 2 seasons at least every year. It was such a long and painful wait of 2 years for Season 2. Bring on the Season 3 already...",
        "Pradhan ji's acting was heart touching ....even i've to write review in the middle of series..",
        "It's one of most real show ever made. With awesome acting performance and real production.",
        "One additional thing you get with the package that is comedy. This series will seriously make you laugh many times. All the episodes were treat to watch. Great story line, everything depicted in the series was in a plane and very simple manner which is lacked by many series these days. A must watch.",
        "Without sex , violence or exotic locations or without any rich sets how one web series could made deep impact on anyone with awesome story telling , fantastic direction or with natural acting that called \" Panchayat\". Best web series in prime till date 🙏🙏🙏",
        "Undoubtedly! This is the best I have ever seen from Bollywood.. eagerly waiting to so much of this kind and obviously the second season of this one itself.. 😍"
    ]
}