{"reviews": ["This was a silly kids' adventure story but still fun the younger ones and for adults, thanks to colorful scenes, great special effects, decent humor and a nice family tone to it. The kids are alright, except the girl is a little bossy, and the villains aren't too nasty. This also looks very good on DVD.\n\nIncluded in the color and characters are \"the thumb people\" who were especially fun to watch.\n\nThe only problem I found with it is the last 30 minutes in which it got too silly and emphasized (typical Hollywood) how the kids can do the job better than the adults, which a ludicrous film cliché. However, overall \"family unity\" gets a big boost in this here, even in the end, and that good message is probably a big reason this movie was such a success.", "This movie tries to do a lot of things, and it hits the target nearly every time. Very cool visuals and action.", "Juni and Carmen Cortez are kids whose parents have one secret: they are spies working for the O.S.S. However, the two adults are forced out of retirement after fellow spies are reported to have disappeared, with the father, Gregorio, thinking the spies are mutated into the character of Juni's favorite show, Floop's Fooglies. However, when the two end up getting captured themselves, it's up to Juni and Carmen, who learn of their past from Felix, a man posing as their uncle, to save them, if they can stop arguing with each other to work together.\n\nThis is a great family film. The action is well choreographed, the actors all do a good job, and the story is nice. But the real good thing here is the special effects. The only problem is Carmen and Juni's bickering can be a bit annoying.", "I loved this film as a kid and wanted to go back and watch it again to spot all the moments I enjoyed first time around.\n\nI think all these years later the film still holds up as a bitter than average family film. I don't think the director needed to stretch it out to be a trilogy (or add the very poor fourth entry many years later)but that's another matter.\n\nThe two lead kids play the parts well and have a good dynamic between them and Antonio Banderas/Carla Gugino are good support as the parents.\n\nWatching it back now though I think it does have some slow parts and the technology looks a bit dated compared to what we're used to today, but Spy Kids 1 still remains a quality film for all the family.", "This was a great movie. I particularly like the fact that a normal sibling relationship was shown, the rivalry and disdain but still the reality that blood is thicker than water and no matter if you think that your brother or sister is a twerp, you still do anything for them. The family sticks together and although it is a very far-fetched concept, it was a movie both my children and I liked. It was filled with action and adventure but the good guys come out on top in the end against overwhelming odds. I think we could all use a little more optimism now and this movie delivers it. Carmen and Junie were not the impossibly perfect kids seen in most movies now. Nor were they brats who only care about themselves in other movies. They were too athletic to be real children, but I'd like to think that they are showing the kids seeing the movie that they can do anything that they put their mind to. Overall, a terrific family movie the kids will actually like-even though their parents do too.", "I thought Spy Kids was a pretty cool movie to watch. I did not expect much of it at first but I'm glad I saw it because I really enjoyed it. This was not the bad movie that I had anticipated. I even liked the sequel to this movie.\n\nThis is about very young spies who are on a mission to save the United States, of course.\n\nThe cast is pretty much an all-star cast. The spies played by Alexa Vega and Daryl Sabara are pretty good. The parents played by Antonio Banderas and Carlos Gugino are wonderful.\n\nOverall, this is a good piece of work. I also like to mention that some of these gadgets are cool. I rate this film 8/10.", "I took my two boys (7 and 10) to see Spy kids today. They were transfixed and wanted to watch it again straightaway. Both are big James Bond fans but some of the content and dialogue of the Bond movies isn't suitable. Spy Kids fits the bill exactly for anyone under 13 who likes the Bond films. It came over to me as a blend of Charlie and the Chocolate Factory meets Home Alone meets Bond. It was at the kids level without patronizing them and was believable enough for adults to enjoy too. All of the acting was high quality and the special effects first class.\n\nI shall enjoy it again in the future on video but it deserves to be seen on the big screen first. Another bonus were the trailers for Lord of the Rings and Harry Potter and the Philosophers Stone. I often come away from Cinema trips with the kids feeling that we haven't really had our moneys worth, but not today!", "okay. so.. I'm almost 29 and here I am enjoying a kids movie. Frankly I don't care. Sometimes a fun movie such as this... lets the critic in me out to dry for a bit. After watching silly movies like Clockstoppers and so on.. This movie was totally fun to watch. The only disappointment. It's short. But hey it's fun nonetheless. Perhaps the spy kids can take a lesson from Harry Potter... and run one of their movies 150 minutes long. ;)\n\n8/10\n\nQuality: 7/10 Entertainment: 10/10 Replayable: 9/10", "A cool family film with awesome special effects. Two sibilings(Alexa Vega and Daryl Sabara) are suddenly pulled into danger, when they discover that there parents(Antonio Banderas and Carla Gugino) are secret agents, and they captured by a madman. It's up to these young ones to rescue them. A film you can enjoy again, again, and again. It's well acted by everyone.", "I couldn't help but look at the time every 5 to 10 minutes because I found this movie a total drag. Childish humor, cheap looking sets, cheap looking effects, a plot that makes \"Legally blonde\" look like \"The Usual Suspects\" and so many coincidences that I can now officially say that Robert Rodriguez had brain surgery somewhere after 1996. The only thing he left as his trade mark are some cool camera moves, but there's where it ends. OK, so the guy decided to do something new for a change, a children's spy movie. Well if I were 12, I'd feel insulted. The best thing in this movie is the absolutely amazing Carla Gugino that just stole every scene she was in. Sadly, there weren't many. 4/10", "\"Spy Kids\" was a big kids hit! I thought it was pretty cool that there are these two kids Carmen and Juni Cortez who have to save their parents from danger. But I think it could have been better. I didn't really like how they showed how Carmen and Juni's parents got married because seriously, lets get on with the movie!!! But I LOVED the cast. Alexa Vega, i thought was the best one in the cast! She is a great teenage actress and should go really far in the Hollywood movie making business. Daryl Sabara was so cute playing Juni and should go far as well. There was Also Antonio Banderas, and it was an okay movie, not the best, but i expected better.", "Robert Rodriguez just plain out sucked in making this film. It's a complete moron kind of film with no point at all. Who would make a piece of trash movie with just no point in it? I blame Robert on making this, it was just a sucky movie. I think he needs to do action films instead. Also why do kids save the day. That girl is weird and her little brother is annoying and how could he save the day, he's stupid! They should've died and also what is with the thumbs? I had no idea what was going on in it. I got one more question and then I'm done. How can this get a 6.3 rating. It should be in the bottom 100. The only good thing I'd say about this movie is that they have alright inventions but that's it.\n\n2/10", "\"Spy Kids\" is a Robert Rodriguez-directed film about two kids who find out that their parents are international spies, and that they've been kidnapped, so now they have to save them by using their parents' technology and spy-gear.\n\nThis isn't too bad, actually. It's certainly a departure for Robert Rodriguez, a man known for the \"El Mariachi\" trilogy, \"From Dusk Till Dawn\" and \"The Faculty.\" It's certainly not his greatest effort, but it's still good nonetheless, and it's certainly better than some family movies that I've seen. It actually had some stub - spome spaplala - \"substance.\" (Thank you for reading me this far, I was saying it just like that while I was writing.) So, all in all, I recommend it, it's a great movie to watch with the whole family. And, it's a good way to introduce your kids to Robert Rodriguez, whom they might really get to know with \"El Mariachi,\" \"From Dusk Till Dawn,\" and \"Sin City.\"", "This movie was an excellent adventure for kids that love action and trying to solve mysteries. This begins when the Kortez family who is involved with the United States Government fighting the bad people, have to find out what the problem is and how to solve it. Their children always seem to want to not want to get involved with their parents but now that the kids want to be a family they want to help try to become a Kortez Family. Everything seemed o.k at first but when things got hectic the children were to try to find their parents before it was too late and the bad people capture their own family. Stay tuned to find out can the children accomplish it before it too late.", "I came into Robert Rodriguez's Spy Kids expecting stupidity and cliché, but I got something enjoyable and original. It's full of fun special effects and offers little crudeness like this year's previous Shrek in the way of family entertainment value. This is a likable adventure from start to finish and never tries to make itself larger than it appears to be. It's not pretending to be a cultural statement or a book of moral values. It advertises itself as slick entertainment and as a whole, it pulls it off and never really lets us down. A nice change of pace for Rodriguez, after directing a number of violent movies comes up with this most pleasing children's yarn.", "I think Spy Kids is quite a good film. It is a bit silly, but that's not always a bad thing. It's has a good cast and a good storyline and quite a few good laughs. It's a good adventure film and I'd recommend it.", "Rodriguez making a kids film always seemed slightly surreal. The result in many ways is a joy.\n\nThe actors are competent, and the special effects are basic at best. However, what we have is innovation humour and a film that is a lot of fun. It doesn't patronise the kids, and adults will enjoy big time.", "With the release of Spy Kids 3D, a friend of mine told me how desperate she was to see it. I confess to being a little keen, but upon mentioning not watching the first two, she instantly walked to her dvd collection and forced them into my hands. So here I am, it's Sunday night & I've just watched the first one. Know what? I think it's brilliant. I mean, don't get me wrong, it will never win any awards for it's outstanding plot, but for the occasional hilarious moment & for the general relaxed nature of the film, it is the perfect type of film to just sit and switch off to. I'm not surprised children love it, and it's even less surprising that the adults of the world who're reliving our childhoods, the film is a breath of childish fresh air. Time to watch number 2 perhaps.", "This movie is superb, beside the effects, action and the story is well written too.\n\nSome part is obvious and similar to other movie. Such scene such as small items being transform into a burger in a microwave. Other than that, totally entertaining family movie.", "People should not judge this movie. I know alot of you think that it's so lame and it's taking Hollywood down the drain. But there are ALOT more kids movies then this that are destroying Hollywood! There is so many kids movies out there that have stupid toilet humor and Poop jokes that do not expand kids minds at all, and make them vedge out so much that that's all they want to see in a movie. This movie has good action and is great for kids. Besides the adults get all the cool movies and kids get the bodily function movies. Not this time. The kids now have their own brand. Not to mention these movies might expand their minds.", "No matter how bad the movies watched in childhood were, they always sound beautiful and nostalgic.", "especially for kids. I thought this movie was fun and cute. I really liked how the kids got to be the heros. All the neat \"James Bond\" type gadgets were cool. The special effects were pretty good too. And there were some laughs throughout. Alan Cumming makes a great funny villian.\n\nFINAL VERDICT: This is much better than a made for TV Disney movie. It's entertaining with a lot of neat gadgets. I'd say it's worth watching.", "Wow, this is a really bad movie! O.k., it's supposed to be a movie for kids, but is this a reason for a bad story development (this kind of story definitely had the potential to produce a good movie) and a huge mass of logical errors? I think not. And so did many kids that saw the movie, as I noticed afterwards. There are lots of good movies for children, but this one is definitely not one of them. We all know Rodriguez can do it better, at least in the \"grown-ups-section\". Maybe he should just keep his hands off of movies for children. Anyway, keep your hands off of this movie. You will regret if you don't.\n\nRating: 1 of 10, realistically seen still too high.", "I don't think I liked this movie even as a child. It could have been engaging and suspenseful but it was too silly. The story was unconvincing and the characters were over the top.", "This movie for the most part is not only terrifying for children but totally unfunny for adults, I wouldn't recommend this movie today at all and would hope these films stay forgotten.", "Kid spys, microwave instant McDonald's, unforgettable music, excellent special effects. Still holds up. I truly loved this as a kiddo and as an adult with a film degree working for a major streaming service in Los Angeles, I can confidently attest to the excellence of of this film. Easily one of the best movies of all time.", "Gregorio and Ingrid Cortez are two secret agents who have seemingly abandoned a life of espionage in favor of marriage and kids. Despite their efforts to lead a peaceful domestic life, their family is slowly being torn apart by their lack of closure. They're called into action for a vital assignment to try and thwart a mad scientist/evil genius type, but when the mission goes terribly awry, the only ones who can save them are their two precocious children. Watchable, pleasant, but overly cheesy film really only works for younger audiences; although family-oriented and effective as eye candy, it would benefit from less camp and more smarts or substance. An overall air of silliness and a familiar, matter-of-fact message about the importance of family doesn't make this quite distinguished enough for all ages. **½", "This is a fantasy kid flick that is only suitable for those age 10 or less. I was hoping for some drama and suspense and was sorely disappointed to find out this movie is little more than a cartoon show. This movie may be suitable for 4-8 year olds, but this is definitely not a movie for teens or adults.", "My children liked the movie, but I can't say that I liked it at all. Kind of a stupid \"kid's James Bond\" movie. I wish there were more spying going on and not so much flying. The movie seemed rather short, also (about 90 minutes?).\n\nToo \"far out\" to enjoy. It's a cute plot line - parents are spies but kids don't know it. Too bad the execution of the idea was flawed.", "Spy Kids is a kind of offbeat movie. It tries to parody the spy genre, and be a kids movie, and make a commentary and on the weird Barney/Teletubbies subgenre of kids TV shows. All filmed against a rather odd Mexican/Spanish locale, and using Rodriguez's stable of \"favorite\" actors like Banderas and Marin.\n\nThere's enough here to keep the adults (barely) interested. And the loud bangs and recognizable kid-social situations will keep your children involved. Generally I'd recommend it, but it's not really what I'd call an overwhelming classic.", "One of the few pieces of media that has a realistic relationship between siblings, HISPANIC siblings I might add. Seeing a latina older sister save her parents and the world was the representation my young self needed. Every girl deserves to be represented by someone like Carmen Cortez.\n\nAlso, Gregorio and Ingrid are the original enemies to lovers and powercouple, change my mind.", "I watched this when it first came out as a kid and loved this movie. Now re-watching as an adult, I'm not too sure how I ever liked this film. The graphics are beyond terrible, the filming of the camera is bad and the storyline is just plain weird. But I do have to give the two kids (Alexa PenaVega and Daryl Sabara) a thumbs up, they did a very good job acting their parts.", "I really enjoy family movies. I watch every one I have a chance to see. When My friend (Jimbo), asked if I would like to watch this with him at the movies, I thought \"I bet it is cute, but it is most likely silly\". BOY WAS I WRONG!!!! This is one of the best family movies I suggest you watch -> WITH YOUR CHILDREN!!! Yes, there is violence, but NEVER in a hateful way! The story is GREAT, the emotion is INTENSE! The BEST thing about this movie is that it ends with a positive message!! I watched this movie on opening day in America (3/30/01) and when it concluded, children were clapping with appreciation. I heard one child say \"THAT MOVIE WAS AWESOME!\".", "Robert Rodriguez's Spiy Kids is a goofy spy film, that truly will appeal to youngsters. I greq up watching theaw movies and re-watching it after all theae years, the effects haven't aged well at all, but the charm and soundtrack still have that charm to it.", "this is quite possibly the most retarded movie in the world (in my opinion and i hope yours, too). i went and saw this movie at the theater and left half way.\n\nif you have not seen this movie, don't.\n\n0/10\n\np.s. spy kids 2 and 3?! WHAT THE F**K IS WRONG WITH YOU PEOPLE?!?!?!", "A really good movie for kids, nice effects, story is completely made for children, easy to understand jokes etc.\n\nBut most adults will feel bored here because there is not much for them in this movie. The story is too trivial and foreseeable for them, the story holes are too obvious, and the message is far too simple. So its very likely that parents will fall asleep watching this with their children.\n\nNo matter, its a good movie for kids.", "'Family' or 'children's' films usually have bright colors and simplistic tropes, exaggerations and \"guaranteed laughs...\" Yeah, and mostly patronize the audience.\n\nAll I can say is this: it's the movie you would have made starring you when you were 8: perhaps there's have been more ponies or puppies or suchlike for some people, but forget that! The action! The adventure!\n\nSo set your mind to 8 years old, remember what you had to put up with and then watch this...\n\nYou're welcome.", "I can't imagine that people and adults like this movie..... what Guys this movie is brainwashing your brain is not even that cool like you guys think it was it's garbage.\n\nToo many garbage names used by Juni really besides Juni is a horrible name for a kid. This movie was terrible what happened robert rodriguez you made good movies but this was a disaster film. Please don't even watch it ignore rotten tommatoes case they are lieing it was terrible it's by fat the worst movie I seen in years ignore the positive reviews that movie was terrible I hated it. GARBAGE.\n\nAt least spy kids 3d was the best one haha.", "I watched this movie a few hours ago and I thought it was brilliant. This is one of the best movies i've ever seen and I am so glad that it won 2 awards but it definitely deserves much more. The action including the fighting was outstanding. Antonio Banderas,Carla Gugino,Alexa Vega and Darayl Sabara were great as playing the Cortez family and I also thought Alan Cumming was good (much better than he was in Son of the mask).\n\n2 secret agents (Antonio Banderas, Carla Gugino) have retired but have to go back in business when an evil man (Alan Cumming) threatens to take over the world. Their 2 young kids (Alexa Vega, Daryl Sabara)have to save them when they get captured to save them.", "I personally didn't enjoy the serie at all, but my sister may think differently:\n\n\"I love it, I love it, I love it. I like it because it's about spy and I love spy. And plus it's an action movie so I like it. Because you are always exited of what's going to happen next and even if I watched it 4 times, I never get bored of it. I really like it. My favourite character is Carmen. She's very pretty and always happy and cool. I hated the part when the guy stepped on gum. It was eww. But also, why does that lady have so many hairstyles. I really like it. But it's a little cheesy. I'm going to give it a 8/10 because of the cheesiness. Also the mommy's wedding dress was ugly.\"", "Spy kids was very odd. I mean I like wierd and funny odd movies, but this was just to much. It was so wierd it became stupid. One reason was that is had WAY to many gadgets. Yes, I know it was in the future but they have to draw the line somewhere. One other thing is that the bad guys were just so..... so .... I dont know I cant find the right word for how dumb they were. I thought of it as little kids movies and what Ive heard about the 3rd one is that it is even more horrible than the first. And I still dont see how people voted a 7 for it. I recommend not even wasting your money on this.\n\n-famo14", "Directed by Robert Rodriguez this is a departure for him. He replaces the big violent action sequences for more family friendly action sequences. He does a well enough job and while the kids are enjoying the movie, the dads are enjoying Carla Gugino and the moms are enjoying Antonio Banderas.\n\n3(***)out of 4(****)stars", "It isn't my favorite of Rodriguez's films, but it is fun. I didn't think I could like a kids movie, but I did. Antonio and Danny Trejo were great doing things they've never done in a movie before. The production design is incredible.", "When I saw this movie, I immediately was pulled in and obsessed. The trailers made the movie look bad, so I decided, no I shouldn't see it. Then on rotten tomatoes, I saw 93% which is a great amount. I decided to see it, and I loved it. For anyone who is uncertain about seeing this movie, go for it. It is an original, unexpected journey, that you can see repeatedly, and will not get bored. I think the best part of this movie is... the storyline, and the acting. Outstanding roles from Alexa Vega, Daryl Sabara (Carmen and Juny), and any other actor/actress in the movie. I recommend any parents to go take there kids to this movie.\n\nAfter all, Spy Kids is an original, first one out of the package piece of paper that sucks you in, making you stare at the drawing all day.", "Wow, after avoiding the series for years I got to see the movie SpyKids 3-D. Far from being lame and not the type of movie I like, I enjoyed it enough to watch SpyKids a few days later. Boy, what a surprise! I got to sit back and enjoy life again as fantastic stories were woven before my eyes, entwined with a pinch of realistic human emotion and a hope for growing up into something that exists despite the seeming impossibility of it. Be careful, innovative, compassionate, and completely unafraid of pursuing that which you love beyond all else. The height of enjoyment and good feelings I picked up during this movie was only paralleled by the soaring of my imagination as I went to sleep that night. What a beautiful way to make a kid's movie.", "Robert Rodriguez, director of 'Desperado' and 'The Faculty' lends his unique vision to a kid's film. 'Spy Kids' is about two children who discover that their parents are spies, and have to learn to become ones themselves in order to save them. Antonio Banderas and Carla Gugino star as the parents, but it is the kids who get more screen time (Alexa Vega and Daryl Sabara). Alan Cummings does a decent job, and other interesting stars are in this film including Robert Patrick, Cheech Marin, Teri Hatcherm, Tony Shaloub and a very cool cameo which I won't spoil.\n\nUnfortunately, 'Spy Kids', though entertaining, feels artificial and the kids themselves are underdeveloped. It is evident of a Spanish unusual flavour to this film which was different, and although the visual effects and characters were decent, I just wasn't fully buying into this world. I'm still going to see the sequel, but 'Spy Kids' certainly isn't the best kid's film of 2001 and is far from the Best Rodriguez film either.\n\n*** out of *****!", "The Story is About a Brother And Sister Who Figure Out That There Mom And Dad Are Really Actually Spy That Goes On Dangerous Missions Until Till One Day There Mom And Dad Who On There Way On a Mission They Happen To Be Kidnapped By The Bad Guys And it's Up To The Brother And The Sister To Save Them And Saving The World. Spy Kids Stars Antonio Banderas, Carla Gugino, Danny Trejo, Robert Patrick, Tony Shalhoub, Teri Hatcher, Alan Cumming, Cheech Marin And introducing Alexa Vega And Daryl Sabara As Carmen And Juni. Spy Kids is Sure One Cool Action Perfect For Kids All Ages.", "Spy Kids is nothing more than a generic spy film for kids. I can see some effort with some fun action, but the story doesn't execute well. It can be weak like other spy films for kids. Both the CGI and the costumes Ed can be outdated. And the characters are weak. Even the fact it would be hard to root for Carmen and Judy mainly because they would argue throughout the film. I guess the best thing the movie can offer is with some of the visuals, especially with Troublemaker's debut of filmmaking. So at least I can call this film harmless and it's for kids to enjoy. But maybe it's worth for spy fans. Maybe this would be the best of the Spy Kids films, but not really saying a lot.", "I won't deny Spy Kids being fun and as I watched the film I looked at it both through my eyes and through the eyes of a little kid. The effects were cool and the sets were cool and even most of the actors in the movie who i normally dont like were ok. So what sucks about it? It drags on. Now I read about how great the kids were and how they stole the show. They don't. The farthest they go is cute. But that'snot their fault. Film history only has a limited number of great child performances.\n\nThe story goes that two retired married spies are raising a family and get kidnapped by a fruity TV host. It's up to the little kids to save them. The plot sounds lame but in reality everything fits together. The bad guys were boring but all the robot kids and finger people rocked the horse's behind.\n\n**1/2", "That was the type of movie this was. On a lazy Saturday afternoon, with you, the person you love and your pet on the couch watching this movie.\n\nThis movie was a lot of fun and just plain nuts. You know have this stuff is not real - but you go on the trip with them.\n\nI had a great time. Look forward to seeing the other two.", "I was beginning to think the worlds filmmakers had forgotten how to make a good family movie. But, fear not SPY KIDS leaps forward to fill the gap. I really enjoyed this movie, as did my wife and 9/11 year old boys and have little or no criticism of it. Good baddies, good Goodies (although my only reservation was about Antonio Banderas in his role) and a plot that keeps it all moving on with a laugh. A good job this arrived in the UK just in time for the Easter Holidays (although with little or no pre-hype) and filled up an afternoon nicely. Well done!", "Like most films these days, there is nothing to this one except special effects. There is nothing to be learned or gained from watching this movie - just strap yourself in for the \"wild ride\" the critics often promise you, turn your brain off, and prepare to be bored by a bunch of dumb computer-rendered gadgetry and your typical disney-esque cookie-cutter plot. What a boring way to spend an hour and a half.", "The spy world created in this film is cool, it really is, and the theme of Family in this film is executed well, other than that this film is below average. The story is meh and the effects used throughout the film are just obviously fake which negatively impacts the films overall look.\n\nOverall, 5/10.", "Boring! Although the storyline is cool and some of the special effects are good, the movie is boring and dull. It's defenitely the best of the Spy Kids movies though, and does have some good moments.", "This is garbage I mean the first time I saw it I liked it, but the next few times I couldn't stand it. It was on HBO so I watched it. The story is two agents get captured. Then, there kids come go through predictible moments and finally save there parents at the end. I would recommend even Cody Banks over this because at least that one has action and a little comedy mixed in.", "All the actors in this film seem bored. They are not really interested in their roles and the dialogue is all delivered in monotone. It's a problem because I think the basic idea for the film is really very sound. I suppose it's just bad direction which leaves the actors drifting.", "This movie is a good thing to watch because kids can learn from this experience that these kids have. This movie shows u about passion. It shows just because your have a sibling doesn't mean u have to be mean to them. Later on you will thank your parents on having your sibling. If you think your life is hard enough think about this movie all the troubles that the kids in this movies had to go through. They had to save their parents. Imagine you in this movie. And having to go through all the hardships passing your way. All you got to know is that this movie is the best. The best in the world. It is out of this world. now think about the kids. It shows that skipping school is bad. It shows even if you are little. You still have a big BRAIN. And thats not all you need in life. You need your looks. Your sympathy and no more then that is enough.", "Spy Kids - Daryl Sabara, Alexa Vega, Antonio Bandaras, Tony Shaloub, Mike Judge, Cheech Marin, Carla Gugino.\n\nThe Plot - The Cortez family children find that they have to find there parents on a OSS mission so therefore they are spy kids with there parents. They try to rescue them from the evil Floop and his missing Foolglie.\n\nWhat I thought - Good movie, It had potential and it was not a see it and weep it like you wasted you're money.\n\nWhat was good - It had a nice family touch cause it was PG rated hey I liked it. People who didnt rent it buy it.\n\nIt is a 10/10"]}