{"reviews": ["It releases in 2 weeks. One person literally gave it 10 stars and said they hope it's good lol. Don't rate movies if you haven't seen them yet! Thank you.", "Thor Love and Thunder would exceed your expectations no matter how much you expect. It's filled with emotions, joy, romance and what not. The actors have done their job perfectly. Christian Bale as Gorr has been the film's backbone. A classic Taika styled film. It's colorful, the CGI is amazing and so much more. If you loved Thor Ragnarok, you would love Love and Thunder more than this.", "This is definitely the best movies in phase 4 of the mcu.\n\nIt certainly makes up for the disappointment that occurred in Doctor Strange 2.\n\nThor: love and thunder follows thor: ragnarok its \"comedy\" But it was better, its was so much funny and emotional and that was good because of the great performances we had by the actors specially natalie portman and christian bale... and all the other chrises in the movie.\n\nThe cinematography was great and also the visual effects witch was in my opinion better than what we saw on doctor strange 2.\n\nAll the thanks goes to Taika Waititi and the crew for this great movie.", "This is a far cry from the last Thor film and most of the Marvel films involving multiple characters. It is more like a series of episodes and not a real movie. Trying to force a \"new\" hero on us who isn't as fun as Thor makes the film drag. I fell asleep somewhere in the middle of it and was out for maybe 5 minutes but I didn't miss much. The film is cramped and the characters aren't flushed out enough to make you care about the action. What a disappointment.", "The effects and colors, they were perfect. Movie it self felt awesome but the character progression, oh god it was amazing. I never watched such fun marvel movie before, jokes was perfect 10/10 and there was no unnecessary scene. Taika Waititi did it again. This is probably the best super hero movie i have watched in a long long time. Shoutout to amazing work and team management of marvel.", "This is by far the best Thor movie I have ever seen since Thor: Ragnarok. Gorr the God Butcher played by Christian Bale, The Dark Knight himself, was both menacing and a great villain for Thor to face against. Mr. Watiti has done it again. I have so much respect for him. And please don't find anything negative about this movie. This movie is perfect. In every sense of the word. And don't say you have fallen asleep or that the movie is cramped with characters and is not interesting. Don't say any of that. This movie for one thing is not boring at all whatsoever. This is the best Thor movie by far in the MCU. Mr. Watiti knows what he is doing. I expect zero dislikes of this.", "So we need the lgbtq+ nonsense in every movie now. Gender swap race swap. Because its the world we living in? This move try to cover there tracks but still its a political correction film with a agenda open for this. Beside the story its to be fair not that bad. CGI is creative and good. The actors know there job and the move is about it fair to watch. But iam tired of those lgbtq+. Stop Disney with your promotions.", "It's a blast Thor Love and Thunder would exceed your expectations no matter how much you expect. It's filled with emotions, joy, romance and what not. The actors have done their job perfectly. Christian Bale as Gorr has been the film's backbone. A classic Taika styled film. It's colorful, the CGI is amazing and so much more. If you loved Thor Ragnarok, you would love Love and Thunder more than this.", "Thor love and thunder is an amazing film to watch I found it funny and at some parts I even got alittle sad but it was a really good movie and I would definitely recommend this movie 8.4/10.", "Taika Waititi second entry in the MCU was a wacky one as expected and had a lot of laughs and humour in it. Visuals were great as usual and overall the best Thor movie yet.", "Thor Love and Thunder would exceed your expectations no matter how much you expect. It's filled with emotions, joy, romance and what not. The actors have done their job perfectly. Christian Bale as Gorr has been the film's backbone. A classic Taika styled film. It's colorful, the CGI is amazing and so much more. If you loved Thor Ragnarok, you would love Love and Thunder more than this.", "Please MARVEL STOP MAKING LGBTQ FILMS , WE ALL LOVE THOR LOVE AND THUNDER BUT THE LGBTQ CHARACTERS MAKE OUR GOVERNMENTS CANCELLED THE FILM, I hope this movie will never get banned soon.", "Great in all the ways!!!!! With lots of jokes that are correctly placed by the good direction of Taika Watiti, that can make us laugh and cry in his movie that is the Number 1 Thor movie.", "Ever since I saw the masterpiece movie Morbius, known for the iconic line \"it's morbin time\" i have been in serious doubt that any movie could be so morbinly good. This movie however, I saw this movie, and it was remarkable. People say that Morbius was a movie, we'll Thor: Love and Thunder is also a movie! Fantastic.", "I've been waiting for this one for ages and the anticipation is immense. Can't wait to see Thor back to his trim self, Korg ripping up the place with humour and Jane in spandex and metal."]}