{
    "reviews": [
        "Like all rom-coms, YEH JAWAANI HAI DEEWANI sparkles with romance, merriment and heartache, is brightly glossy and boasts of crackling chemistry between its lead actors, but Ayan makes sure the heady concoction never waters down. The best part is, he never borrows from romantic clichés that most love stories depend upon and that, in my opinion, is this film's biggest strength. Expect no unwanted melodrama, no unwelcome characters, no earsplitting background music to accentuate the proceedings... On the whole, YEH JAWAANI HAI DEEWANI is a revitalizing take on romance and relationships. A wonderful cinematic experience, this one should strike a chord with not just the youth, but cineastes of all age-groups. Watch this celebration of love and get mesmerized!",
        "This was not really a romantic comedy, despite the cast lineup. It more like a smart, meaningful story. There are a lot of humorous moments but also a lot of good advice. The theme was not the only great aspect of Yeh Jawaani was the beautiful locations picked for the movie. The cinematography really brought out magic of travel and experiencing new things. Deepika once again displayed her acting genius with a transformation halfway through the movie. The new faces were excellent as well. The casting couldn't have been any better. Because I love traveling, maybe I am a bit biased. However, I do truly feel that it is a movie all youngsters should see. Its not too cheesy or dramatic, a bit for everyone to love.",
        "Yeh Jawani Hai Deewani Review\n\nGood Things: 1. Typical Bollywood movie - Songs, Drama, little fun action 2. Typical Karan Johar movie - Big/colorful sets,amazing locations Nothing else !\n\nBad Things: 1. Music - except couple of songs, its loud. 2. Story - Nothing new rather ghisi piti movie 3. Typical Ranbeer - With same roles & kind of dialogues, Ranbeer is boring now. 4. Double meaning or vulgar dialogues- it's nowadays fashion to have this kind of dialogues. As there are no good dialogues in the movie, only these dialogues make some fun. 5. Madhuri - Old Madhuri on worst song\n\nand many more...",
        "Poorly directed movie. Couldn't believe they made the whole movie based on world travel, where everyone thinks drinking is the best way to solve all their problems. The movie has a really big star cast - Ranbir, Deepika, Farroq Sheikh, etc but they fail to stimulate except Ranbir Kapoor and Kalki Koechlin. Deepika's dialogues put you to sleep. Her narration in the movie is extremely weak and is ridden with clichés. The story begins with flashback and there are some moments of excitement. Despite beginning with some promise the movie slows in the middle and ends up faltering. Though I enjoyed some of the moments in the movie but overall the screenplay does poor justification to what may have been a good storyline to begin with. The screenplay writer of this movie should really think hard if this is what he/she wants to do for life.",
        "Oh god! I cant believe that I spent my hard earned money to go watch this movie last night and I so regret it. This is a classic case of a movie by morons for morons. The movie has no plot whatsoever. What were the makers thinking while making this movie??? Where is the story??? What the hell was that all about??? The movie started out at a decent pace but very quickly lost pace and then it dragged on and on and on till I could no longer bear to sit. Thankfully the movie ended abruptly. It was like, OK enough messing around, lets end this movie now! Last but not the least, what was all that alcohol drinking all about? Most characters for most part of the movie have a wine glass or a beer bottle in their hand! Oh, now I understand! This movie was actually a very very long ad for the benefits of drinking alcohol! Well, there you go, now you know what you will be watching if you still want to go that is! YAWN!",
        "I was very much excited for yeh jawaani hai diwaani.Of course i am a Ranbir Kapoor fan after his two back to back super hits.It is also an Ayan Mukerji movie.Now i must say the movie was awesome.The story revolves around four friends bunny(Ranbir Kapoor) Avi(Aditya Roy Kapur)Billi(Deepika Padukone) and Aditi (Kalki Koechlin).Bunny is an adventure and fun loving guy where as Billi is a good nature d girl who loves to study.The movie revolves around four friends who take a road trip in their holidays to cherish their life. Every thing works well between them.Until bunny and Billi split up and meet at a wedding of their friends. The movie even gets better for its songs.special appearance of Madhuri Dixit in the song ghagara just rocked.Their was lot of comedy and funny movements.Emotional movements also worked up brightly.The movie was an absolute treat to watch.",
        "Boring, unrealistic and predictable. The movie never seemed to end. It could have easily shortened by 40 minutes. There were instances I actually wanted to stop watching. Its flawed and portrays a unrealistic and illogical story of Naina and Bunny. Not to forget the ironic ending.",
        "YEH JAWAANI HAI DEEWANI RATED TEN ON TEN SUBTITLES IN ENGLISH ARE AVAILABLE WITH OR FOR THE FOURTH WORLD NATIONS It is easier for immigrants from an immigrant or diasporic nation like from AMITAV GHOSH to be able to view the same movie as the subcontinent pay roll release of YEH JAWAANI HAI DEEWANI. The letter of to a loved on marks the symbol of love with a professional or personal touch like FOR MY LOVE or SEXY BOO.",
        "After all the hullabaloo and the packed theatres, I finally went to see it with my partner. And... I was disappointed. The movie started with a formulaic plot. The entire first half was a needlessly extended and excruciating cliché. I actually walked out of the hall because I couldn't bear the mediocrity and would have gone home had my partner not been there with me. The second half was made slightly better by the stronger dialogue.\n\nWhat I'm wondering is how a movie can be made that's almost three hours long but still gives you the feeling at the end of the day that the allegedly sumptuous meal you've just eaten hasn't filled half your belly.\n\nI'm not going to watch any more coming-of-age Bollywood movies. I'm through with beating the dead horse.",
        "Story, cast, direction is just so bad, I wonder how this movie didn't flop in the box office, ah nepotism, not I understand...",
        "Guys its typical Karan Johar movie the only difference is it didn't start with letter K. Ayan i didn't expect this kind of movie from you not because i bought tickets in black for this movie but you had showed us a nice story through Wake Up Sid and you deserved national award for that but YJHD its really put you in a league of entertainment cinema without story. I wish you will go back to same liking level of audience after WUS and before YJHD. And for Ranbir Kapoor .. Why did you choose this story..i know you liked to do different kind of films and with different characters ..but your character Bunny was similar to your movie BAH but its has some good connection points but in Bunny the flow of the character was really unrealistic like Karan Johar's movies character. Last but not least ...the film credit should goes like this Karan Johar -Director and Ayan Mukerji- producer.",
        "I watched it on Youtube last night as I had nothing better to do. Sooooo bad!!! These kind of movies were popular (with SRK) some 10 years back. In recent years, the track record of Bollywood (Barfi, Dirty Picture, Pan Singh Tomar, etc) makes you think it has evolved beautifully and quite positively. But such movies make you feel hopeless. What the hell is wrong with the producer? He and his films are all about some dream world which does not exist.\n\nKalki and Ranbir are really good actors, but their talent seem to be completely wasted here. Padukone gives bland expressions. And the other guy seems to be a serial drunkard (first Aashiqui and now this one). Forget about carrying any message, this movie even lacked the entertainment quotient. So only one word: AVOID!!!",
        "This movie was beyond awful... 1 star seems too generous honestly, it was the most hyped movie. I was so disappointed to see the movie. Which turned out to be an exaggeration of the trailer (that did seem quite promising at first). But anyway the movie itself had nothing else to offer, nothing new and was quite predictable as to where it was all heading. I'm ashamed that such a movie is still applauded by people when there are movies that get half as much recognition and really have talent! I walked out of the cinema during the ending because it was so awkward to watch. Don't get me wrong, I love Ranbir and Deepika as actors but this seemed like they gave it no thought when they decided to act in it and only went in it for the chance to somewhat flirt with one another all in the name of a \"movie\". The only good thing were the songs but after seeing the movie I didn't see their point because they had no story to them either. I usually like the songs better after seeing the movie.",
        "I don't know why this movie was so popular.. such a stupid movie. I can't stop laughing.. oh god what a idiotic story. This stupid teenager giving it highest rating for what? Ewwww cringeee... Ranbir man give some expression yaar seriously worst actor and Aditya he doesn't even know acting.. damn I need to watch some good movie to overcome by this masterpiece movie.",
        "\"Doesn't matter how hard you try, there will be something left out\". The movie states this loudly and actually the same can be said for the movie. The movie has one of the finest cast possible with awesome music. But then you have a predictable story-line and a prolonged sangeet sequence. You have Ranbir Kapoor brimming with unstoppable energy sharing the scorching chemistry with gorgeous Deepika. But then the director tries to pack-in too many things in those 2.5 hrs. But in the end, you can safely say you had a great time watching this rom-com because the movie has always its heart at right place. Deepika gives her best again after cocktail. Aditya Roy Kapoor (Ashiqui 2 fame), Kalki and Farooq Sheikh, all give their best shot. Ayaan who gave us Wake Up Sid shows that he is here for long run. Ranbir Kappor showcases his dancing skills with irresistible charisma in songs like \"Badtameez Dil\" and \"Dilli Wali Girlfriend\". All in all, you have 2013's first major blockbuster which entertains and provides food for though in equal measures.",
        "This wasn't just a Bollywood movie soley made for entertainment. This was a movie about emotions, about how people change, a movie about love and passion. An adventure full of growing up together as friends to figuring out what truly matters in life and time later on. An emotional start to the journey of Bollywood films that lie ahead.",
        "This could be a great ragging material. I do not understand what movies director think about Indian public. I went to watch this with friends with great excitement and this excitement could last only till first 20 minutes . We started hearing whispers from rest of audience which made us a bit more confident that we are not alone. It may be other way round as we may not be targeted for this movie. But I am very much interested to interview to anyone who was targeted for this movie and praised it. This film in simply nonsense, moreover, it is so called a dedicated to \"Youth\". The only thing I liked in this movie is that it got over before 2 and half hour otherwise it would have been made me mentally sick.",
        "this is strictly a one time watch... first half is good.2nd half is some what boring!!!!music is good,supporting actors done fine job. so people those fans of & love to watch light romantic movie here we are... leading actress looking good & beautiful so as actor. the movie take pace in 1st half. after the interval it some what slow down. end is as we expected.. as true movie lover is only one time watch & that's all. this movie written as Indian audience in mind but i think it remake of some Hollywood movie...as no other movie in competition with it. obviously it box-office record is grossing no point at all.overall go and watch with family,friend,lover but in my opinion it is ONE TIME WATCH..",
        "first 45 min are LONG BORE WITH NO CLUES.their is hardly any story . their are hell of things not taken care of .director tried to do similar to ZNMD BUT HAD FAILED MISERABLY.this film is only to put Ranbir Kapoor in spot light , his dad might have sponsored the film. people choose to watch film based on its songs which were average. Deepika was even more disappointing. Kalki and Aditya do their part good , way better than other two. i wonder how this film makes this much money? Indians if u want some good quality cinema ignore such movies . it would send a message to the makers that we wont watch bulls**t . Deepika starts remembering what happened 8 years ago and never returns back. guide says the BUTA peak is dangerous to climb yet the first timer Deepika does it easily. guide says no one has ever returned from the peak yet they come down with out any mountaineering equipment.",
        "Amazing movie from KJo. Impressive performances by Ranbir, Deepika & Kalki. Must watch, light hearted movie which you'll enjoy to the fullest with the family & friends. I specially liked the lines of Ranbir like when he meets Deepika after a pond time, he asks her whether she is married, she replays No, Then he asks whether you have kids & she answers, Yes- 6 & he spontaneously says, \"Behuda Aurat\" but in a very comic manner which i liked. There are many such little enjoyable lines throughout the movie. One more thing which I liked is the way Ranbir re-proposed Deepika in the end. The manner he proposed her was not all Filmy but very casual, which was commendable & different.",
        "Its a movie which was divided by two halves....the first half is excellent !! Fast , funny one liners, exotic locations and gr8 chemistry btw Ranbir, Kalki and Aditya !!\n\nBut Ayan Mukerjee shld know that u can't make an epic from a wafer thin plot. The story drags and drags....jokes dry up ....only music and dance keeps u awake and interested !! And the last half hr is a huge disappointment !!\n\nFrankly, its a Deepika's movie....she is brilliant !! Ranbir...sleep walks thru his role. This is not Barfi stuff. Kalki is superb while the bros...Aditya and Kunal are adequate. Farooq Sheikh deserved more screen time....what an actor !! And what the hell was Rana Daggubati doing in this film ??",
        "Yeh Jawaani Hai Deewani review:\n\nYeh jawaani hai deewani Story hai wahi ghisi piti puraani Par Ranbir ki acting hai solid mastani Deepika dikhti hai badi suhaani Dekh sakte hai ek baar bina pareshaani Yeh jawaani hai deewani\n\nRegards, Sumeet Nadkarni.",
        "Very inspiring & exciting movie about love,friendship,heartbreaks,passion & simplicity.\n\nA perfect all in the bucket movie for me(9/10)",
        "Ranbir-Deepika..the hottest pair of this decade. There was so much hype about this one,I wondered how mind blowing it would be. Then,the movie started. An hour into the movie and I could not figure out what was different about this one than the so many zillion formulaic movies made before..I could not think of one difference. Also,it's very lengthy,almost 3 hours. It felt like Ayan Mukherjee had to remind people he was still in the industry and he made a meaningless movie to prove this and he had an unlimited budget for this. Yes,the songs are great,the actors are too good and it's shot in very scenic locations,but it is the story or the absence of one that let me down. By the end of it,it felt like 4 great actors were thrown in front of the camera and asked to relive their earlier years. Nonetheless,it has a lot of dreamy content and it does make you feel good because of its good music and an unrealistic happy ending. Watch it if you're a big fan of the romantic genre.",
        "It's not a movie, it's an exciting journey that leaves you enthralled !! I watched this movie without many expectations and it surprised me with its beautifully carved screenplay and some astonishing dialogues. This movie has a message and some learnings that everyone can implement in their lives.\n\nThe actors have portrayed just what they needed to do. And all were brilliant in their roles. The music and songs are top-notch and their lyrics are just as meaningful.\n\nThere's a 4-5 minute dialogue sequence towards the latter half of the movie between Kabir and Naina which has some really meaningful and deep message. My favourite one is \"JITNA BHI TRY KARO, LIFE MEKN KUCH NA KUCH TOH CHHUTEGA HI... TOH JAHAN HAIN, WAHIN KA MAZAA LETE HAIN NA..\"",
        "Well it isn't that much different from our usual Bolly-wood mas-ala. But hats off to Ranbir and his co cast they make it a hell of a more fun. The movie is good. has a nice tempo. some good acting. Some good lines. Good songs and as a whole its an entertainment for sure. We see these kind of movies from time to time. It can be regarded as a typical Bolly-wood movie. But if you are a Ranbir fan its a must see for you. Well i liked the movie cause it was fun to watch with friends. Had a great time. So if you want to enjoy this movie gather your friends and put it on and surely you'll have a nice time spent together. In simple words, easy going , funny , at times a little sentimental(Bolly-wood trademark)and enjoyable.",
        "By far one of the best films I have watched . It's a pure entertainment Bollywood masala film which will keep you entertained & make your day . It's adventure , fun would encourage you to travel to a hilly or exotic location .I feel so lucky to wayltch this film in theater.",
        "If you are in bad mood or worried about future or overthinking, this movie is a perfect mood booster for you. You will find best dialogues, romance, dance, songs, dedication and the true friendship of modern era in the form of Karan Johar productions. But the ending was not of Karan Johar types. The dialogue 'Jitna bhi try krlo bunny, life mein kuch na kuch toh chhootega hi\" fits better on the ending of this movie as well. The ending could be like this: \"Aditi is getting married. Bunny and Naina smile at each other. Naina says him a sweet sa goodbye. Bunny's phone rings in a minute and he's off with his backpack. To a new destination while \"Illahi\" song plays in background. Avi got some investors and finally able to save his bar. Naina and Bunny both are happy they chose their life which is free from any boundaries.\"",
        "YJHD is one remarkable movie of the youth romance and drama genre. It is an absolute feel good movie. The four pivotal characters are brilliantly portrayed by the superb cast. Deepika, Ranbir, Kalki and Aditya lit up the screen. The director Ayan Mukherjee also deserves due appraisal. It's a must watch. The music is vibrant with excellency! Overall, I must say it is a movie to be remembered down the line.",
        "YJHD(2013): So.....was not expecting much outta this movie anyways...but, I wud have to admit that the movie started promisingly well and looked good till intermission. However, as you all know the fate of maximum Hindi movies after that, this movie also lingers and lingers a lot till director decides to end it in a way it cud have ended long ago. At least cud have saved 30 mins of audience. Power points of movie are Ranbir's acting and good punches in dialogue. Downside is that movie is having nothing new and kinda gets boring by end. I literally saw ppl watching time on when this movie is gonna end in hall. Lol.... Anyways.. Lets hope for a better flick next time... My 2 cents on this?? Don't waste your hard earned money...",
        "For me this movie is the biggest surprise of 2013, I had no hopes for this movie. I presumed It might be just another romance comedy and oh boy! wasn't I wrong. Honestly I've never been so happy to be proved wrong. Ranbir Kapoor is THE STAR of this film, he gets to show off his acting skills. Technically He is the best thing about the movie. This movie is something more than just being a story about how a guy finds love. It approaches the younger viewers more closely and gives away the secret that I've spent my lifetime searching-\"How to live your life?\". Alright! Lets put the message aside and judge this movie as a form of art. The Dialogues are perfect, Ranbir Kapoor Stoles the show like stealing a candy from a f**king baby, Deepika Padukone is there to represent us as a character to reproach Ranbir Kapoor's character ans she did a good job. Overall I think this film would approach more to the younger audience as compared to the elders because they're about to start their life and they get too emotionally attached. I give this movie 7.9/10.",
        "Boring and an overrated movie! I wonder how people gave this piece of shit 9 & 10. Most of the times there were just long songs one after the other. Ranbir Kapoor overacted in the whole movie and sometime it felt that there was no connection between his acting and the movie plot!",
        "The movie has two parts - the first part is like watching Travel and Living channel and the second part is like watching NDTV good Times. There is really no script or story and everybody except Kalki probably has no acting skills! There is no chemistry between the lead pair , which is an essential aspect while casting for a Rom Com (drama) like this. The whole movie is a drag and probably a good summary of what Bollywood is all about - wonderful cinematography (ad quality) combined with hollow script and non actors (of course never ending) The lucky people in the cinema hall were those who paid for the lazy-boy couches - they probably got a good nap!",
        "Though it didn't meet up to my expectations but it is not that bad at all.\n\nIt is all about friends and friendship mainly.\n\nExpect a lot mature stuff than this from director ayan Mukherjee.\n\nMusic and set design of the movie was good.",
        "A superb movie with marvellous crew recruited... awesome acting and dialogues were well time played...a very good movie giving a peacful journey throughout",
        "A story about friendship, about chasing your dreams and about knowing the right time to settle down. The first half is cliched garbage but the second half makes up for it with brilliant pacing and dialogue. The music is brilliant and the performances are good.",
        "The first thought before watching this movie was that it will be mixture of adventure, comedy and drama but the film was no longer near to my expectations. This movie was like director want to have every ingredient of movie making but it was undercooked.First half of movie is OK, songs are good and it passes really quick but for the second half i have to check every minute of my watch , not to mention movie was bit lengthy. when i was leaving i heard a bunch of people wow this movie is awesome, i will really suggest them to check their taste buds for movies. No offense to Ranbir and Deepika fans, this movie is only meant for you people, just go and say WOW Ranbir and WOW Deepika, because movie don't have anything else :)",
        "Great story and chemistry and also very well directed. I can relate and fell what the lead characters feel so much, their acting were excellent. I watch this for the second time, but still fall for Bunny and Naina. The songs are also beautiful and enjoyable for me. This is the best romance movie of Ranbir Kapoor. Cannot stand seeing the way Bunny look at Naina after a long time haven't meet. His gaze really deacribed his feelings toward Naina. Although this is romance movie, but they success telling and desceibing about family with the perfect portion. Last that i must tell are love the friendship relationship between those three. \"We should pursue the right thing at the right time\".",
        "Feels Regretted on late watch. Watched in August 2020 in lockdown periods. It's a feel good - romantic type of movie. Engaging story telling. And good performance from the actors.",
        "Entered the hall with high expectations. \"Wake up Sid\" was at the back of my mind when I decided to go for \"Yeh Jawaani Hai Deewani\". But it was a complete led down to the expectations as the story failed to grip the audience.\n\nMoreover I think that the storyline is somewhat similar to movies such as Bachna Ae Haseeno and DDLJ.\n\nThe plus points were Ranbir's performance and Deepikas's girl next door look.\n\nSo folks my perception is that instead of going to a hall just wait for the television premiere...",
        "Yeh Jawaani hai Deewani- 2013 Director: Ayaan Mukherji\n\nMuch more is expected from a writer and director like Ayaan. The movie has a really big star cast - Ranbir Kapoor, Deepika Padukone, Farroq Sheikh, etc but they fail to stimulate except Ranbir Kapoor and Kalki Koechlin. Undoubtedly the film has the best song collection of 2013.\n\nIt seemed more focus was given on the dreams of Ranbir as he remained the centre of attention in the movie. Overall the film set, the colors, songs were perfect but story lagged at several points, still it was loved by all despite of having errors in it.\n\nAnd as usual Aditya Roy Kapoor was found drinking to solve his problems. Eh !!",
        "Hi All, I went to watch this movie with a lot of hope to see something new in bollywood BUT it was a typical Karan Johar type love story.\n\nStory: Ranbir Kapoor aka Bunny is the cool crazy guy. Deepika aka Naina is a studious girl. They meet and Deepika falls in love because of bunny's carefree attitude but Bunny is not interested in love. Now, guess what happens in the end!!!\n\nMusic: Apart from Battameez dil and Kabira, all other songs are just OK. I don't know why they put so many songs in there.\n\nScenery: Yes this was good. Good locations and colorful dresses. But hey, isn't that what Karan Johar does the best.",
        "Extremely well written...and the acting by ranbir kapoor makes me love him even more...its not easy to completely overshadow deepika padukone..but Ranbir did it! Hats off.",
        "For all those romantic wanderers out there this is THE MOVIE.\n\nPerfect songs, Perfect Locales, Perfect cinematography, Perfect choreography, Perfect Direction & of course the Perfect Lead pair. Its as if Ranbir and Deepika were tailor made for this roles.\n\nThis is an enderaring romantic movie that you can watch for umpteen number of times. Deepika and Ranbir's acting is perfect. You can't get enough of them. Even Aditya roy, Kalki and Kunal roy have done a splendid job.\n\nAll in all, one of the best feel good romantic movies of all time.\n\nGo have fun....",
        "Success of movies like this is the main reason why Bollywood has started failing nowadays and South Indian Movies has started doing lot better business. Watch this movie if you want to learn about the blunders of Bollywood. Otherwise avoid it.",
        "The best bollywood movie in recent times. Gives a mix bag of emotions laugh, tears, etc, undoubtedly the best performance of Ranbir.",
        "They destroyed Sushant Singh Rajput. They target only one religion for their systematic propaganda",
        "No words to describe this master piece.....So so relatable ......Frnds and love.",
        "Love the chemistry between Ranbir and Deepika. Also, loved the two other supporting characters. Such a feel good movie. Loved it!! Can watch it over and over.",
        "It is art gallery .dictation is work over screen time in between time gap overwork effort.it is screen.",
        "Yeh Jawaani Hai Deewani :: I kinda found it decent enough..the movie had it clichéd plots and theme but was stylized for the Gen Y . Laced with soulful music with Ranbir s energy and DP's hotness ,was a decent recipe ,Kalki was the show stealer for me with her vivacious act ..Dragged in th 2nd half and started a bit slow... I would still have gone with a generous 3*..a well mad feel good romantic comedy entertainer\n\nP.S- We were more than 30 odd and I enjoyed every 1's company..made d viewing experience that much better. :) Always knew it would hit the Rs.100 Cr barrier , am glad its crossed that and in style. done close to Rs.190 Cr and counting ;)",
        "Very entertaining and beautiful romantic comedy drama movie. I went to watch this movie just before going to the college with one of my very good school friend. However, the friend didn't show up, so I end up watching this movie alone in a cinema hall(first and last time alone). So, this movie has a different place in my mind bcuz of the experience of watching it alone. I will remember this movie for the rest of my life, and watching it just before going to the college has a different place in my memories . However, the story could have been a bit better, but nonetheless it's a total entertainment package , specially the background music at different time intervals gives me goosebumps even after so many years!!!",
        "Alot of entertainment and emotions.a worth watch watch.",
        "Yes the movie is a perfect example of escapism. A Full on candy Floss- Fantasy -Formula love story with a tinch of reality checks here & there. It appears to be very modern and todays love story though it is almost a replica of 18 years old DDLJ. Dot by dot the story is same. Group of friends go to have a trip. The guys tease girls and girl finally falls for guy without knowing whether the guy also thinks same. And yes, the guy also realizes that and follows his love to a mega wedding ceremony which last for entire second half. Only difference here is the characters themselves and their dream are the major roadblock in the love story instead of their families. And eventually they overcome it. There is nothing much new in the story here but what new is the treatment, the way the story is being portrayed. Kudos to this young chap – Ayan Mukherjee who took up such a big challenge of redefining an old love story and man, he did his job!!! For the detailed awesome review, read this: mayahirahasya.blogspot.in",
        "it is a good movie for first 1hr but after 1 hr its kind off boring.and deepika was looking beautiful and ranbir is looking handsome as-usual.and kalki acting was very enjoyable..and avinash was OK-OK.but story was expectable and locations in movie was very awesome..in the beginning we thought its a very funny film but by the the film going and by the interval its just seem like a emotional movie.and at the end it was a package of a good movie.and manali trek tour in the movie was the best part.and the wedding part both are the best scenes.and i thought it was ayan mukherjee film i thought ayan was come with the new story.but film is not as enjoyable as i am expecting. overall it was a good movie.must watch!!!",
        "This movie has become a classic and I love watching it every time!",
        "This movie will make you laugh, cry and love at the same time. The actors did well. Just amazing work ! #friendship #love",
        "Good attention is given to details Story is also good A little lengthy.",
        "It's has been 7 years since this movie released. I enjoy watching this movie every time I watch it. This movie is complete entertainment package. Everyone should watch it at least once.",
        "A movie to watch whenever you are down, not feeling good or just feeling whatever and whenever this movie will just make you feel the best of inside you. The movie just makes us value all the precious we have in our life. The movie has some lines which are now classic lines everyone will always remember. The movie just moves us completely and in some part we can all relate to this. The trek the friendship bond and the fun they have all over the movie is just the best. A suggestion; there might just not be any deepika running towards you on the station, so just dont do a trek for that and ya take a trekking stick if you are going to plan a trek with your friends after the movie:)",
        "A must watch movie with friends as it is one of the best movie I've watched so much fun and everything everyone wishes to have friends like adi who always supports bunny no matters what .",
        "this movie plot may be usual one.. but is definitely an amazing journey..i did not know much about this movie when i went out with my friend today..but now i feel really good and something new after watching this.. Ranbir Kapoor and Deepika Padukone are at their best!!! the scenic beauty of Manali and Udaipur Taj is breath taking.. the music is not moving except the \"bartamiz dbl\".. if you are a person who loves to explore the world and take travel as profession, surely you can relate to Bunny(Ranbir)....this may not be a golden feather in the cap of Dharma productions, but surely is a silver feather.the history of the relationships and break ups between Ranbir and Deepika is not felt at all.. hats off to their professionalism.. the trio friendship is an old wine in new bottle but it still tastes good and refreshing if u are a fun loving person.. just go for it!!don't expect anything much!!just watch it!!",
        "7 years gone and you can still watch this movie with the same feel and emotions",
        "I watched this movie in 2013 or 14. At that time I sae this movie as a mere movie with great songs.\n\nBut now when I rewatch it after 8 years, it almost fills my mind. This movie made me extremely happy after watching and refreshed my old memories Its a must watch for everyone and all its music are lit too\n\nI end with its opening dialogue : Memories are like a sweetbox,once you open it you cant never stop in a piece of it.😍(\"Yaadein mithai ke dabbe ki tarah hota hai ek bar kholo to sirf ek tukda nahin kha paaoge.\")",
        "Such bad writing with cringey dialogues and extremely problematic scenes with no character arc. This movie owes all its success to it well written songs and not sloppy story and horrible writing.",
        "One of the best films. It had everything a film must hold. Gr8 performances gr8 direction. Full Paisa vasool entertainer. Must watch. Also the chemistry between rk & dp is 🔥🔥🔥",
        "What a fun entertainment movie man ,i still watch the movie again and again",
        "Very nice movie, you learn how to live life, how to enjoy it. It is a very very nice movie I love it.... Awsm songs and acting was good too.....Worth watching...... refreshing and energetic. love and friendship at its best. must watch for all youngsters at least once Awesome Movie I watched the movie on first week I really like this movie..itz jst 2 good... its a mixture of fun love entertenment evrythng what a movie should have\n\nI have now started finding better movies through www.flickstree.com.It not only suggests great movies to watch,it also tells where you can watch the movie online......I would highly recommend it......",
        "One of the best movie ever made by Bollywood, so much life lessons and wake up call for everyone who fed up with life..",
        "This used to be my favorite Bollywood movie until I watched recently and realized how cliche it is, still not that bad",
        "Words can't explain how much I loved this movie... definitely a 'must watch' movie...",
        "\"You can never be old and wise... If you were never young and crazy.\" Someone, who means a lot to me, suggested me to watch this movie. And, TBH this movie is just awesome! I loved it and I bet you'll also love it.",
        "I already watched it 5-6 times. Let's have a good luck to you. I will still be watching this movie again and again. Crying need yarr.",
        "I'd give two stars one for its music another for Deepika, jokes apart this movie is below average.\n\nFrom the acting stand point almost everyone in this movie over acted. Story, direction screenplay is also below per. As a normal viewer you can not connect to the story line unless you pretend to be connected to its melodramatic description. I can't digest the fact that it has got some good ratings and a blockbuster tag.",
        "I really like the movie. It's one of the best movies of Rabir Kapoor. This movie teaches us that we should do what we want to do.",
        "If you have lost many friends in our of achieving something aur reminishing the old memories . It is the best movie you can watch . This movie also feel give u a new way of seeing the life as we only have one acting level of every single actor is the at peak .\n\nI have watched this flim at least 20 times I still get the vibe I am watching it first time we can feel connected to story . This is not a typical bollywood movie that's make it more special .",
        "Maybe it's sound weird to watch again and again the same movie. But what makes it special? That's the question. It has great acting, romance, love and heartful feelings. I can't write it just go and watch now.",
        "It hurts you when you see a movie which had a potential of being good but leaves a bitter taste at the end. Story line is confusing and so was makeup. 8 years didn't bring any difference to any of four major characters. One major character seem to have no roll at all. It is kind of sad mixture of two or three recent hit movies like Zindagi Na Milegi Dobara. Karan Johar should spent more time making movies rather having coffees. Songs are barely OK. Even Kabeera's lyrics let it down, although beautiful music to it. I am banging my head about what Aashqui 2 guy Aditya Roy Kapoor is doing in this movie. Ranbir Kapoor and Kalki Koechlin are way over the top in first half of the movie. It seems the movie desperately cries for experience all along.",
        "You remember a movie not on Characters played or its cast, you remember the movie based on how it made you feel. I saw this movie in my Engineering. It is based on many people's life especially students traveling to US. There is always a period in life where you can't spend enough time for your loved one's and you have to move ahead. That's how it is. This movie is a classic example which makes you cry and laugh in the same movie. Just watch it once, it's worth it.\n\nThe acting of cast is perfect, the movie is full of adventure. You will definitely enjoy this 2 hours drama once you watch it. It is full of Bachelor's life and based on career of young ambitious person.\n\nThe last part really made me cry as Ranbir could not meet his father before his father's last breadth.",
        "Well, This is an idealistic movie. It can be an inspiration for all the young audience. Movie was mind blowing especially the characters and there part to play in this movie. The favorite character of mine is naina. She was such a bibliophile and turned into a different personality all at a time. From shy and studious naina to the bold and brave. She is the character who took my heart and this complete movie runs along with her that's the best part of it.",
        "This movie will never be old This movie is absolutely a gust of fresh air how many times I watch this movie, it seems like I am watching it for the first time.",
        "Old typical love story and lots of songs , no fun , it's just wasting up your time.",
        "Overrated , Predictable, shallow, clichéd, zero realistic. I hated the movie. Everything is just so freaking over the top and fake.",
        "I am a huge ranbir deepika fan,so it comes as no surprise that I can watch this movie n number of times.well ayan is an excellent director and the screenplay is awesome.The story is not great since its old formula but its presented well.\n\nThe director has made sure that he gives enough screen presence to all his characters but this somewhere eats into the lead pairs love story which is the crux of the movie. Nevertheless they manage to sizzle on screen with unbelievable chemistry,their eyes speak millions and in their intimate scenes they are in their own world.they display love as love is subtle and soul wrenching.How can the possibly be not in love.\n\nAyan uses this spark to his fullest.if nit for anything yjhd seems like ayans tribute to the love they once shared",
        "A movie that you can watch over and over again..!!",
        "A very nice movie which will make you follow your dreams even though what comes in your life...The theme was not the only great aspect of Ye h Jawaani was the beautiful locations picked for the movie. The cinematography really brought out magic of travel and experiencing new things It is a very inspiring movie for youngsters to not only enjoy there life to the fullest but also make make yourself self independent... However, I do truly feel that it is a movie all youngsters should see. Its not too cheesy or dramatic, a bit for everyone to love.\n\nA worth movie to watch....Full of Friendship, Love and Determination.",
        "It's one of my favorite movie. Infact after this movie Ranbir Kapoor is my favorite hero. Comedy, Romance, Friendship, Love, Ambition, Good Music. So it's a combo!! After watching this movie you'll fall in love Ranbir's character. Don't miss it."
    ]
}